[
  {
    "word": "abate",
    "definition": "to lessen in intensity or degree, gradually diminishing in force or strength",
    "exampleSentence": "The storm began to abate as dawn broke, leaving behind a gentle drizzle and a hopeful calm.",
    "synonym1": "subside",
    "synonym1Definition": "to sink or settle down, reducing in vigor or activity",
    "synonym1ExampleSentence": "Her anger slowly subsided as she listened to his heartfelt apology in the quiet room.",
    "synonym2": "wane",
    "synonym2Definition": "to decrease gradually in size, amount, or power, often fading away",
    "synonym2ExampleSentence": "The moon’s glow seemed to wane with each passing cloud, softening the night’s edge.",
    "synonym3": "diminish",
    "synonym3Definition": "to make or become less in scope or impact, shrinking over time",
    "synonym3ExampleSentence": "The crowd’s enthusiasm diminished as the rain soaked through their coats and spirits."
  },
  {
    "word": "aberration",
    "definition": "a departure from what is normal or expected",
    "exampleSentence": "The sudden storm was an aberration in the region’s dry season.",
    "synonym1": "anomaly",
    "synonym1Definition": "something that deviates from the standard",
    "synonym1ExampleSentence": "The bright moon was an anomaly in the daytime sky.",
    "synonym2": "deviation",
    "synonym2Definition": "the action of departing from a norm",
    "synonym2ExampleSentence": "A slight deviation in the plan caused a delay.",
    "synonym3": "irregularity",
    "synonym3Definition": "a thing that is not regular in occurrence",
    "synonym3ExampleSentence": "The irregularity of the pattern caught her eye."
  },
  {
    "word": "abhor",
    "definition": "to regard with disgust and hatred",
    "exampleSentence": "She couldn’t help but abhor the sight of litter on the beach.",
    "synonym1": "detest",
    "synonym1Definition": "to dislike intensely",
    "synonym1ExampleSentence": "He detests the chaos of crowded cities.",
    "synonym2": "loathe",
    "synonym2Definition": "to feel intense dislike or disgust for",
    "synonym2ExampleSentence": "They loathe the taste of bitter medicine.",
    "synonym3": "despise",
    "synonym3Definition": "to feel contempt or deep repugnance for",
    "synonym3ExampleSentence": "She despises arrogance in any form."
  },
  {
    "word": "abrogate",
    "definition": "to repeal or do away with a law, right, or formal agreement officially",
    "exampleSentence": "The government decided to abrogate the outdated treaty, freeing both nations to renegotiate terms.",
    "synonym1": "annul",
    "synonym1Definition": "to declare invalid or void, especially with legal authority",
    "synonym1ExampleSentence": "The judge chose to annul the contract after discovering evidence of fraud.",
    "synonym2": "revoke",
    "synonym2Definition": "to officially cancel or withdraw a privilege, license, or decree",
    "synonym2ExampleSentence": "The committee moved to revoke his membership due to repeated violations of the rules.",
    "synonym3": "rescind",
    "synonym3Definition": "to take back or repeal an order or decision formally",
    "synonym3ExampleSentence": "The mayor agreed to rescind the controversial policy after public outcry grew too loud to ignore."
  },
  {
    "word": "abstemious",
    "definition": "marked by moderation and restraint, especially in the consumption of food or drink",
    "exampleSentence": "His abstemious habits surprised his friends, who watched him sip a single glass of wine all evening.",
    "synonym1": "temperate",
    "synonym1Definition": "showing self-control and moderation, avoiding excess in behavior",
    "synonym1ExampleSentence": "She lived a temperate life, balancing indulgence with discipline in her mountain retreat.",
    "synonym2": "frugal",
    "synonym2Definition": "sparing or economical, particularly with resources like food or money",
    "synonym2ExampleSentence": "The frugal traveler packed lightweight meals to stretch his budget across continents.",
    "synonym3": "spartan",
    "synonym3Definition": "characterized by simplicity and austerity, rejecting luxury or comfort",
    "synonym3ExampleSentence": "Their spartan diet of bread and water sustained them through the rigorous training."
  },
  {
    "word": "abstruse",
    "definition": "difficult to understand",
    "exampleSentence": "The abstruse text left readers scratching their heads.",
    "synonym1": "arcane",
    "synonym1Definition": "mysterious and known to few",
    "synonym1ExampleSentence": "The arcane symbols puzzled the scholars.",
    "synonym2": "esoteric",
    "synonym2Definition": "intended for a small, specialized group",
    "synonym2ExampleSentence": "Her esoteric knowledge impressed the experts.",
    "synonym3": "recondite",
    "synonym3Definition": "little known or obscure",
    "synonym3ExampleSentence": "The recondite theory baffled beginners."
  },
  {
    "word": "accolade",
    "definition": "an award or expression of praise, often given as a mark of honor or recognition",
    "exampleSentence": "The poet received an accolade from her peers, a golden laurel for her haunting verses.",
    "synonym1": "commendation",
    "synonym1Definition": "formal praise or approval, often bestowed for notable achievement",
    "synonym1ExampleSentence": "The soldier earned a commendation for his bravery under fire, pinned proudly to his chest.",
    "synonym2": "tribute",
    "synonym2Definition": "an act or statement honoring someone’s worth or accomplishments",
    "synonym2ExampleSentence": "The mural was a tribute to the town’s founders, painted in vibrant hues across the square.",
    "synonym3": "plaudit",
    "synonym3Definition": "enthusiastic approval or applause, typically from a group",
    "synonym3ExampleSentence": "The actor basked in the plaudits of the audience, their cheers echoing through the theater."
  },
  {
    "word": "acquiesce",
    "definition": "to accept something reluctantly but without protest",
    "exampleSentence": "He chose to acquiesce to the group’s decision despite his doubts.",
    "synonym1": "comply",
    "synonym1Definition": "to act in accordance with a wish or command",
    "synonym1ExampleSentence": "She complied with the request to stay late.",
    "synonym2": "consent",
    "synonym2Definition": "to give permission for something to happen",
    "synonym2ExampleSentence": "They consented to the trip after some hesitation.",
    "synonym3": "yield",
    "synonym3Definition": "to give way to arguments or pressure",
    "synonym3ExampleSentence": "He yielded to the demands of the impatient crowd."
  },
  {
    "word": "acrimonious",
    "definition": "marked by bitterness or sharp resentment, often in speech or behavior",
    "exampleSentence": "The acrimonious divorce proceedings left both parties drained, their words cutting deeper than knives.",
    "synonym1": "bitter",
    "synonym1Definition": "characterized by intense hostility or rancor, often lingering painfully",
    "synonym1ExampleSentence": "Her bitter retort stung him, a reminder of old wounds reopened in the heat of the moment.",
    "synonym2": "caustic",
    "synonym2Definition": "harshly sarcastic or corrosive, capable of burning through civility",
    "synonym2ExampleSentence": "His caustic critique of the plan dismantled it piece by piece, leaving silence in its wake.",
    "synonym3": "vitriolic",
    "synonym3Definition": "filled with vicious spite or malice, like a venomous attack",
    "synonym3ExampleSentence": "The vitriolic debate online spiraled into personal insults, shocking even seasoned observers."
  },
  {
    "word": "acumen",
    "definition": "keen insight or judgment",
    "exampleSentence": "His acumen in negotiations secured a favorable deal.",
    "synonym1": "discernment",
    "synonym1Definition": "the ability to judge well",
    "synonym1ExampleSentence": "Her discernment helped her choose wisely.",
    "synonym2": "shrewdness",
    "synonym2Definition": "practical intelligence and cleverness",
    "synonym2ExampleSentence": "His shrewdness turned a profit in tough times.",
    "synonym3": "perspicacity",
    "synonym3Definition": "keenness of understanding",
    "synonym3ExampleSentence": "Her perspicacity revealed the hidden flaws."
  },
  {
    "word": "admonish",
    "definition": "to warn or reprimand someone firmly, often with a tone of gentle correction",
    "exampleSentence": "The teacher had to admonish the students for whispering, her voice stern yet kind beneath the chalk dust.",
    "synonym1": "reprove",
    "synonym1Definition": "to express disapproval or criticism, typically with mild rebuke",
    "synonym1ExampleSentence": "She reproved her son for tracking mud inside, her frown softened by a loving glance.",
    "synonym2": "chide",
    "synonym2Definition": "to scold or nag gently, often with an affectionate undertone",
    "synonym2ExampleSentence": "He chided his friend for forgetting the map, chuckling as they retraced their steps.",
    "synonym3": "rebuke",
    "synonym3Definition": "to criticize sharply or formally, conveying strong disapproval",
    "synonym3ExampleSentence": "The manager rebuked the team for their sloppy work, demanding better effort tomorrow."
  },
  {
    "word": "alacrity",
    "definition": "brisk and cheerful readiness or eagerness to act or respond",
    "exampleSentence": "She accepted the challenge with alacrity, her eyes sparkling as she leapt into the project.",
    "synonym1": "eagerness",
    "synonym1Definition": "enthusiastic desire or willingness, often shown with energy",
    "synonym1ExampleSentence": "His eagerness to learn shone through as he scribbled notes during the lecture.",
    "synonym2": "promptness",
    "synonym2Definition": "the quality of acting quickly and without delay, often efficiently",
    "synonym2ExampleSentence": "Her promptness in replying to emails earned her a reputation for reliability.",
    "synonym3": "zeal",
    "synonym3Definition": "great enthusiasm or passion, especially in pursuit of a cause",
    "synonym3ExampleSentence": "The volunteers worked with zeal, planting trees under the blazing sun without complaint."
  },
  {
    "word": "ameliorate",
    "definition": "to make something better or less severe",
    "exampleSentence": "The new policies aim to ameliorate the strain on public resources.",
    "synonym1": "improve",
    "synonym1Definition": "to enhance in quality or condition",
    "synonym1ExampleSentence": "A fresh coat of paint will improve the room’s appearance.",
    "synonym2": "alleviate",
    "synonym2Definition": "to reduce the intensity or severity of",
    "synonym2ExampleSentence": "The cool breeze helped alleviate the day’s oppressive heat.",
    "synonym3": "mitigate",
    "synonym3Definition": "to lessen the impact or seriousness of",
    "synonym3ExampleSentence": "Planting trees can mitigate some effects of urban sprawl."
  },
  {
    "word": "anathema",
    "definition": "something or someone intensely detested or cursed, often formally denounced",
    "exampleSentence": "To the purist baker, using margarine instead of butter was anathema, a betrayal of tradition.",
    "synonym1": "abomination",
    "synonym1Definition": "a thing causing intense disgust or hatred, viewed as vile",
    "synonym1ExampleSentence": "The abandoned house was an abomination, its decay offending the tidy neighborhood.",
    "synonym2": "bane",
    "synonym2Definition": "a source of persistent misery or harm, like a curse",
    "synonym2ExampleSentence": "Rain became the bane of the festival, soaking tents and spirits alike.",
    "synonym3": "execration",
    "synonym3Definition": "an object of loathing or a formal curse, steeped in contempt",
    "synonym3ExampleSentence": "The traitor’s name became an execration, whispered with scorn in every tavern."
  },
  {
    "word": "antediluvian",
    "definition": "extremely old or outdated, as if from before the biblical flood",
    "exampleSentence": "The antediluvian machinery in the factory creaked and groaned, a relic of a bygone industrial age.",
    "synonym1": "archaic",
    "synonym1Definition": "belonging to a much earlier time, often obsolete or quaint",
    "synonym1ExampleSentence": "The archaic language of the text puzzled modern readers, its charm lost in translation.",
    "synonym2": "antiquated",
    "synonym2Definition": "old-fashioned or no longer useful, surpassed by newer methods",
    "synonym2ExampleSentence": "The antiquated phone lacked a screen, a curiosity to the tech-savvy teenagers.",
    "synonym3": "primeval",
    "synonym3Definition": "originating from the earliest ages, raw and ancient",
    "synonym3ExampleSentence": "The primeval forest stood untouched, its towering trees whispering of forgotten eras."
  },
  {
    "word": "apocryphal",
    "definition": "of doubtful authenticity or origin, often widely circulated as true",
    "exampleSentence": "The apocryphal tale of the ghost in the attic thrilled the children, though no one could verify its source.",
    "synonym1": "spurious",
    "synonym1Definition": "false or fake, lacking genuineness despite appearances",
    "synonym1ExampleSentence": "The spurious painting fooled collectors until an expert spotted the modern brushstrokes.",
    "synonym2": "mythical",
    "synonym2Definition": "existing only in legend or imagination, not rooted in fact",
    "synonym2ExampleSentence": "The mythical creature of the lake drew tourists, eager for a glimpse of fantasy.",
    "synonym3": "dubious",
    "synonym3Definition": "open to question or suspicion, not fully trustworthy",
    "synonym3ExampleSentence": "Her dubious account of the event raised eyebrows among those who knew the details."
  },
  {
    "word": "ascetic",
    "definition": "practicing severe self-discipline and abstention from indulgence",
    "exampleSentence": "The ascetic monk lived in a bare cell, his days filled with prayer and little else.",
    "synonym1": "austere",
    "synonym1Definition": "sternly simple or plain, rejecting comfort or luxury",
    "synonym1ExampleSentence": "Her austere clothing reflected a life unconcerned with fashion or frills.",
    "synonym2": "spartan",
    "synonym2Definition": "marked by strict simplicity and avoidance of excess",
    "synonym2ExampleSentence": "The spartan room held only a cot and a lamp, sufficient for his modest needs.",
    "synonym3": "abstinent",
    "synonym3Definition": "voluntarily refraining from pleasures, especially food or drink",
    "synonym3ExampleSentence": "He remained abstinent during the feast, sipping water while others indulged."
  },
  {
    "word": "assiduous",
    "definition": "showing persistent care and attention, working diligently over time",
    "exampleSentence": "The assiduous researcher combed through dusty archives, piecing together a forgotten history.",
    "synonym1": "diligent",
    "synonym1Definition": "having or showing steady effort and focus, often painstakingly",
    "synonym1ExampleSentence": "Her diligent preparation for the exam earned her top marks in every subject.",
    "synonym2": "sedulous",
    "synonym2Definition": "persevering with careful and dedicated effort, tirelessly thorough",
    "synonym2ExampleSentence": "The sedulous gardener tended each plant, coaxing blooms from even the weakest stems.",
    "synonym3": "industrious",
    "synonym3Definition": "consistently hardworking and productive, marked by energy",
    "synonym3ExampleSentence": "The industrious carpenter crafted intricate designs, his workshop alive with sawdust and song."
  },
  {
    "word": "august",
    "definition": "respected and impressive, inspiring reverence or admiration",
    "exampleSentence": "The august presence of the elder statesman hushed the room, his wisdom commanding attention.",
    "synonym1": "venerable",
    "synonym1Definition": "accorded deep respect due to age, character, or achievement",
    "synonym1ExampleSentence": "The venerable oak stood as a silent witness to centuries of village life.",
    "synonym2": "majestic",
    "synonym2Definition": "having grandeur or dignity, striking in its nobility",
    "synonym2ExampleSentence": "The majestic cathedral loomed over the city, its spires piercing the sky.",
    "synonym3": "eminent",
    "synonym3Definition": "distinguished and prominent, standing out for excellence",
    "synonym3ExampleSentence": "The eminent scientist’s lecture drew scholars from across the globe, eager for insight."
  },
  {
    "word": "avarice",
    "definition": "an extreme greed for wealth or material gain, often insatiable",
    "exampleSentence": "His avarice drove him to hoard every penny, turning friends into strangers over petty debts.",
    "synonym1": "covetousness",
    "synonym1Definition": "an intense desire to possess what belongs to others, fueled by envy",
    "synonym1ExampleSentence": "Her covetousness flared as she eyed the glittering necklace in her rival’s hands.",
    "synonym2": "rapacity",
    "synonym2Definition": "aggressive greed or plunder, seizing with predatory hunger",
    "synonym2ExampleSentence": "The rapacity of the invaders stripped the land bare, leaving nothing for the locals.",
    "synonym3": "cupidity",
    "synonym3Definition": "a strong craving for wealth or possessions, often blindly selfish",
    "synonym3ExampleSentence": "His cupidity blinded him to the beauty of the world beyond his growing pile of gold."
  },
  {
    "word": "baleful",
    "definition": "threatening harm or evil, often with a menacing or sinister quality",
    "exampleSentence": "The baleful glare of the wolf froze the hiker, its eyes glinting in the moonlit forest.",
    "synonym1": "malevolent",
    "synonym1Definition": "having or showing a wish to do evil or cause harm to others",
    "synonym1ExampleSentence": "The malevolent whisper in the dark hinted at plans far darker than anyone suspected.",
    "synonym2": "ominous",
    "synonym2Definition": "suggesting that something bad is about to happen, forebodingly",
    "synonym2ExampleSentence": "The ominous clouds gathered low, casting shadows that unsettled the village below.",
    "synonym3": "sinister",
    "synonym3Definition": "giving the impression of evil or danger, disturbingly threatening",
    "synonym3ExampleSentence": "A sinister smile crept across his face, chilling those who caught its fleeting curve."
  },
  {
    "word": "beguile",
    "definition": "to charm or enchant someone, often in a deceptive or captivating way",
    "exampleSentence": "The storyteller’s vivid tales beguiled the children, drawing them into a world of wonder and mystery.",
    "synonym1": "captivate",
    "synonym1Definition": "to attract and hold interest powerfully, as if under a spell",
    "synonym1ExampleSentence": "The dancer’s graceful moves captivated the audience, leaving them breathless with awe.",
    "synonym2": "enchant",
    "synonym2Definition": "to delight or fill with wonder, often with a magical quality",
    "synonym2ExampleSentence": "The enchanted forest in the book seemed to leap off the page with every vivid detail.",
    "synonym3": "deceive",
    "synonym3Definition": "to mislead by a false appearance or statement, tricking the senses",
    "synonym3ExampleSentence": "The illusionist deceived the crowd with a sleight of hand that left them questioning reality."
  },
  {
    "word": "bellicose",
    "definition": "demonstrating a readiness or eagerness to engage in conflict or fighting",
    "exampleSentence": "His bellicose rhetoric during the debate hinted at a willingness to escalate tensions rather than seek peace.",
    "synonym1": "belligerent",
    "synonym1Definition": "hostile and aggressive, often with an inclination toward confrontation",
    "synonym1ExampleSentence": "The belligerent neighbor shouted threats over the fence, startling the quiet street.",
    "synonym2": "pugnacious",
    "synonym2Definition": "quick to argue or quarrel, showing a combative spirit",
    "synonym2ExampleSentence": "Her pugnacious attitude in meetings often turned discussions into heated arguments.",
    "synonym3": "contentious",
    "synonym3Definition": "likely to cause disagreement or strife due to a quarrelsome nature",
    "synonym3ExampleSentence": "The contentious proposal split the council into fiercely opposing factions."
  },
  {
    "word": "belligerent",
    "definition": "hostile and aggressive",
    "exampleSentence": "His belligerent tone during the debate surprised the audience.",
    "synonym1": "combative",
    "synonym1Definition": "ready or eager to fight",
    "synonym1ExampleSentence": "The combative player challenged every call.",
    "synonym2": "antagonistic",
    "synonym2Definition": "showing opposition or hostility",
    "synonym2ExampleSentence": "Her antagonistic remarks sparked a heated argument.",
    "synonym3": "pugnacious",
    "synonym3Definition": "eager or quick to argue or fight",
    "synonym3ExampleSentence": "The pugnacious dog barked at every passerby."
  },
  {
    "word": "bemoan",
    "definition": "to express sorrow, regret, or discontent, often with mournful tones",
    "exampleSentence": "She would bemoan the loss of summer as leaves fell, her voice heavy with nostalgia.",
    "synonym1": "lament",
    "synonym1Definition": "to mourn or grieve deeply, often aloud with passionate sadness",
    "synonym1ExampleSentence": "The widow lamented her husband’s passing, her cries echoing through the empty house.",
    "synonym2": "bewail",
    "synonym2Definition": "to express great sorrow or distress, typically with intensity",
    "synonym2ExampleSentence": "He bewailed the ruined harvest, his hands clutching the wilted stalks in despair.",
    "synonym3": "deplore",
    "synonym3Definition": "to feel or express strong disapproval or regret, often morally",
    "synonym3ExampleSentence": "They deplored the city’s decay, shaking their heads at the crumbling walls once so grand."
  },
  {
    "word": "benevolent",
    "definition": "well-meaning and kindly",
    "exampleSentence": "The benevolent donor funded the new library wing.",
    "synonym1": "charitable",
    "synonym1Definition": "generous in giving to those in need",
    "synonym1ExampleSentence": "Her charitable acts warmed the community.",
    "synonym2": "magnanimous",
    "synonym2Definition": "nobly generous or forgiving",
    "synonym2ExampleSentence": "His magnanimous gesture surprised his rivals.",
    "synonym3": "altruistic",
    "synonym3Definition": "unselfishly concerned for others",
    "synonym3ExampleSentence": "Her altruistic efforts aided the shelter."
  },
  {
    "word": "benign",
    "definition": "gentle, kind, or harmless in effect, lacking malice or threat",
    "exampleSentence": "The benign old professor welcomed questions, his smile as warm as the afternoon sun.",
    "synonym1": "benevolent",
    "synonym1Definition": "well-meaning and kindly disposed, intending good for others",
    "synonym1ExampleSentence": "The benevolent donor funded the school, her generosity lighting up young faces.",
    "synonym2": "innocuous",
    "synonym2Definition": "not harmful or offensive, safely mild in impact",
    "synonym2ExampleSentence": "The innocuous comment slipped by unnoticed, too gentle to stir the tense room.",
    "synonym3": "gracious",
    "synonym3Definition": "marked by courtesy and generous goodwill, elegantly kind",
    "synonym3ExampleSentence": "Her gracious hosting turned strangers into friends over tea and laughter."
  },
  {
    "word": "blandishment",
    "definition": "flattering or coaxing statements",
    "exampleSentence": "His blandishment won her reluctant agreement.",
    "synonym1": "flattery",
    "synonym1Definition": "excessive or insincere praise",
    "synonym1ExampleSentence": "Her flattery softened his stern demeanor.",
    "synonym2": "cajolery",
    "synonym2Definition": "persuasion by flattery or promises",
    "synonym2ExampleSentence": "The cajolery lured him into the deal.",
    "synonym3": "wheedling",
    "synonym3Definition": "use of flattery to persuade",
    "synonym3ExampleSentence": "Her wheedling got her an extra dessert."
  },
  {
    "word": "blithe",
    "definition": "showing a carefree or casually cheerful indifference, often lighthearted",
    "exampleSentence": "She danced with blithe abandon through the meadow, untroubled by the gathering dusk.",
    "synonym1": "cheerful",
    "synonym1Definition": "noticeably happy and optimistic, radiating good spirits",
    "synonym1ExampleSentence": "His cheerful whistle floated over the garden, lifting the mood of everyone nearby.",
    "synonym2": "carefree",
    "synonym2Definition": "free from anxiety or responsibility, joyfully unburdened",
    "synonym2ExampleSentence": "The carefree children chased butterflies, their laughter ringing through the warm air.",
    "synonym3": "jovial",
    "synonym3Definition": "hearty and full of good humor, robustly merry",
    "synonym3ExampleSentence": "The jovial innkeeper regaled guests with tales, his booming laugh infectious."
  },
  {
    "word": "bolster",
    "definition": "to support or strengthen, often adding reinforcement or encouragement",
    "exampleSentence": "The coach’s pep talk bolstered the team’s spirits, sending them onto the field with renewed fire.",
    "synonym1": "fortify",
    "synonym1Definition": "to make stronger or more secure, building resilience",
    "synonym1ExampleSentence": "She fortified her argument with data, turning skeptics into believers one fact at a time.",
    "synonym2": "reinforce",
    "synonym2Definition": "to strengthen by adding extra support or material",
    "synonym2ExampleSentence": "The carpenter reinforced the sagging shelf, ensuring it could hold the heavy books.",
    "synonym3": "buttress",
    "synonym3Definition": "to provide a stabilizing support, often structurally or figuratively",
    "synonym3ExampleSentence": "He buttressed his claim with examples, steadying it against the storm of criticism."
  },
  {
    "word": "bombastic",
    "definition": "high-sounding and pretentious in language, often with little substance",
    "exampleSentence": "The politician’s bombastic speech promised miracles, but the crowd saw through its hollow grandeur.",
    "synonym1": "pompous",
    "synonym1Definition": "arrogantly self-important, puffed up with exaggerated pride",
    "synonym1ExampleSentence": "His pompous strut through the office grated on colleagues who valued humility.",
    "synonym2": "grandiloquent",
    "synonym2Definition": "extravagant and lofty in expression, aiming to impress",
    "synonym2ExampleSentence": "The grandiloquent toast at the wedding left guests bemused by its florid tangents.",
    "synonym3": "turgid",
    "synonym3Definition": "overly complex or swollen with pomp, lacking clarity",
    "synonym3ExampleSentence": "The turgid essay drowned its good ideas in a sea of unnecessary jargon."
  },
  {
    "word": "brook",
    "definition": "to tolerate or allow something, often reluctantly or with limits",
    "exampleSentence": "She would brook no interruptions during her speech, her gaze silencing the restless audience.",
    "synonym1": "endure",
    "synonym1Definition": "to bear or put up with something unpleasant, often patiently",
    "synonym1ExampleSentence": "He endured the cold wind on the cliff, determined to finish his sketch of the sea.",
    "synonym2": "tolerate",
    "synonym2Definition": "to accept or permit something despite disapproval or discomfort",
    "synonym2ExampleSentence": "The teacher tolerated the chatter, knowing the students needed a moment to unwind.",
    "synonym3": "suffer",
    "synonym3Definition": "to experience or allow something disagreeable, often with resignation",
    "synonym3ExampleSentence": "He suffered her sharp remarks in silence, unwilling to spark a larger fight."
  },
  {
    "word": "burgeon",
    "definition": "to grow or increase rapidly, flourishing or expanding vigorously",
    "exampleSentence": "The tiny startup began to burgeon after the viral ad, its offices buzzing with new hires.",
    "synonym1": "flourish",
    "synonym1Definition": "to thrive or prosper, often with vibrant success",
    "synonym1ExampleSentence": "The roses flourished under her care, their crimson petals a testament to her skill.",
    "synonym2": "proliferate",
    "synonym2Definition": "to multiply or spread quickly in number or presence",
    "synonym2ExampleSentence": "Wildflowers proliferated across the field, painting the hills in sudden bursts of color.",
    "synonym3": "expand",
    "synonym3Definition": "to grow larger in size, scope, or influence, stretching outward",
    "synonym3ExampleSentence": "The bakery expanded into a chain, its warm scents wafting through new towns."
  },
  {
    "word": "cacophony",
    "definition": "a harsh, discordant mixture of sounds",
    "exampleSentence": "The cacophony of horns filled the busy intersection.",
    "synonym1": "din",
    "synonym1Definition": "a loud, unpleasant noise",
    "synonym1ExampleSentence": "The din of the crowd drowned out the speaker.",
    "synonym2": "discord",
    "synonym2Definition": "lack of harmony in sounds",
    "synonym2ExampleSentence": "The discord of clashing instruments jarred the ears.",
    "synonym3": "racket",
    "synonym3Definition": "a loud, disturbing noise",
    "synonym3ExampleSentence": "The racket from the street kept her awake."
  },
  {
    "word": "cajole",
    "definition": "to persuade someone gently through flattery or coaxing",
    "exampleSentence": "She managed to cajole her reluctant brother into joining the hike with promises of stunning views.",
    "synonym1": "coax",
    "synonym1Definition": "to influence or urge gently, often with patience and care",
    "synonym1ExampleSentence": "He coaxed the shy kitten from its hiding spot with soft words and a bit of tuna.",
    "synonym2": "wheedle",
    "synonym2Definition": "to use flattery or charm to extract something, often playfully",
    "synonym2ExampleSentence": "She wheedled an extra cookie from the baker, her smile too sweet to resist.",
    "synonym3": "inveigle",
    "synonym3Definition": "to entice or trick someone into agreement, often subtly",
    "synonym3ExampleSentence": "He inveigled his friends into the scheme with tales of adventure and quick rewards."
  },
  {
    "word": "callow",
    "definition": "immature or inexperienced, often lacking sophistication or wisdom",
    "exampleSentence": "The callow recruit stumbled through drills, his eagerness outpacing his untested skills.",
    "synonym1": "green",
    "synonym1Definition": "lacking training or maturity, fresh and unseasoned",
    "synonym1ExampleSentence": "The green intern fumbled with the copier, blushing at his novice mistakes.",
    "synonym2": "naive",
    "synonym2Definition": "showing a lack of experience or judgment, innocently trusting",
    "synonym2ExampleSentence": "Her naive belief in quick fixes faded after the first real challenge hit.",
    "synonym3": "youthful",
    "synonym3Definition": "having the qualities of early life, often impulsive or unrefined",
    "synonym3ExampleSentence": "His youthful energy drove him to leap before looking, a trait time would temper."
  },
  {
    "word": "calumny",
    "definition": "the act of making false and harmful statements to damage someone’s reputation",
    "exampleSentence": "The politician faced a barrage of calumny from opponents eager to tarnish his public image before the election.",
    "synonym1": "slander",
    "synonym1Definition": "a spoken false statement intended to harm a person’s standing or character",
    "synonym1ExampleSentence": "She sued the tabloid for slander after it published lies about her private life.",
    "synonym2": "defamation",
    "synonym2Definition": "the action of damaging someone’s good reputation through false or misleading claims",
    "synonym2ExampleSentence": "The defamation lawsuit sought to clear his name after months of baseless accusations.",
    "synonym3": "libel",
    "synonym3Definition": "a written or published false statement that unjustly harms someone’s reputation",
    "synonym3ExampleSentence": "The author faced a libel charge for the scathing biography that twisted facts about her subject."
  },
  {
    "word": "candor",
    "definition": "the quality of being open, honest, and straightforward in expression",
    "exampleSentence": "Her candor about her struggles won the trust of the group, who admired her unguarded truth.",
    "synonym1": "frankness",
    "synonym1Definition": "open and sincere communication, free of pretense or reserve",
    "synonym1ExampleSentence": "His frankness about the project’s flaws sparked a lively debate among the team.",
    "synonym2": "openness",
    "synonym2Definition": "a willingness to share thoughts or feelings without concealment",
    "synonym2ExampleSentence": "The openness of her apology softened the tension, inviting forgiveness.",
    "synonym3": "sincerity",
    "synonym3Definition": "genuine honesty in words or actions, heartfelt and true",
    "synonym3ExampleSentence": "The sincerity in his voice reassured her that his promise was no empty vow."
  },
  {
    "word": "capitulate",
    "definition": "to surrender or yield under pressure, often after resistance",
    "exampleSentence": "The rebels chose to capitulate when supplies ran dry, laying down arms under a crimson sky.",
    "synonym1": "surrender",
    "synonym1Definition": "to give up resistance or control, submitting to an opponent",
    "synonym1ExampleSentence": "He surrendered his claim to the land, weary of the endless legal battles.",
    "synonym2": "yield",
    "synonym2Definition": "to give way to force or persuasion, relinquishing a position",
    "synonym2ExampleSentence": "She yielded to their pleas, agreeing to stay despite her packed bags.",
    "synonym3": "submit",
    "synonym3Definition": "to accept or give in to authority or a stronger force",
    "synonym3ExampleSentence": "The team submitted to the coach’s plan, trusting his vision over their doubts."
  },
  {
    "word": "capricious",
    "definition": "impulsive and unpredictable",
    "exampleSentence": "The weather this spring has been capricious, shifting from sun to snow in hours.",
    "synonym1": "erratic",
    "synonym1Definition": "irregular or inconsistent in behavior or pattern",
    "synonym1ExampleSentence": "His erratic schedule made it hard to plan meetings.",
    "synonym2": "whimsical",
    "synonym2Definition": "playfully impulsive or fanciful",
    "synonym2ExampleSentence": "Her whimsical choice of bright pink shoes surprised everyone.",
    "synonym3": "fickle",
    "synonym3Definition": "changing frequently, especially in loyalties or affections",
    "synonym3ExampleSentence": "The crowd’s fickle applause faded as quickly as it began."
  },
  {
    "word": "castigate",
    "definition": "to reprimand or criticize severely, often with harsh words",
    "exampleSentence": "The editor castigated the writer for sloppy errors, her red pen slashing through pages.",
    "synonym1": "rebuke",
    "synonym1Definition": "to express sharp disapproval or censure, often formally",
    "synonym1ExampleSentence": "He rebuked his assistant for the oversight, his tone cutting through the office hum.",
    "synonym2": "chastise",
    "synonym2Definition": "to discipline or scold, aiming to correct through punishment",
    "synonym2ExampleSentence": "She chastised the dog for chewing her shoes, her voice firm but forgiving.",
    "synonym3": "berate",
    "synonym3Definition": "to scold angrily and at length, with intense disapproval",
    "synonym3ExampleSentence": "The coach berated the players for their lackluster effort, his shouts echoing across the field."
  },
  {
    "word": "catharsis",
    "definition": "the process of releasing strong emotions, often resulting in relief or renewal",
    "exampleSentence": "Writing the letter was a catharsis for her grief, each word lifting a weight from her chest.",
    "synonym1": "purification",
    "synonym1Definition": "the act of cleansing or purging, restoring purity or balance",
    "synonym1ExampleSentence": "The ritual felt like a purification, washing away the village’s collective fears.",
    "synonym2": "release",
    "synonym2Definition": "the freeing of pent-up feelings or tension, letting go",
    "synonym2ExampleSentence": "His scream into the canyon was a release, the echo carrying away months of frustration.",
    "synonym3": "purgation",
    "synonym3Definition": "a cleansing or emotional unloading, often therapeutic",
    "synonym3ExampleSentence": "The play’s tragic end offered purgation, leaving the audience lighter despite their tears."
  },
  {
    "word": "caustic",
    "definition": "severely critical or sarcastic, capable of burning through with sharpness",
    "exampleSentence": "Her caustic wit sliced through the room, leaving the pompous guest red-faced and silent.",
    "synonym1": "biting",
    "synonym1Definition": "harshly sharp or stinging, delivering a painful edge",
    "synonym1ExampleSentence": "His biting remark about her cooking halted the dinner chatter in an instant.",
    "synonym2": "acerbic",
    "synonym2Definition": "sour or bitter in tone, marked by cutting sarcasm",
    "synonym2ExampleSentence": "The reviewer’s acerbic critique of the film spared no one, from director to cast.",
    "synonym3": "vitriolic",
    "synonym3Definition": "filled with bitter hostility, like a corrosive acid",
    "synonym3ExampleSentence": "The vitriolic exchange between rivals shocked the crowd, its venom palpable."
  },
  {
    "word": "celerity",
    "definition": "swiftness or speed in action or movement, often with efficiency",
    "exampleSentence": "The courier moved with celerity through the bustling streets, delivering the urgent message on time.",
    "synonym1": "rapidity",
    "synonym1Definition": "the quality of being fast or quick, often strikingly so",
    "synonym1ExampleSentence": "The rapidity of her typing amazed her coworkers, fingers blurring over the keys.",
    "synonym2": "haste",
    "synonym2Definition": "quick action or urgency, sometimes with impatience",
    "synonym2ExampleSentence": "He packed in haste, tossing clothes into the suitcase as the taxi honked outside.",
    "synonym3": "alacrity",
    "synonym3Definition": "brisk and eager swiftness, infused with cheerful readiness",
    "synonym3ExampleSentence": "She responded with alacrity to the call, racing to aid her friend without a second thought."
  },
  {
    "word": "chagrin",
    "definition": "distress or embarrassment caused by disappointment or failure",
    "exampleSentence": "To his chagrin, the speech he’d rehearsed fell flat, met with polite claps and awkward silence.",
    "synonym1": "mortification",
    "synonym1Definition": "deep shame or humiliation, often painfully acute",
    "synonym1ExampleSentence": "Her mortification was evident when she tripped on stage, the spotlight merciless.",
    "synonym2": "discomfiture",
    "synonym2Definition": "a feeling of unease or confusion, typically from being thwarted",
    "synonym2ExampleSentence": "His discomfiture grew as the quiz revealed how little he’d prepared.",
    "synonym3": "vexation",
    "synonym3Definition": "irritation or annoyance, often mixed with frustration",
    "synonym3ExampleSentence": "The vexation of losing her keys again darkened her mood on an otherwise bright day."
  },
  {
    "word": "chicanery",
    "definition": "use of trickery to achieve a goal",
    "exampleSentence": "The chicanery in the election shocked the public.",
    "synonym1": "deception",
    "synonym1Definition": "act of misleading or hiding the truth",
    "synonym1ExampleSentence": "His deception fooled even his friends.",
    "synonym2": "subterfuge",
    "synonym2Definition": "a trick or plan to deceive",
    "synonym2ExampleSentence": "The subterfuge allowed her to slip away.",
    "synonym3": "guile",
    "synonym3Definition": "sly or cunning intelligence",
    "synonym3ExampleSentence": "Her guile outsmarted the competition."
  },
  {
    "word": "chimerical",
    "definition": "fantastically unreal or wildly imaginative, existing only as a dream",
    "exampleSentence": "His chimerical plan to build a castle in the clouds amused his friends, who admired its bold whimsy.",
    "synonym1": "illusory",
    "synonym1Definition": "based on illusion or deception, not truly real",
    "synonym1ExampleSentence": "The illusory promise of quick wealth lured many into the risky scheme.",
    "synonym2": "fantastic",
    "synonym2Definition": "extraordinarily imaginative or improbable, far from reality",
    "synonym2ExampleSentence": "The fantastic tale of flying ships captivated the children around the campfire.",
    "synonym3": "visionary",
    "synonym3Definition": "dreamily imaginative, often ahead of practical possibility",
    "synonym3ExampleSentence": "Her visionary designs for floating cities inspired awe, if not blueprints."
  },
  {
    "word": "circuitous",
    "definition": "longer than the most direct route, winding or roundabout in course",
    "exampleSentence": "The circuitous path through the hills took hours, but the scenic overlooks made it worthwhile.",
    "synonym1": "meandering",
    "synonym1Definition": "following a winding or twisting course, often leisurely",
    "synonym1ExampleSentence": "The meandering river carved gentle curves through the valley, a lazy ribbon of blue.",
    "synonym2": "indirect",
    "synonym2Definition": "not straightforward or immediate, taking a detour",
    "synonym2ExampleSentence": "His indirect answer dodged the question, leaving her to guess his true intent.",
    "synonym3": "devious",
    "synonym3Definition": "departing from the direct path, sometimes with cunning intent",
    "synonym3ExampleSentence": "The devious route through backroads avoided the tolls, though it tested their patience."
  },
  {
    "word": "clandestine",
    "definition": "kept secret or done surreptitiously, often for illicit reasons",
    "exampleSentence": "Their clandestine meetings in the old barn fueled rumors of a budding rebellion.",
    "synonym1": "covert",
    "synonym1Definition": "concealed or hidden, not openly acknowledged",
    "synonym1ExampleSentence": "The covert operation slipped past enemy lines under the cloak of night.",
    "synonym2": "furtive",
    "synonym2Definition": "attempting to avoid notice, often with a sense of guilt",
    "synonym2ExampleSentence": "His furtive glance at the letter hinted at secrets he wasn’t ready to share.",
    "synonym3": "surreptitious",
    "synonym3Definition": "done stealthily to avoid detection, typically sneaky",
    "synonym3ExampleSentence": "She took a surreptitious sip of the forbidden wine, hiding the glass behind her book."
  },
  {
    "word": "coalesce",
    "definition": "to come together and form a unified whole, merging into one",
    "exampleSentence": "The scattered ideas began to coalesce into a plan as the team brainstormed late into the night.",
    "synonym1": "unite",
    "synonym1Definition": "to join together for a common purpose or into a single entity",
    "synonym1ExampleSentence": "The villages united against the flood, their efforts stronger as one.",
    "synonym2": "merge",
    "synonym2Definition": "to blend or combine gradually, losing separate identities",
    "synonym2ExampleSentence": "The two streams merged into a mighty river, carving a new path through the land.",
    "synonym3": "fuse",
    "synonym3Definition": "to meld together tightly, often permanently or intensely",
    "synonym3ExampleSentence": "Their voices fused in harmony, creating a sound that lifted every heart in the hall."
  },
  {
    "word": "cogent",
    "definition": "clear, logical, and convincing",
    "exampleSentence": "Her cogent argument swayed even the most skeptical listeners.",
    "synonym1": "persuasive",
    "synonym1Definition": "able to convince or influence",
    "synonym1ExampleSentence": "His persuasive speech won over the undecided voters.",
    "synonym2": "compelling",
    "synonym2Definition": "powerfully evoking interest or admiration",
    "synonym2ExampleSentence": "The compelling story kept readers hooked until the end.",
    "synonym3": "lucid",
    "synonym3Definition": "clearly expressed and easy to understand",
    "synonym3ExampleSentence": "The lucid explanation clarified the complex topic."
  },
  {
    "word": "cogitate",
    "definition": "to think deeply or meditate carefully about something complex",
    "exampleSentence": "He sat by the window to cogitate on the offer, weighing its risks against its glittering promises.",
    "synonym1": "ponder",
    "synonym1Definition": "to reflect or consider with thoroughness and care, often quietly",
    "synonym1ExampleSentence": "She pondered the meaning of the poem, letting its words roll over her mind like waves.",
    "synonym2": "ruminate",
    "synonym2Definition": "to think over repeatedly, as if chewing on a thought",
    "synonym2ExampleSentence": "He ruminated on his past mistakes, hoping to find lessons in the shadows of regret.",
    "synonym3": "deliberate",
    "synonym3Definition": "to engage in careful and slow consideration before deciding",
    "synonym3ExampleSentence": "The jury deliberated for hours, sifting through evidence to reach a fair verdict."
  },
  {
    "word": "commensurate",
    "definition": "proportionate or corresponding in size, amount, or degree",
    "exampleSentence": "Her bonus was commensurate with her long hours, a fair reward for the sleepless nights.",
    "synonym1": "proportional",
    "synonym1Definition": "balanced or matching in relation to something else, evenly scaled",
    "synonym1ExampleSentence": "The punishment was proportional to the offense, neither too harsh nor too light.",
    "synonym2": "equivalent",
    "synonym2Definition": "equal in value, function, or significance, directly comparable",
    "synonym2ExampleSentence": "The effort she put in was equivalent to years of study, her results astounding.",
    "synonym3": "corresponding",
    "synonym3Definition": "matching or agreeing closely with something else in measure",
    "synonym3ExampleSentence": "His salary grew corresponding to his rising expertise, a steady climb upward."
  },
  {
    "word": "compendium",
    "definition": "a concise collection or summary of information, often comprehensive",
    "exampleSentence": "The traveler’s compendium of maps and tips fit snugly in her pocket, a lifeline on the road.",
    "synonym1": "digest",
    "synonym1Definition": "a condensed version of material, distilled for easier understanding",
    "synonym1ExampleSentence": "The digest of the novel captured its essence in just a few vivid pages.",
    "synonym2": "anthology",
    "synonym2Definition": "a collection of selected works, often literary or artistic",
    "synonym2ExampleSentence": "The anthology of poems spanned centuries, each verse a window to its time.",
    "synonym3": "summary",
    "synonym3Definition": "a brief statement of main points, capturing the core without detail",
    "synonym3ExampleSentence": "His summary of the meeting hit every key decision, sharp and to the point."
  },
  {
    "word": "complaisant",
    "definition": "willing to please others or agree, often overly accommodating",
    "exampleSentence": "The complaisant host refilled glasses and smiled, eager to keep the party humming along.",
    "synonym1": "obliging",
    "synonym1Definition": "ready to assist or fulfill wishes, helpfully agreeable",
    "synonym1ExampleSentence": "The obliging clerk stayed late to help her find the perfect gift for the occasion.",
    "synonym2": "accommodating",
    "synonym2Definition": "fitting in with others’ needs or plans, flexibly cooperative",
    "synonym2ExampleSentence": "He was accommodating with his schedule, shifting meetings to suit her arrival.",
    "synonym3": "amenable",
    "synonym3Definition": "open and responsive to suggestion, easily persuaded",
    "synonym3ExampleSentence": "She proved amenable to the new rules, nodding as the changes were explained."
  },
  {
    "word": "concomitant",
    "definition": "naturally accompanying or associated with something, occurring together",
    "exampleSentence": "The concomitant rise in noise came with the city’s growth, a hum she learned to tune out.",
    "synonym1": "accompanying",
    "synonym1Definition": "going along with or occurring at the same time as something else",
    "synonym1ExampleSentence": "The accompanying music swelled as the dancers took the stage, perfectly in sync.",
    "synonym2": "coexistent",
    "synonym2Definition": "existing at the same time or in the same place, side by side",
    "synonym2ExampleSentence": "The coexistent beauty and chaos of the market mesmerized every first-time visitor.",
    "synonym3": "attendant",
    "synonym3Definition": "occurring with or resulting from, closely linked",
    "synonym3ExampleSentence": "The attendant risks of the journey loomed large, yet she packed her bag with resolve."
  },
  {
    "word": "confound",
    "definition": "to cause surprise or confusion, often by contradicting expectations",
    "exampleSentence": "The magician’s trick confounded the crowd, their gasps filling the air as the rabbit vanished.",
    "synonym1": "bewilder",
    "synonym1Definition": "to perplex or disorient, leaving one lost or puzzled",
    "synonym1ExampleSentence": "The maze bewildered the explorers, its twists defying every map they’d drawn.",
    "synonym2": "perplex",
    "synonym2Definition": "to make uncertain or complicated, challenging understanding",
    "synonym2ExampleSentence": "The riddle perplexed her for days, its answer dancing just out of reach.",
    "synonym3": "baffle",
    "synonym3Definition": "to confuse completely, thwarting efforts to comprehend",
    "synonym3ExampleSentence": "The machine’s odd hum baffled the engineer, who’d never heard such a sound before."
  },
  {
    "word": "conjecture",
    "definition": "an opinion or conclusion formed on incomplete or uncertain evidence",
    "exampleSentence": "Her conjecture about the painting’s origin sparked a lively debate among the art lovers.",
    "synonym1": "speculation",
    "synonym1Definition": "the act of guessing or theorizing without firm proof",
    "synonym1ExampleSentence": "His speculation about the storm’s path kept the village on edge, waiting for rain.",
    "synonym2": "hypothesis",
    "synonym2Definition": "a proposed explanation, often based on limited data",
    "synonym2ExampleSentence": "The scientist’s hypothesis about the stars guided her telescope’s nightly sweep.",
    "synonym3": "surmise",
    "synonym3Definition": "a thought or inference based on scant or intuitive evidence",
    "synonym3ExampleSentence": "She surmised he’d left early, the empty chair a silent clue in the dim room."
  },
  {
    "word": "consternation",
    "definition": "a sudden feeling of anxiety or dismay, often mixed with confusion",
    "exampleSentence": "To her consternation, the train left without her, stranding her under the station’s flickering lights.",
    "synonym1": "dismay",
    "synonym1Definition": "a sudden loss of courage or confidence, tinged with distress",
    "synonym1ExampleSentence": "His dismay was palpable as the cake collapsed, a soggy ruin on the counter.",
    "synonym2": "alarm",
    "synonym2Definition": "a sharp fear or apprehension triggered by sudden danger",
    "synonym2ExampleSentence": "The alarm in her voice rose as smoke curled from the oven, urging everyone out.",
    "synonym3": "perturbation",
    "synonym3Definition": "a state of agitation or unease, disrupting calm",
    "synonym3ExampleSentence": "The perturbation on his face grew as the deadline loomed closer with no solution."
  },
  {
    "word": "contentious",
    "definition": "causing or likely to cause argument or disagreement, often heated",
    "exampleSentence": "The contentious vote split the council, voices rising as tempers flared in the old hall.",
    "synonym1": "controversial",
    "synonym1Definition": "giving rise to public dispute or differing opinions",
    "synonym1ExampleSentence": "The controversial film stirred debate, its bold scenes igniting both praise and scorn.",
    "synonym2": "disputatious",
    "synonym2Definition": "fond of or prone to argument, inherently quarrelsome",
    "synonym2ExampleSentence": "His disputatious nature turned every chat into a battle of wits, exhausting his friends.",
    "synonym3": "polemical",
    "synonym3Definition": "involving aggressive debate or attack on opposing views",
    "synonym3ExampleSentence": "The polemical essay challenged norms, its sharp words cutting through complacency."
  },
  {
    "word": "contrite",
    "definition": "feeling or expressing sincere remorse or guilt for one’s actions",
    "exampleSentence": "His contrite apology softened her heart, his eyes downcast as he spoke of his regret.",
    "synonym1": "repentant",
    "synonym1Definition": "showing deep sorrow and a desire to atone for wrongdoing",
    "synonym1ExampleSentence": "The repentant thief returned the stolen coin, his hands trembling with shame.",
    "synonym2": "penitent",
    "synonym2Definition": "feeling regret and seeking forgiveness, often humbly",
    "synonym2ExampleSentence": "She stood penitent before the judge, her quiet plea echoing in the courtroom.",
    "synonym3": "remorseful",
    "synonym3Definition": "filled with sorrow or guilt over past mistakes, genuinely sorry",
    "synonym3ExampleSentence": "He felt remorseful for the harsh words, wishing he could rewind the bitter moment."
  },
  {
    "word": "convivial",
    "definition": "friendly, lively, and enjoyable, often in a social or festive setting",
    "exampleSentence": "The convivial dinner buzzed with laughter, glasses clinking under the warm glow of candles.",
    "synonym1": "sociable",
    "synonym1Definition": "inclined to enjoy company and conversation, warmly outgoing",
    "synonym1ExampleSentence": "Her sociable nature drew strangers into chats, turning the café into a hub of chatter.",
    "synonym2": "jovial",
    "synonym2Definition": "cheerful and hearty, full of robust good humor",
    "synonym2ExampleSentence": "The jovial host roared with laughter, his stories keeping the party alive.",
    "synonym3": "genial",
    "synonym3Definition": "pleasantly kind and cheerful, radiating warmth",
    "synonym3ExampleSentence": "His genial smile welcomed the guests, making the cold night feel cozy and bright."
  },
  {
    "word": "corroborate",
    "definition": "to confirm or give support to a statement, theory, or finding",
    "exampleSentence": "The witness’s account helped corroborate her alibi, strengthening her case in the dim courtroom.",
    "synonym1": "verify",
    "synonym1Definition": "to prove the truth or accuracy of something through evidence",
    "synonym1ExampleSentence": "He verified the ticket’s authenticity, scanning it under the flickering station light.",
    "synonym2": "substantiate",
    "synonym2Definition": "to provide solid evidence or proof to establish as true",
    "synonym2ExampleSentence": "The photos substantiated his claim, showing the rare bird perched in the misty trees.",
    "synonym3": "confirm",
    "synonym3Definition": "to establish certainty or agreement with additional support",
    "synonym3ExampleSentence": "Her nod confirmed his suspicion, the unspoken truth hanging heavy between them."
  },
  {
    "word": "countenance",
    "definition": "to approve, support, or tolerate, often with a sense of permission",
    "exampleSentence": "She refused to countenance his reckless plan, her stern look quashing his wild enthusiasm.",
    "synonym1": "endorse",
    "synonym1Definition": "to declare public approval or support, often officially",
    "synonym1ExampleSentence": "The mayor endorsed the new park, praising its design at the ribbon-cutting event.",
    "synonym2": "sanction",
    "synonym2Definition": "to give official permission or approval, authorizing action",
    "synonym2ExampleSentence": "The council sanctioned the festival, ensuring funds for its colorful chaos.",
    "synonym3": "permit",
    "synonym3Definition": "to allow or consent to something happening, granting leave",
    "synonym3ExampleSentence": "He permitted the delay, understanding the storm’s unexpected wrath."
  },
  {
    "word": "craven",
    "definition": "contemptibly lacking in courage, abjectly cowardly",
    "exampleSentence": "His craven retreat from the fight left his companions stunned, staring at his fleeing shadow.",
    "synonym1": "timorous",
    "synonym1Definition": "showing nervousness or lack of confidence, easily frightened",
    "synonym1ExampleSentence": "The timorous mouse darted away at the faintest creak, tail trembling behind it.",
    "synonym2": "pusillanimous",
    "synonym2Definition": "lacking determination or bravery, weak in spirit",
    "synonym2ExampleSentence": "Her pusillanimous refusal to speak up cost them the chance to win the debate.",
    "synonym3": "faint-hearted",
    "synonym3Definition": "lacking boldness or resolve, shrinking from challenge",
    "synonym3ExampleSentence": "The faint-hearted sailor clung to the rail, dreading the swell of the open sea."
  },
  {
    "word": "credulous",
    "definition": "having a tendency to believe too readily, often naively trusting",
    "exampleSentence": "The credulous tourist fell for the fake relic, parting with cash for a shiny trinket.",
    "synonym1": "gullible",
    "synonym1Definition": "easily deceived or tricked due to a lack of skepticism",
    "synonym1ExampleSentence": "His gullible nature made him the perfect mark for the street vendor’s scam.",
    "synonym2": "naive",
    "synonym2Definition": "showing innocence or a lack of worldly experience, overly trusting",
    "synonym2ExampleSentence": "She was naive enough to think the deal was genuine, blinded by its rosy promises.",
    "synonym3": "ingenuous",
    "synonym3Definition": "openly sincere and unsuspecting, free of guile",
    "synonym3ExampleSentence": "His ingenuous faith in people charmed her, though it worried her too."
  },
  {
    "word": "culpable",
    "definition": "deserving blame or censure for being wrong or at fault",
    "exampleSentence": "The driver was culpable for the crash, his reckless speed etched into the skid marks.",
    "synonym1": "guilty",
    "synonym1Definition": "responsible for a wrongdoing, bearing the weight of fault",
    "synonym1ExampleSentence": "She felt guilty for forgetting the date, her apology spilling out in a rush.",
    "synonym2": "blameworthy",
    "synonym2Definition": "worthy of reproach or criticism for an error or offense",
    "synonym2ExampleSentence": "His blameworthy delay cost the team the match, a mistake they wouldn’t forget.",
    "synonym3": "responsible",
    "synonym3Definition": "answerable or accountable for an action or outcome",
    "synonym3ExampleSentence": "He was responsible for the mix-up, owning it with a sheepish nod."
  },
  {
    "word": "cursory",
    "definition": "hasty and superficial, done without attention to detail",
    "exampleSentence": "His cursory glance at the map sent them down the wrong trail, miles from their goal.",
    "synonym1": "perfunctory",
    "synonym1Definition": "carried out with minimal effort or care, mechanically routine",
    "synonym1ExampleSentence": "The perfunctory handshake ended the meeting, no warmth in its quick grip.",
    "synonym2": "superficial",
    "synonym2Definition": "concerned only with the obvious or surface, lacking depth",
    "synonym2ExampleSentence": "Her superficial review missed the report’s flaws, skimming over critical errors.",
    "synonym3": "hasty",
    "synonym3Definition": "done quickly and often carelessly, rushed through",
    "synonym3ExampleSentence": "The hasty sketch captured the scene’s shape but none of its soul."
  },
  {
    "word": "daunt",
    "definition": "to make someone feel intimidated or discouraged, lessening their resolve",
    "exampleSentence": "The sheer height of the cliff didn’t daunt her; she tied her rope with steady hands.",
    "synonym1": "intimidate",
    "synonym1Definition": "to frighten or overawe, causing hesitation or fear",
    "synonym1ExampleSentence": "The giant guard’s glare intimidated the crowd, silencing their restless murmurs.",
    "synonym2": "dismay",
    "synonym2Definition": "to cause a sudden loss of courage or confidence, unsettling",
    "synonym2ExampleSentence": "The news of the storm dismayed the sailors, their faces paling at the horizon.",
    "synonym3": "deter",
    "synonym3Definition": "to discourage or prevent through fear or doubt",
    "synonym3ExampleSentence": "The warning sign didn’t deter the explorer, who pressed on into the dark cave."
  },
  {
    "word": "dearth",
    "definition": "a scarcity or lack of something",
    "exampleSentence": "The dearth of volunteers slowed the project’s progress.",
    "synonym1": "scarcity",
    "synonym1Definition": "a shortage or insufficiency",
    "synonym1ExampleSentence": "The scarcity of water forced the village to ration.",
    "synonym2": "paucity",
    "synonym2Definition": "an insufficient quantity or number",
    "synonym2ExampleSentence": "A paucity of evidence weakened their case.",
    "synonym3": "deficiency",
    "synonym3Definition": "a lack or shortage of something needed",
    "synonym3ExampleSentence": "The deficiency in funding halted the research."
  },
  {
    "word": "debase",
    "definition": "to reduce in quality, value, or dignity, often degradingly",
    "exampleSentence": "He refused to debase his art with cheap tricks, holding firm to his vision despite the pressure.",
    "synonym1": "degrade",
    "synonym1Definition": "to lower in rank, status, or worth, often shamefully",
    "synonym1ExampleSentence": "The scandal degraded his reputation, once spotless, now a whisper in the halls.",
    "synonym2": "demean",
    "synonym2Definition": "to cause a loss of dignity or respect, cheapening oneself",
    "synonym2ExampleSentence": "She wouldn’t demean herself by begging, standing tall even in defeat.",
    "synonym3": "cheapen",
    "synonym3Definition": "to make less valuable or worthy, diminishing esteem",
    "synonym3ExampleSentence": "The gaudy ads cheapened the brand, turning elegance into a tawdry show."
  },
  {
    "word": "debilitate",
    "definition": "to make weak or feeble",
    "exampleSentence": "The illness seemed to debilitate his once-strong frame.",
    "synonym1": "enfeeble",
    "synonym1Definition": "to weaken or make frail",
    "synonym1ExampleSentence": "Age began to enfeeble his steady hands.",
    "synonym2": "sap",
    "synonym2Definition": "to drain of strength or energy",
    "synonym2ExampleSentence": "The long march sapped their remaining vigor.",
    "synonym3": "undermine",
    "synonym3Definition": "to weaken gradually or insidiously",
    "synonym3ExampleSentence": "Stress began to undermine her resilience."
  },
  {
    "word": "decorum",
    "definition": "behavior in keeping with good taste and propriety, polite dignity",
    "exampleSentence": "She maintained decorum at the gala, her graceful nod masking her dislike of the loud guest.",
    "synonym1": "propriety",
    "synonym1Definition": "conformity to established standards of behavior or manners",
    "synonym1ExampleSentence": "His propriety shone at the dinner, every gesture measured and polite.",
    "synonym2": "etiquette",
    "synonym2Definition": "the customary code of polite behavior in society",
    "synonym2ExampleSentence": "She followed etiquette to the letter, placing the napkin just so on her lap.",
    "synonym3": "civility",
    "synonym3Definition": "formal politeness and courtesy in actions or speech",
    "synonym3ExampleSentence": "His civility toward the rude clerk surprised her, a calm reply to a sharp tongue."
  },
  {
    "word": "deference",
    "definition": "humble submission and respect, often yielding to another’s wishes",
    "exampleSentence": "Out of deference to her elders, she held her tongue, letting their voices fill the room.",
    "synonym1": "respect",
    "synonym1Definition": "admiration or esteem shown through courteous regard",
    "synonym1ExampleSentence": "He showed respect by standing as the teacher entered, a quiet nod to her authority.",
    "synonym2": "obeisance",
    "synonym2Definition": "a gesture or attitude of deep respect or submission",
    "synonym2ExampleSentence": "The bow was an obeisance to the queen, a silent pledge in the crowded court.",
    "synonym3": "submissiveness",
    "synonym3Definition": "a willingness to yield or comply, often meekly",
    "synonym3ExampleSentence": "Her submissiveness to the rules frustrated her, a cage she longed to break."
  },
  {
    "word": "deleterious",
    "definition": "causing harm or damage in a subtle or unexpected way",
    "exampleSentence": "The deleterious effects of the chemical leak became apparent only after years of unnoticed contamination.",
    "synonym1": "harmful",
    "synonym1Definition": "capable of causing injury or adverse effects, often physically or emotionally",
    "synonym1ExampleSentence": "The harmful fumes from the factory forced residents to wear masks outdoors.",
    "synonym2": "detrimental",
    "synonym2Definition": "tending to cause loss or disadvantage, often gradually or indirectly",
    "synonym2ExampleSentence": "Skipping breakfast proved detrimental to her concentration during morning classes.",
    "synonym3": "noxious",
    "synonym3Definition": "poisonous or very unpleasant, posing a threat to health or well-being",
    "synonym3ExampleSentence": "The noxious odor from the swamp kept hikers at a safe distance."
  },
  {
    "word": "denigrate",
    "definition": "to criticize unfairly or belittle",
    "exampleSentence": "He tried to denigrate her work in front of the group.",
    "synonym1": "disparage",
    "synonym1Definition": "to regard as being of little worth",
    "synonym1ExampleSentence": "She didn’t hesitate to disparage his efforts.",
    "synonym2": "belittle",
    "synonym2Definition": "to make seem less impressive",
    "synonym2ExampleSentence": "His comments belittle her achievements.",
    "synonym3": "deride",
    "synonym3Definition": "to express contempt or ridicule",
    "synonym3ExampleSentence": "They deride his taste in music."
  },
  {
    "word": "disseminate",
    "definition": "to spread or distribute widely",
    "exampleSentence": "The organization worked to disseminate information about the upcoming event.",
    "synonym1": "circulate",
    "synonym1Definition": "to move or spread through a group or area",
    "synonym1ExampleSentence": "Rumors began to circulate about the new project.",
    "synonym2": "broadcast",
    "synonym2Definition": "to transmit or make widely known",
    "synonym2ExampleSentence": "The station will broadcast the debate to millions.",
    "synonym3": "disperse",
    "synonym3Definition": "to scatter or spread over a wide area",
    "synonym3ExampleSentence": "The wind helped disperse the seeds across the field."
  },
  {
    "word": "ebullient",
    "definition": "overflowing with enthusiasm or excitement",
    "exampleSentence": "Her ebullient greeting cheered up the weary travelers.",
    "synonym1": "exuberant",
    "synonym1Definition": "full of energy and enthusiasm",
    "synonym1ExampleSentence": "The exuberant puppy raced around the yard.",
    "synonym2": "effervescent",
    "synonym2Definition": "vivacious and cheerful",
    "synonym2ExampleSentence": "His effervescent wit kept the party lively.",
    "synonym3": "buoyant",
    "synonym3Definition": "cheerful and optimistic",
    "synonym3ExampleSentence": "Her buoyant spirit lifted everyone’s mood."
  },
  {
    "word": "effervescent",
    "definition": "vivacious and enthusiastic",
    "exampleSentence": "Her effervescent personality lit up the dull meeting.",
    "synonym1": "bubbly",
    "synonym1Definition": "full of cheerful energy",
    "synonym1ExampleSentence": "The bubbly host greeted everyone with a grin.",
    "synonym2": "vivacious",
    "synonym2Definition": "attractively lively and animated",
    "synonym2ExampleSentence": "Her vivacious laugh echoed through the room.",
    "synonym3": "exuberant",
    "synonym3Definition": "full of unrestrained enthusiasm",
    "synonym3ExampleSentence": "The exuberant crowd cheered wildly."
  },
  {
    "word": "enervate",
    "definition": "to deprive of strength, energy, or vigor, leaving one feeling drained",
    "exampleSentence": "The oppressive heat seemed to enervate the workers, slowing their pace to a crawl by midday.",
    "synonym1": "weaken",
    "synonym1Definition": "to reduce in physical or mental power, often through exhaustion or strain",
    "synonym1ExampleSentence": "The long illness began to weaken his once-robust frame, worrying his family.",
    "synonym2": "exhaust",
    "synonym2Definition": "to use up resources or energy completely, resulting in fatigue",
    "synonym2ExampleSentence": "The marathon’s final miles exhausted her reserves, but she pushed through to the finish.",
    "synonym3": "debilitate",
    "synonym3Definition": "to make feeble or infirm, impairing strength over time",
    "synonym3ExampleSentence": "The chronic stress started to debilitate his ability to focus on even simple tasks."
  },
  {
    "word": "ephemeral",
    "definition": "lasting for a very short time",
    "exampleSentence": "The beauty of the sunset was ephemeral, fading as night approached.",
    "synonym1": "transient",
    "synonym1Definition": "lasting only for a short time; impermanent",
    "synonym1ExampleSentence": "The transient joy of the festival ended with the dawn.",
    "synonym2": "fleeting",
    "synonym2Definition": "passing quickly; lasting only a brief time",
    "synonym2ExampleSentence": "A fleeting smile crossed her face before she turned away.",
    "synonym3": "momentary",
    "synonym3Definition": "lasting for a very short time; brief",
    "synonym3ExampleSentence": "The momentary pause in the music heightened the tension."
  },
  {
    "word": "epiphany",
    "definition": "a sudden realization or insight",
    "exampleSentence": "While gazing at the stars, she had an epiphany about her place in the universe.",
    "synonym1": "revelation",
    "synonym1Definition": "a surprising or enlightening disclosure",
    "synonym1ExampleSentence": "The letter contained a revelation that changed how he viewed his past.",
    "synonym2": "breakthrough",
    "synonym2Definition": "a sudden advance or discovery",
    "synonym2ExampleSentence": "The scientist’s breakthrough came after years of quiet experimentation.",
    "synonym3": "illumination",
    "synonym3Definition": "a clear understanding or enlightenment",
    "synonym3ExampleSentence": "Reading the ancient text brought her a moment of illumination."
  },
  {
    "word": "equivocal",
    "definition": "open to more than one interpretation; ambiguous",
    "exampleSentence": "His equivocal response left everyone unsure of his stance.",
    "synonym1": "ambiguous",
    "synonym1Definition": "having more than one possible meaning",
    "synonym1ExampleSentence": "The ambiguous message confused the entire team.",
    "synonym2": "vague",
    "synonym2Definition": "unclear or imprecise in meaning",
    "synonym2ExampleSentence": "Her vague directions led us in circles.",
    "synonym3": "cryptic",
    "synonym3Definition": "mysterious or obscure in meaning",
    "synonym3ExampleSentence": "The cryptic note offered no clear guidance."
  },
  {
    "word": "esoteric",
    "definition": "intended for or understood by only a small group",
    "exampleSentence": "The lecture delved into esoteric topics that left most of the audience puzzled.",
    "synonym1": "arcane",
    "synonym1Definition": "mysterious or secret, known only to a few",
    "synonym1ExampleSentence": "The arcane rituals of the society were hidden from outsiders.",
    "synonym2": "abstruse",
    "synonym2Definition": "difficult to understand or comprehend",
    "synonym2ExampleSentence": "The professor’s abstruse explanation lost half the class.",
    "synonym3": "obscure",
    "synonym3Definition": "not well-known or hard to understand",
    "synonym3ExampleSentence": "The obscure reference in the book went unnoticed by most readers."
  },
  {
    "word": "fastidious",
    "definition": "very attentive to detail and accuracy",
    "exampleSentence": "Her fastidious nature ensured every task was completed perfectly.",
    "synonym1": "meticulous",
    "synonym1Definition": "showing great attention to detail",
    "synonym1ExampleSentence": "The meticulous artist spent hours on each brushstroke.",
    "synonym2": "scrupulous",
    "synonym2Definition": "very careful about doing something correctly",
    "synonym2ExampleSentence": "He was scrupulous in documenting every expense.",
    "synonym3": "painstaking",
    "synonym3Definition": "done with great care and effort",
    "synonym3ExampleSentence": "The painstaking restoration brought the statue back to life."
  },
  {
    "word": "felicitous",
    "definition": "well-suited or appropriate",
    "exampleSentence": "His felicitous choice of words calmed the tense room.",
    "synonym1": "apt",
    "synonym1Definition": "suitably appropriate or fitting",
    "synonym1ExampleSentence": "Her apt remark eased the awkward silence.",
    "synonym2": "fitting",
    "synonym2Definition": "appropriate to the situation",
    "synonym2ExampleSentence": "The fitting tribute honored his legacy.",
    "synonym3": "opportune",
    "synonym3Definition": "well-timed or advantageous",
    "synonym3ExampleSentence": "The opportune moment sealed the deal."
  },
  {
    "word": "florid",
    "definition": "excessively intricate or elaborate",
    "exampleSentence": "The florid design of the gown drew every eye.",
    "synonym1": "ornate",
    "synonym1Definition": "richly or elaborately decorated",
    "synonym1ExampleSentence": "The ornate frame enhanced the painting’s beauty.",
    "synonym2": "baroque",
    "synonym2Definition": "highly detailed and extravagant",
    "synonym2ExampleSentence": "The baroque architecture awed visitors.",
    "synonym3": "rococo",
    "synonym3Definition": "elaborately ornamental",
    "synonym3ExampleSentence": "The rococo style filled the room with flair."
  },
  {
    "word": "fractious",
    "definition": "irritable and quarrelsome, often difficult to control or manage",
    "exampleSentence": "The fractious toddler threw a tantrum in the store, testing her mother’s patience to the limit.",
    "synonym1": "irascible",
    "synonym1Definition": "easily provoked to anger or impatience, marked by a fiery temper",
    "synonym1ExampleSentence": "The irascible old man snapped at anyone who dared disturb his quiet afternoon.",
    "synonym2": "peevish",
    "synonym2Definition": "showing annoyance or irritation, often over minor issues",
    "synonym2ExampleSentence": "Her peevish complaints about the meal’s seasoning grated on the chef’s nerves.",
    "synonym3": "testy",
    "synonym3Definition": "quick to become agitated or annoyed, displaying a sharp temper",
    "synonym3ExampleSentence": "The testy customer barked at the cashier over a small delay in service."
  },
  {
    "word": "furtive",
    "definition": "attempting to avoid notice, often due to guilt",
    "exampleSentence": "She cast a furtive glance at the clock during the meeting.",
    "synonym1": "surreptitious",
    "synonym1Definition": "kept secret, especially because it’s improper",
    "synonym1ExampleSentence": "He made a surreptitious move to grab the last cookie.",
    "synonym2": "stealthy",
    "synonym2Definition": "done in a cautious, secretive manner",
    "synonym2ExampleSentence": "The stealthy cat crept toward the unsuspecting bird.",
    "synonym3": "clandestine",
    "synonym3Definition": "done secretly or kept hidden",
    "synonym3ExampleSentence": "Their clandestine meeting took place under the stars."
  },
  {
    "word": "garrulous",
    "definition": "excessively talkative, especially on trivial matters",
    "exampleSentence": "The garrulous neighbor shared every detail of her day.",
    "synonym1": "loquacious",
    "synonym1Definition": "tending to talk a great deal",
    "synonym1ExampleSentence": "His loquacious nature dominated the conversation.",
    "synonym2": "verbose",
    "synonym2Definition": "using more words than necessary",
    "synonym2ExampleSentence": "The verbose report could have been half as long.",
    "synonym3": "chatty",
    "synonym3Definition": "fond of casual conversation",
    "synonym3ExampleSentence": "The chatty barista entertained the regulars."
  },
  {
    "word": "gossamer",
    "definition": "something very light, delicate, or insubstantial, often resembling fine silk",
    "exampleSentence": "The gossamer wings of the dragonfly shimmered in the sunlight, fragile yet mesmerizing.",
    "synonym1": "ethereal",
    "synonym1Definition": "extremely delicate and light, seeming too perfect for this world",
    "synonym1ExampleSentence": "The ethereal mist floated over the lake, giving it an otherworldly glow.",
    "synonym2": "diaphanous",
    "synonym2Definition": "so thin and sheer as to be almost transparent, often beautifully delicate",
    "synonym2ExampleSentence": "She wore a diaphanous gown that flowed like liquid as she moved across the room.",
    "synonym3": "filmy",
    "synonym3Definition": "thin and translucent, resembling a delicate layer or veil",
    "synonym3ExampleSentence": "The filmy curtains allowed a soft, diffused light to brighten the cozy space."
  },
  {
    "word": "grandiloquent",
    "definition": "pompous or extravagant in language",
    "exampleSentence": "His grandiloquent speech dazzled but confused the crowd.",
    "synonym1": "bombastic",
    "synonym1Definition": "high-sounding but with little meaning",
    "synonym1ExampleSentence": "The bombastic rant impressed no one.",
    "synonym2": "pretentious",
    "synonym2Definition": "attempting to impress with exaggerated importance",
    "synonym2ExampleSentence": "Her pretentious tone annoyed her peers.",
    "synonym3": "flowery",
    "synonym3Definition": "full of elaborate expressions",
    "synonym3ExampleSentence": "The flowery prose slowed the story."
  },
  {
    "word": "gregarious",
    "definition": "fond of company; sociable",
    "exampleSentence": "Her gregarious nature made her the life of every gathering.",
    "synonym1": "convivial",
    "synonym1Definition": "friendly, lively, and enjoyable",
    "synonym1ExampleSentence": "The convivial atmosphere at the party lifted everyone’s spirits.",
    "synonym2": "sociable",
    "synonym2Definition": "willing to talk and engage with others",
    "synonym2ExampleSentence": "He’s sociable enough to strike up a chat with strangers.",
    "synonym3": "extroverted",
    "synonym3Definition": "outgoing and socially confident",
    "synonym3ExampleSentence": "The extroverted host welcomed guests with open arms."
  },
  {
    "word": "hackneyed",
    "definition": "lacking originality due to overuse",
    "exampleSentence": "The speech relied on hackneyed phrases that bored the audience.",
    "synonym1": "trite",
    "synonym1Definition": "overused and lacking freshness",
    "synonym1ExampleSentence": "Her trite compliments felt rehearsed and insincere.",
    "synonym2": "banal",
    "synonym2Definition": "so common as to be uninteresting",
    "synonym2ExampleSentence": "The banal plot of the movie disappointed critics.",
    "synonym3": "clichéd",
    "synonym3Definition": "stereotyped or overly familiar",
    "synonym3ExampleSentence": "The clichéd ending ruined an otherwise decent story."
  },
  {
    "word": "hapless",
    "definition": "unfortunate or unlucky",
    "exampleSentence": "The hapless traveler lost his way in the storm.",
    "synonym1": "unfortunate",
    "synonym1Definition": "marked by bad luck",
    "synonym1ExampleSentence": "The unfortunate delay cost them dearly.",
    "synonym2": "luckless",
    "synonym2Definition": "having no good fortune",
    "synonym2ExampleSentence": "The luckless team faced yet another loss.",
    "synonym3": "ill-fated",
    "synonym3Definition": "destined for misfortune",
    "synonym3ExampleSentence": "The ill-fated voyage ended in tragedy."
  },
  {
    "word": "harangue",
    "definition": "a lengthy and aggressive speech",
    "exampleSentence": "The coach delivered a harangue to rally the tired team.",
    "synonym1": "tirade",
    "synonym1Definition": "a long, angry speech of criticism",
    "synonym1ExampleSentence": "Her tirade against the decision echoed loudly.",
    "synonym2": "rant",
    "synonym2Definition": "a loud, impassioned complaint",
    "synonym2ExampleSentence": "His rant about the rules annoyed everyone.",
    "synonym3": "diatribe",
    "synonym3Definition": "a forceful verbal attack",
    "synonym3ExampleSentence": "The diatribe against the policy stunned the crowd."
  },
  {
    "word": "hector",
    "definition": "to harass or intimidate with aggressive or domineering behavior",
    "exampleSentence": "He would hector his siblings into chores, his loud voice a whip cracking through the house.",
    "synonym1": "bully",
    "synonym1Definition": "to use strength or power to frighten or coerce, often cruelly",
    "synonym1ExampleSentence": "She bullied her way to the front, her glare parting the crowd like a blade through silk.",
    "synonym2": "badger",
    "synonym2Definition": "to pester or annoy persistently, nagging with relentless pressure",
    "synonym2ExampleSentence": "He badgered her for answers, his questions buzzing like flies she couldn’t swat away.",
    "synonym3": "browbeat",
    "synonym3Definition": "to intimidate with stern or overbearing manner, overpowering through force",
    "synonym3ExampleSentence": "The boss browbeat the team into silence, his steely gaze quelling their timid protests."
  },
  {
    "word": "hedonist",
    "definition": "a person who seeks pleasure as the highest good, often indulging excessively",
    "exampleSentence": "The hedonist threw lavish parties, his nights a whirl of wine and revelry under glittering chandeliers.",
    "synonym1": "sybarite",
    "synonym1Definition": "a lover of luxury and sensual delights, devoted to self-indulgence",
    "synonym1ExampleSentence": "The sybarite lounged on silk cushions, savoring each bite of the rare fruit platter.",
    "synonym2": "epicurean",
    "synonym2Definition": "one who pursues refined pleasures, especially in food and drink",
    "synonym2ExampleSentence": "Her epicurean tastes led her to the vineyard, sipping vintages with a connoisseur’s delight.",
    "synonym3": "libertine",
    "synonym3Definition": "a person unrestrained by morality, chasing pleasure without bounds",
    "synonym3ExampleSentence": "The libertine roamed the city, his laughter spilling from taverns into the moonlit streets."
  },
  {
    "word": "heresy",
    "definition": "a belief or opinion contrary to orthodox doctrine, often defiantly held",
    "exampleSentence": "His heresy against the council’s rules sparked outrage, his words a torch in the dry tinder of tradition.",
    "synonym1": "blasphemy",
    "synonym1Definition": "irreverent speech or action against sacred beliefs, boldly profane",
    "synonym1ExampleSentence": "The blasphemy of his jest silenced the room, a sacrilege too sharp for the devout ears.",
    "synonym2": "heterodoxy",
    "synonym2Definition": "deviation from accepted or official beliefs, unorthodox in thought",
    "synonym2ExampleSentence": "Her heterodoxy challenged the scholars, a fresh wind against their dusty tomes.",
    "synonym3": "apostasy",
    "synonym3Definition": "abandonment or renunciation of a religious or political belief",
    "synonym3ExampleSentence": "His apostasy from the faith stunned his kin, a fracture splitting their shared prayers."
  },
  {
    "word": "hiatus",
    "definition": "a pause or break in continuity, often in a sequence or activity",
    "exampleSentence": "After months of relentless work, she welcomed the hiatus as a chance to recharge and reflect.",
    "synonym1": "intermission",
    "synonym1Definition": "a temporary suspension or break, especially in a performance or event",
    "synonym1ExampleSentence": "The play’s intermission gave the audience time to stretch and discuss the twisty plot.",
    "synonym2": "lull",
    "synonym2Definition": "a period of calm or reduced activity, often unexpectedly brief",
    "synonym2ExampleSentence": "The lull in the storm allowed them to repair the roof before the next downpour hit.",
    "synonym3": "respite",
    "synonym3Definition": "a short period of rest or relief from something difficult or demanding",
    "synonym3ExampleSentence": "The cool shade offered a respite from the scorching sun during their long hike."
  },
  {
    "word": "histrionic",
    "definition": "overly theatrical or dramatic in behavior, often exaggeratedly emotional",
    "exampleSentence": "Her histrionic outburst filled the stage, tears and gestures too grand for the small scene.",
    "synonym1": "melodramatic",
    "synonym1Definition": "excessively sensational or emotional, larger than life",
    "synonym1ExampleSentence": "His melodramatic plea for help drew eyes, a sob echoing beyond the room’s walls.",
    "synonym2": "theatrical",
    "synonym2Definition": "relating to acting or overly showy, designed for effect",
    "synonym2ExampleSentence": "The theatrical flourish of her bow dazzled them, a curtain call in every line.",
    "synonym3": "overwrought",
    "synonym3Definition": "excessively agitated or elaborated, strained beyond reason",
    "synonym3ExampleSentence": "Her overwrought reaction to the spill shook the table, a tempest over a drop."
  },
  {
    "word": "hubris",
    "definition": "excessive pride or self-confidence, often leading to downfall",
    "exampleSentence": "His hubris blinded him to the risks, a king strutting toward the cliff’s unseen edge.",
    "synonym1": "arrogance",
    "synonym1Definition": "an overbearing sense of superiority, haughtily dismissive",
    "synonym1ExampleSentence": "Her arrogance turned allies to foes, her crown a weight none would lift.",
    "synonym2": "conceit",
    "synonym2Definition": "exaggerated self-opinion, vainly proud",
    "synonym2ExampleSentence": "His conceit painted him as flawless, a mirror cracked by others’ quiet scorn.",
    "synonym3": "haughtiness",
    "synonym3Definition": "disdainful pride, aloof and lofty in demeanor",
    "synonym3ExampleSentence": "The haughtiness in her stride iced the room, a chill no smile could thaw."
  },
  {
    "word": "iconoclast",
    "definition": "a person who attacks cherished beliefs",
    "exampleSentence": "The iconoclast challenged the town’s oldest traditions.",
    "synonym1": "nonconformist",
    "synonym1Definition": "one who rejects conventional behavior",
    "synonym1ExampleSentence": "The nonconformist artist defied every trend.",
    "synonym2": "rebel",
    "synonym2Definition": "a person who resists authority or norms",
    "synonym2ExampleSentence": "The rebel refused to follow the outdated rules.",
    "synonym3": "maverick",
    "synonym3Definition": "an independent-minded individual",
    "synonym3ExampleSentence": "The maverick politician shook up the debate."
  },
  {
    "word": "iconoclastic",
    "definition": "attacking or rejecting cherished beliefs or traditions, boldly unconventional",
    "exampleSentence": "Her iconoclastic art shattered norms, its jagged lines a rebellion on the gallery walls.",
    "synonym1": "unorthodox",
    "synonym1Definition": "contrary to what is usual or accepted, defiantly different",
    "synonym1ExampleSentence": "His unorthodox methods raised brows, a path carved where none dared tread.",
    "synonym2": "heretical",
    "synonym2Definition": "opposing established doctrine, provocatively dissentient",
    "synonym2ExampleSentence": "The heretical sermon stirred the pews, a spark against the church’s old wood.",
    "synonym3": "subversive",
    "synonym3Definition": "seeking to undermine or overthrow, quietly disruptive",
    "synonym3ExampleSentence": "Her subversive wit chipped at their rules, a laugh laced with quiet revolt."
  },
  {
    "word": "ignominious",
    "definition": "deserving or causing public disgrace or shame, humiliatingly dishonorable",
    "exampleSentence": "The ignominious defeat left the team silent, their heads low under the crowd’s fading jeers.",
    "synonym1": "disgraceful",
    "synonym1Definition": "bringing shame or loss of respect, unworthy of honor",
    "synonym1ExampleSentence": "His disgraceful outburst stained the event, a blot on the evening’s shine.",
    "synonym2": "humiliating",
    "synonym2Definition": "causing embarrassment or loss of dignity, painfully humbling",
    "synonym2ExampleSentence": "The humiliating stumble on stage burned her cheeks, a fall in the spotlight’s glare.",
    "synonym3": "shameful",
    "synonym3Definition": "worthy of disgrace or regret, ignobly regrettable",
    "synonym3ExampleSentence": "The shameful retreat echoed in their steps, a shadow over their proud banners."
  },
  {
    "word": "ignominy",
    "definition": "public shame or disgrace",
    "exampleSentence": "The scandal brought ignominy to the once-proud family.",
    "synonym1": "disgrace",
    "synonym1Definition": "loss of respect or honor",
    "synonym1ExampleSentence": "His actions led to the disgrace of his name.",
    "synonym2": "humiliation",
    "synonym2Definition": "the state of being embarrassed or shamed",
    "synonym2ExampleSentence": "The humiliation stung more than the loss.",
    "synonym3": "opprobrium",
    "synonym3Definition": "harsh criticism or public disgrace",
    "synonym3ExampleSentence": "The opprobrium followed her for years."
  },
  {
    "word": "immutable",
    "definition": "unchanging over time or unable to be altered, fixed eternally",
    "exampleSentence": "The immutable stars guided their way, a constant map in the shifting sands below.",
    "synonym1": "unchangeable",
    "synonym1Definition": "not capable of being modified or shifted, steadfastly set",
    "synonym1ExampleSentence": "Her unchangeable resolve held firm, a rock against the tide of pleas.",
    "synonym2": "permanent",
    "synonym2Definition": "lasting indefinitely without alteration, enduringly stable",
    "synonym2ExampleSentence": "The permanent mark of ink stayed bold, a vow etched into her skin.",
    "synonym3": "fixed",
    "synonym3Definition": "securely placed or established, resistant to change",
    "synonym3ExampleSentence": "His fixed gaze locked on the horizon, a line no storm could blur."
  },
  {
    "word": "impassive",
    "definition": "not showing or feeling emotion, calmly unreactive",
    "exampleSentence": "Her impassive face gave no hint of the turmoil within, a mask carved from still stone.",
    "synonym1": "stoic",
    "synonym1Definition": "enduring pain or hardship without complaint, resolutely calm",
    "synonym1ExampleSentence": "His stoic silence met the news, a wall of calm over a breaking heart.",
    "synonym2": "unemotional",
    "synonym2Definition": "lacking visible feeling or expression, coolly detached",
    "synonym2ExampleSentence": "The unemotional reply chilled her, its flat tone a void where warmth once lived.",
    "synonym3": "phlegmatic",
    "synonym3Definition": "having a calm or sluggish temperament, slow to react",
    "synonym3ExampleSentence": "His phlegmatic shrug brushed off the chaos, a ripple lost in his steady sea."
  },
  {
    "word": "impeccable",
    "definition": "flawless or perfect, free from fault or error",
    "exampleSentence": "Her impeccable manners charmed the guests, each gesture a note in a symphony of grace.",
    "synonym1": "faultless",
    "synonym1Definition": "without defect or blemish, irreproachably correct",
    "synonym1ExampleSentence": "The faultless design stood pristine, a model no critic could pierce.",
    "synonym2": "flawless",
    "synonym2Definition": "perfectly smooth or complete, lacking any imperfection",
    "synonym2ExampleSentence": "Her flawless performance stole the night, a dance without a single misstep.",
    "synonym3": "pristine",
    "synonym3Definition": "untouched or unspoiled, in a pure original state",
    "synonym3ExampleSentence": "The pristine snow blanketed the hill, a canvas no boot had yet marred."
  },
  {
    "word": "impecunious",
    "definition": "having little or no money, often struggling financially",
    "exampleSentence": "The impecunious artist bartered her paintings for food, determined to pursue her craft despite hardship.",
    "synonym1": "destitute",
    "synonym1Definition": "utterly lacking resources or means of subsistence, in extreme poverty",
    "synonym1ExampleSentence": "The destitute family relied on charity to survive the harsh winter months.",
    "synonym2": "indigent",
    "synonym2Definition": "poor and needy, often lacking basic necessities due to financial want",
    "synonym2ExampleSentence": "The indigent traveler carried all his possessions in a tattered sack slung over his shoulder.",
    "synonym3": "penurious",
    "synonym3Definition": "extremely poor or miserly, marked by a severe lack of funds",
    "synonym3ExampleSentence": "Living a penurious existence, she saved every scrap to make ends meet."
  },
  {
    "word": "imperious",
    "definition": "arrogantly domineering or commanding, assuming authority",
    "exampleSentence": "Her imperious tone halted the room, a queen’s voice ringing over the murmurs.",
    "synonym1": "overbearing",
    "synonym1Definition": "domineering in a haughty or oppressive way, forcefully controlling",
    "synonym1ExampleSentence": "His overbearing demands crushed dissent, a weight none dared defy.",
    "synonym2": "authoritative",
    "synonym2Definition": "exercising power with confident command, firmly decisive",
    "synonym2ExampleSentence": "The authoritative nod settled the plan, her will a gavel on their chatter.",
    "synonym3": "domineering",
    "synonym3Definition": "asserting control aggressively, ruling with insistence",
    "synonym3ExampleSentence": "Her domineering glare bent their choices, a storm bending fragile reeds."
  },
  {
    "word": "impertinent",
    "definition": "rudely bold or irrelevant, lacking proper respect",
    "exampleSentence": "His impertinent question cut through the lecture, a barb no one expected from the back row.",
    "synonym1": "impudent",
    "synonym1Definition": "shamelessly disrespectful or insolent, brashly forward",
    "synonym1ExampleSentence": "The impudent child stuck out her tongue, a spark of defiance in her grin.",
    "synonym2": "insolent",
    "synonym2Definition": "showing contemptuous rudeness, arrogantly offensive",
    "synonym2ExampleSentence": "His insolent smirk mocked the rule, a challenge hung in the air like smoke.",
    "synonym3": "irreverent",
    "synonym3Definition": "lacking due respect or seriousness, playfully bold",
    "synonym3ExampleSentence": "Her irreverent jest at the shrine raised brows, a laugh too loud for sacred stone."
  },
  {
    "word": "impervious",
    "definition": "not allowing something to pass through; unaffected",
    "exampleSentence": "He seemed impervious to the criticism hurled his way.",
    "synonym1": "immune",
    "synonym1Definition": "resistant or not affected by something",
    "synonym1ExampleSentence": "She’s immune to the charm of flattery.",
    "synonym2": "resistant",
    "synonym2Definition": "able to withstand or repel",
    "synonym2ExampleSentence": "The fabric is resistant to stains and spills.",
    "synonym3": "invulnerable",
    "synonym3Definition": "incapable of being harmed or influenced",
    "synonym3ExampleSentence": "His confidence made him seem invulnerable to doubt."
  },
  {
    "word": "impetuous",
    "definition": "acting quickly and rashly without thought, driven by impulse",
    "exampleSentence": "His impetuous leap into the fray saved her, a blur of courage over the cliff’s edge.",
    "synonym1": "reckless",
    "synonym1Definition": "heedless of danger or consequences, wildly careless",
    "synonym1ExampleSentence": "The reckless driver sped through fog, tires screaming on the wet curve.",
    "synonym2": "hasty",
    "synonym2Definition": "done with excessive speed or urgency, often sloppily",
    "synonym2ExampleSentence": "Her hasty sketch caught the bird’s shape, a smudge of haste on fleeting wings.",
    "synonym3": "precipitate",
    "synonym3Definition": "acting suddenly and prematurely, rushing headlong",
    "synonym3ExampleSentence": "His precipitate choice sparked chaos, a match struck too soon in the dark."
  },
  {
    "word": "impugn",
    "definition": "to challenge or attack as false or questionable, casting doubt",
    "exampleSentence": "She dared to impugn his honor, her words a spear aimed at the heart of his pride.",
    "synonym1": "dispute",
    "synonym1Definition": "to argue against or question the validity of",
    "synonym1ExampleSentence": "He disputed the claim with facts, each point a brick in his wall of truth.",
    "synonym2": "contradict",
    "synonym2Definition": "to assert the opposite, denying with opposition",
    "synonym2ExampleSentence": "Her evidence contradicted his tale, a light piercing the weave of his story.",
    "synonym3": "denounce",
    "synonym3Definition": "to publicly condemn or criticize, boldly rejecting",
    "synonym3ExampleSentence": "They denounced the law as unjust, their voices a chorus under the capitol’s dome."
  },
  {
    "word": "inadvertent",
    "definition": "happening unintentionally or without deliberate care",
    "exampleSentence": "Her inadvertent slip of the secret hushed the room, a whisper loosed by a careless tongue.",
    "synonym1": "unintentional",
    "synonym1Definition": "not done on purpose, occurring by accident",
    "synonym1ExampleSentence": "His unintentional nudge sent the vase crashing, a gasp chasing the shards.",
    "synonym2": "accidental",
    "synonym2Definition": "occurring unexpectedly or without design",
    "synonym2ExampleSentence": "The accidental meeting sparked a friendship, two paths crossed in the rain.",
    "synonym3": "unwitting",
    "synonym3Definition": "done without awareness or knowledge, innocently blind",
    "synonym3ExampleSentence": "Her unwitting remark stung him, a barb she never meant to throw."
  },
  {
    "word": "inchoate",
    "definition": "just begun and not fully formed, rudimentary or incomplete",
    "exampleSentence": "His inchoate plan flickered in his mind, a sketch of dreams on the edge of waking.",
    "synonym1": "nascent",
    "synonym1Definition": "beginning to emerge or develop, newly born",
    "synonym1ExampleSentence": "The nascent idea glowed faintly, a spark waiting for wind to fan its flame.",
    "synonym2": "rudimentary",
    "synonym2Definition": "basic or undeveloped, at an elementary stage",
    "synonym2ExampleSentence": "Her rudimentary sketch held promise, lines rough but alive with intent.",
    "synonym3": "embryonic",
    "synonym3Definition": "in an early, formative stage, still growing",
    "synonym3ExampleSentence": "The embryonic project pulsed with potential, its shape a shadow yet to solidify."
  },
  {
    "word": "incipient",
    "definition": "in an initial stage of development, just starting to emerge",
    "exampleSentence": "The incipient rebellion simmered in whispers, a murmur beneath the city’s hum.",
    "synonym1": "beginning",
    "synonym1Definition": "marking the start or onset, freshly underway",
    "synonym1ExampleSentence": "The beginning storm darkened the sky, its first drops a hint of the flood.",
    "synonym2": "nascent",
    "synonym2Definition": "coming into being or showing early signs, newly budding",
    "synonym2ExampleSentence": "His nascent skill with the brush grew daily, each stroke bolder than the last.",
    "synonym3": "emerging",
    "synonym3Definition": "starting to appear or become noticeable, rising up",
    "synonym3ExampleSentence": "The emerging trend caught their eyes, a ripple spreading through the quiet crowd."
  },
  {
    "word": "incongruous",
    "definition": "not in harmony or keeping with surroundings, oddly out of place",
    "exampleSentence": "The incongruous sight of a clown at the funeral drew stares, his red nose a jolt in the gray.",
    "synonym1": "discordant",
    "synonym1Definition": "lacking agreement or harmony, clashing sharply",
    "synonym1ExampleSentence": "The discordant notes jarred the song, a stumble in its sweet flow.",
    "synonym2": "inappropriate",
    "synonym2Definition": "not suitable or proper for the context, ill-fitting",
    "synonym2ExampleSentence": "His inappropriate laugh broke the silence, a sound too bright for the dim news.",
    "synonym3": "mismatched",
    "synonym3Definition": "unsuitably paired or combined, awkwardly different",
    "synonym3ExampleSentence": "The mismatched socks peeked from his boots, a quirk in his careful stride."
  },
  {
    "word": "incorrigible",
    "definition": "not able to be corrected or reformed, stubbornly persistent",
    "exampleSentence": "The incorrigible prankster struck again, his grin unshaken by the teacher’s stern glare.",
    "synonym1": "unreformable",
    "synonym1Definition": "resistant to improvement or change, beyond redemption",
    "synonym1ExampleSentence": "Her unreformable habit of teasing held firm, a thread no scolding could cut.",
    "synonym2": "inveterate",
    "synonym2Definition": "deeply ingrained or habitual, long-established",
    "synonym2ExampleSentence": "The inveterate smoker lit up again, his cough a rhythm to the curling smoke.",
    "synonym3": "obstinate",
    "synonym3Definition": "stubbornly refusing to change, fixed in defiance",
    "synonym3ExampleSentence": "His obstinate silence blocked their pleas, a wall no words could scale."
  },
  {
    "word": "indefatigable",
    "definition": "persistently tireless and energetic, incapable of being worn out",
    "exampleSentence": "Her indefatigable spirit carried the march, her chants a drumbeat through the weary dusk.",
    "synonym1": "tireless",
    "synonym1Definition": "working without exhaustion, relentlessly enduring",
    "synonym1ExampleSentence": "The tireless runner pounded the trail, her breath steady as the miles blurred.",
    "synonym2": "unflagging",
    "synonym2Definition": "not weakening or faltering, steadily vigorous",
    "synonym2ExampleSentence": "His unflagging effort built the wall, each stone a testament to his quiet will.",
    "synonym3": "relentless",
    "synonym3Definition": "unyieldingly persistent, pressing on without pause",
    "synonym3ExampleSentence": "The relentless rain carved the rock, its drops a force no cliff could deny."
  },
  {
    "word": "indolent",
    "definition": "lazy or idle, avoiding effort or exertion",
    "exampleSentence": "The indolent cat sprawled in the sun, its yawn a slow stretch across the warm stone.",
    "synonym1": "slothful",
    "synonym1Definition": "disinclined to work or activity, sluggishly idle",
    "synonym1ExampleSentence": "His slothful pace irked the team, each step a drag on their tight clock.",
    "synonym2": "lethargic",
    "synonym2Definition": "lacking energy or enthusiasm, drowsily slow",
    "synonym2ExampleSentence": "The lethargic afternoon weighed her down, her book slipping from limp hands.",
    "synonym3": "idle",
    "synonym3Definition": "not occupied or active, lazily unoccupied",
    "synonym3ExampleSentence": "The idle hands of summer twirled grass, time a haze in the heat’s grip."
  },
  {
    "word": "ineffable",
    "definition": "too great or extreme to be expressed in words, beyond description",
    "exampleSentence": "The ineffable beauty of the dawn hushed them, its golden spill a poem no tongue could recite.",
    "synonym1": "indescribable",
    "synonym1Definition": "defying expression or capture, eluding language",
    "synonym1ExampleSentence": "The indescribable scent of rain filled her, a breath too vast for names.",
    "synonym2": "unspeakable",
    "synonym2Definition": "impossible to articulate, overwhelming in its scope",
    "synonym2ExampleSentence": "The unspeakable joy of reunion lit her eyes, a shine words couldn’t touch.",
    "synonym3": "inexpressible",
    "synonym3Definition": "too profound or subtle for verbal form, mute in its depth",
    "synonym3ExampleSentence": "His inexpressible grief sank into silence, a weight no cry could lift."
  },
  {
    "word": "inexorable",
    "definition": "impossible to stop or prevent, relentlessly unyielding",
    "exampleSentence": "The inexorable march of time wore the castle down, its stones crumbling under centuries’ tread.",
    "synonym1": "relentless",
    "synonym1Definition": "unstoppably persistent, pressing forward without mercy",
    "synonym1ExampleSentence": "The relentless waves battered the shore, their roar a song of endless force.",
    "synonym2": "unstoppable",
    "synonym2Definition": "incapable of being halted or diverted, overpoweringly steady",
    "synonym2ExampleSentence": "Her unstoppable will drove the cause, a current no dam could hold.",
    "synonym3": "inevitable",
    "synonym3Definition": "certain to happen and unavoidable, fated to proceed",
    "synonym3ExampleSentence": "The inevitable dusk crept in, its shadow a cloak no light could fend off."
  },
  {
    "word": "infamy",
    "definition": "the state of being famous for something bad or evil, notorious disgrace",
    "exampleSentence": "His infamy spread after the betrayal, a name hissed in the alleys he once ruled.",
    "synonym1": "notoriety",
    "synonym1Definition": "fame derived from wicked or scandalous acts, widely known",
    "synonym1ExampleSentence": "Her notoriety grew with the heist, a legend carved in the city’s underbelly.",
    "synonym2": "disrepute",
    "synonym2Definition": "a lack of respect or good reputation, fallen esteem",
    "synonym2ExampleSentence": "The disrepute of his schemes tainted his line, a stain on their proud crest.",
    "synonym3": "shame",
    "synonym3Definition": "a condition of dishonor or disgrace, publicly scorned",
    "synonym3ExampleSentence": "The shame of his flight clung to him, a cloak no victory could shed."
  },
  {
    "word": "ingenuous",
    "definition": "innocent and unsuspecting, openly sincere without guile",
    "exampleSentence": "Her ingenuous trust in strangers charmed them, a light unshaded by the world’s dark corners.",
    "synonym1": "naive",
    "synonym1Definition": "lacking experience or cynicism, simply trusting",
    "synonym1ExampleSentence": "His naive hope in the plan shone through, a belief untested by its cracks.",
    "synonym2": "candid",
    "synonym2Definition": "truthful and straightforward, free of pretense",
    "synonym2ExampleSentence": "Her candid answer cut the silence, a blade of honesty in the room’s haze.",
    "synonym3": "artless",
    "synonym3Definition": "natural and unaffected, without deceit or sophistication",
    "synonym3ExampleSentence": "The artless joy of her laugh rang out, a song untouched by artifice."
  },
  {
    "word": "inimical",
    "definition": "tending to obstruct or harm, unfriendly or hostile",
    "exampleSentence": "The inimical winds tore at their sails, a foe howling from the gray horizon.",
    "synonym1": "hostile",
    "synonym1Definition": "showing aggressive opposition or enmity, bitterly adverse",
    "synonym1ExampleSentence": "The hostile glare from across the table iced her words, a chill no smile could warm.",
    "synonym2": "adverse",
    "synonym2Definition": "unfavorable or contrary, working against success",
    "synonym2ExampleSentence": "The adverse conditions slowed their climb, each gust a push against their grit.",
    "synonym3": "antagonistic",
    "synonym3Definition": "actively opposing or showing enmity, combatively at odds",
    "synonym3ExampleSentence": "His antagonistic stance fueled the rift, a spark in the dry wood of their truce."
  },
  {
    "word": "inscrutable",
    "definition": "impossible to understand or interpret",
    "exampleSentence": "His inscrutable expression gave no hint of his true feelings.",
    "synonym1": "enigmatic",
    "synonym1Definition": "mysterious and difficult to understand",
    "synonym1ExampleSentence": "The enigmatic stranger left the town buzzing with curiosity.",
    "synonym2": "mysterious",
    "synonym2Definition": "difficult or impossible to explain or identify",
    "synonym2ExampleSentence": "The mysterious lights in the sky puzzled onlookers.",
    "synonym3": "opaque",
    "synonym3Definition": "not able to be seen through or understood",
    "synonym3ExampleSentence": "Her opaque remarks left everyone guessing her intent."
  },
  {
    "word": "insidious",
    "definition": "proceeding in a gradual, subtle way but with harmful effects",
    "exampleSentence": "The insidious rumor wormed through the town, its poison seeping into every ear unnoticed.",
    "synonym1": "sly",
    "synonym1Definition": "cunningly secretive or deceptive, quietly crafty",
    "synonym1ExampleSentence": "Her sly grin hid the scheme, a curve masking the web she wove.",
    "synonym2": "stealthy",
    "synonym2Definition": "moving or acting in a cautious, secretive manner",
    "synonym2ExampleSentence": "The stealthy cat crept through the grass, a shadow stalking the dusk.",
    "synonym3": "treacherous",
    "synonym3Definition": "dangerously deceptive or unstable, betraying trust",
    "synonym3ExampleSentence": "The treacherous ice cracked beneath them, a smile hiding its deadly bite."
  },
  {
    "word": "insipid",
    "definition": "lacking flavor, vigor, or interest, dull and unexciting",
    "exampleSentence": "The insipid soup sat untouched, its bland broth a yawn in a bowl.",
    "synonym1": "bland",
    "synonym1Definition": "lacking strong taste or character, mildly dull",
    "synonym1ExampleSentence": "The bland tune faded into the noise, a hum too soft to catch the ear.",
    "synonym2": "vapid",
    "synonym2Definition": "offering nothing stimulating or challenging, emptily flat",
    "synonym2ExampleSentence": "Her vapid chatter drained the room, a stream of words with no current.",
    "synonym3": "dull",
    "synonym3Definition": "lacking sharpness or excitement, tiresomely plain",
    "synonym3ExampleSentence": "The dull lecture lulled them to sleep, its drone a blanket over their minds."
  },
  {
    "word": "insular",
    "definition": "narrow-minded or isolated, detached from broader perspectives",
    "exampleSentence": "The insular village clung to old ways, its gates shut to the whirl of the world beyond.",
    "synonym1": "parochial",
    "synonym1Definition": "limited to a narrow scope or local concerns, provincial",
    "synonym1ExampleSentence": "His parochial views ignored the city, a lens fixed on the fields he knew.",
    "synonym2": "isolated",
    "synonym2Definition": "set apart or separated, cut off from wider contact",
    "synonym2ExampleSentence": "The isolated cabin stood alone, its silence a wall against the wind’s howl.",
    "synonym3": "provincial",
    "synonym3Definition": "having the manners or outlook of a small region, rustic",
    "synonym3ExampleSentence": "Her provincial tastes favored homespun, a quilt of comfort over city silk."
  },
  {
    "word": "intrepid",
    "definition": "fearlessly adventurous or bold, resolutely courageous",
    "exampleSentence": "The intrepid explorer scaled the peak, her breath a defiance of the thin, cold air.",
    "synonym1": "fearless",
    "synonym1Definition": "lacking fear or hesitation, bravely unshaken",
    "synonym1ExampleSentence": "His fearless dive into the waves stunned them, a plunge into the sea’s roar.",
    "synonym2": "valiant",
    "synonym2Definition": "possessing or showing courage, heroically bold",
    "synonym2ExampleSentence": "The valiant knight faced the beast, his sword a gleam in the dark hollow.",
    "synonym3": "dauntless",
    "synonym3Definition": "undaunted by danger or difficulty, steadfastly brave",
    "synonym3ExampleSentence": "Her dauntless spirit met the storm, a light no gale could snuff out."
  },
  {
    "word": "inundate",
    "definition": "to overwhelm with a flood or great quantity, often excessively",
    "exampleSentence": "The news inundated her with updates, a torrent of words drowning her quiet morning.",
    "synonym1": "flood",
    "synonym1Definition": "to cover or submerge with an overflowing rush",
    "synonym1ExampleSentence": "Rain flooded the streets, a surge that swept trash into swirling eddies.",
    "synonym2": "swamp",
    "synonym2Definition": "to overburden or engulf, bogging down with excess",
    "synonym2ExampleSentence": "Calls swamped the line, each ring a weight on her fraying patience.",
    "synonym3": "deluge",
    "synonym3Definition": "to overwhelm with a heavy downpour or volume",
    "synonym3ExampleSentence": "The deluge of letters filled her box, a paper tide spilling onto the floor."
  },
  {
    "word": "inured",
    "definition": "accustomed to something unpleasant through prolonged exposure",
    "exampleSentence": "She was inured to the cold, her skin toughened by years on the frostbitten plains.",
    "synonym1": "hardened",
    "synonym1Definition": "made tough or resilient by experience, unyielding",
    "synonym1ExampleSentence": "His hardened hands gripped the plow, calluses a map of endless toil.",
    "synonym2": "accustomed",
    "synonym2Definition": "familiarized through repetition, comfortably used to",
    "synonym2ExampleSentence": "He grew accustomed to the noise, its clamor a lullaby in his city bed.",
    "synonym3": "desensitized",
    "synonym3Definition": "rendered less sensitive or reactive, numbed by habit",
    "synonym3ExampleSentence": "She was desensitized to the chaos, her calm a shield in the storm’s eye."
  },
  {
    "word": "invective",
    "definition": "harsh, abusive language used to attack or criticize",
    "exampleSentence": "His invective lashed the room, a whip of words slashing through their stunned silence.",
    "synonym1": "vituperation",
    "synonym1Definition": "bitter and abusive condemnation, fiercely scolding",
    "synonym1ExampleSentence": "Her vituperation stung the crowd, a venomous rain from her sharp tongue.",
    "synonym2": "diatribe",
    "synonym2Definition": "a prolonged and bitter verbal assault, angrily ranting",
    "synonym2ExampleSentence": "The diatribe against his foes echoed, a gale of rage in the quiet hall.",
    "synonym3": "tirade",
    "synonym3Definition": "a long, vehement speech of censure or denunciation",
    "synonym3ExampleSentence": "His tirade shook the walls, each curse a brick hurled at their calm."
  },
  {
    "word": "inveigle",
    "definition": "to persuade through flattery or trickery, enticing subtly",
    "exampleSentence": "She inveigled him into the scheme with a smile, her honeyed words a trap he couldn’t see.",
    "synonym1": "cajole",
    "synonym1Definition": "to coax gently with flattery or promises, luring softly",
    "synonym1ExampleSentence": "He cajoled her into the dance, his charm a thread pulling her to the floor.",
    "synonym2": "entice",
    "synonym2Definition": "to attract or tempt with something desirable, alluringly",
    "synonym2ExampleSentence": "The scent enticed her closer, a waft of spice drawing her to the hearth.",
    "synonym3": "beguile",
    "synonym3Definition": "to charm or deceive with captivating appeal",
    "synonym3ExampleSentence": "His tale beguiled them all, a weave of wonder over their wide eyes."
  },
  {
    "word": "inveterate",
    "definition": "long-established and unlikely to change, deeply habitual",
    "exampleSentence": "The inveterate gambler bet again, his coins a rhythm on the worn table’s edge.",
    "synonym1": "chronic",
    "synonym1Definition": "persistent over a long period, recurring constantly",
    "synonym1ExampleSentence": "Her chronic lateness irked them, a clock she never wound to time.",
    "synonym2": "ingrained",
    "synonym2Definition": "deeply fixed or embedded, a part of one’s nature",
    "synonym2ExampleSentence": "His ingrained courtesy bowed to all, a habit carved by years of grace.",
    "synonym3": "habitual",
    "synonym3Definition": "done regularly as a matter of custom, second nature",
    "synonym3ExampleSentence": "The habitual hum of her song filled the house, a tune tied to dawn."
  },
  {
    "word": "irascible",
    "definition": "easily provoked to anger or irritability, quick-tempered",
    "exampleSentence": "The irascible chef barked at spills, his temper a flame in the kitchen’s heat.",
    "synonym1": "testy",
    "synonym1Definition": "prone to annoyance or sharpness, snappily cross",
    "synonym1ExampleSentence": "Her testy reply cut the chat, a bite from a morning stretched too thin.",
    "synonym2": "choleric",
    "synonym2Definition": "having a fiery or bad temper, hotly irritable",
    "synonym2ExampleSentence": "His choleric outburst flared at the delay, a storm over a late train.",
    "synonym3": "peevish",
    "synonym3Definition": "showing petty irritation or petulance, easily ruffled",
    "synonym3ExampleSentence": "The peevish clerk muttered at the line, each coin a spark to his frown."
  },
  {
    "word": "jejune",
    "definition": "naive, simplistic, or superficial",
    "exampleSentence": "His jejune ideas lacked the depth needed for debate.",
    "synonym1": "immature",
    "synonym1Definition": "not fully developed or grown",
    "synonym1ExampleSentence": "Her immature outburst surprised the group.",
    "synonym2": "puerile",
    "synonym2Definition": "childishly silly or trivial",
    "synonym2ExampleSentence": "The puerile joke fell flat with adults.",
    "synonym3": "shallow",
    "synonym3Definition": "lacking depth or substance",
    "synonym3ExampleSentence": "The shallow analysis missed key points."
  },
  {
    "word": "jettison",
    "definition": "to abandon or discard something",
    "exampleSentence": "The crew had to jettison excess cargo to lighten the ship.",
    "synonym1": "discard",
    "synonym1Definition": "to get rid of as no longer useful",
    "synonym1ExampleSentence": "She decided to discard the outdated notes.",
    "synonym2": "abandon",
    "synonym2Definition": "to give up or leave behind",
    "synonym2ExampleSentence": "They chose to abandon the plan when obstacles arose.",
    "synonym3": "dump",
    "synonym3Definition": "to dispose of carelessly",
    "synonym3ExampleSentence": "He dumped the old furniture by the roadside."
  },
  {
    "word": "jocular",
    "definition": "fond of or characterized by joking, humorous in a playful way",
    "exampleSentence": "His jocular remarks during the tense meeting lightened the mood and eased everyone’s nerves.",
    "synonym1": "witty",
    "synonym1Definition": "showing quick and clever humor, often through sharp observation",
    "synonym1ExampleSentence": "Her witty retort to the critic left the room chuckling and nodding in agreement.",
    "synonym2": "facetious",
    "synonym2Definition": "treating serious issues with deliberately inappropriate humor",
    "synonym2ExampleSentence": "His facetious comment about the deadline drew laughter despite the looming pressure.",
    "synonym3": "jesting",
    "synonym3Definition": "speaking or acting in a playful, teasing manner for amusement",
    "synonym3ExampleSentence": "The jesting tone of their banter made the long car ride far more enjoyable."
  },
  {
    "word": "judicious",
    "definition": "having or showing good judgment, wisely sensible",
    "exampleSentence": "Her judicious choice of words calmed the feud, a bridge built with careful steps.",
    "synonym1": "prudent",
    "synonym1Definition": "acting with caution and foresight, thoughtfully wise",
    "synonym1ExampleSentence": "His prudent savings braced the fall, a nest egg for the lean days.",
    "synonym2": "discerning",
    "synonym2Definition": "showing keen insight or perception, finely discriminating",
    "synonym2ExampleSentence": "The discerning critic caught the flaw, her eye a blade through the play.",
    "synonym3": "sagacious",
    "synonym3Definition": "having sharp wisdom or shrewd judgment, deeply astute",
    "synonym3ExampleSentence": "His sagacious advice steered them clear, a compass in the storm’s swirl."
  },
  {
    "word": "juxtapose",
    "definition": "to place side by side for contrast",
    "exampleSentence": "The artist chose to juxtapose light and shadow in her work.",
    "synonym1": "contrast",
    "synonym1Definition": "to compare to show differences",
    "synonym1ExampleSentence": "The essay contrasts two opposing views.",
    "synonym2": "compare",
    "synonym2Definition": "to examine for similarities or differences",
    "synonym2ExampleSentence": "She compared the samples to find a match.",
    "synonym3": "oppose",
    "synonym3Definition": "to set against for comparison or conflict",
    "synonym3ExampleSentence": "The colors oppose each other strikingly."
  },
  {
    "word": "juxtaposition",
    "definition": "the act of placing things side by side, often for contrast or comparison",
    "exampleSentence": "The juxtaposition of old and new in the city struck her, brick against glass in sharp relief.",
    "synonym1": "contrast",
    "synonym1Definition": "the state of being strikingly different when placed together",
    "synonym1ExampleSentence": "The contrast of dusk and dawn framed her view, a split sky over the ridge.",
    "synonym2": "proximity",
    "synonym2Definition": "nearness in space or relationship, closeness of placement",
    "synonym2ExampleSentence": "The proximity of the huts bred talk, voices mingling in the tight weave.",
    "synonym3": "apposition",
    "synonym3Definition": "placing side by side to relate or explain, grammatically or visually",
    "synonym3ExampleSentence": "The apposition of photos told the tale, each frame a chapter in dust."
  },
  {
    "word": "kismet",
    "definition": "destiny or fate, often viewed as a predetermined course of events",
    "exampleSentence": "She believed it was kismet that brought them together at that exact moment in the bustling café.",
    "synonym1": "fate",
    "synonym1Definition": "the development of events beyond a person’s control, regarded as inevitable",
    "synonym1ExampleSentence": "He accepted his fate with grace, trusting the path life had carved for him.",
    "synonym2": "destiny",
    "synonym2Definition": "a set of events believed to be an unchangeable outcome of one’s life",
    "synonym2ExampleSentence": "Her destiny seemed to pull her toward the stage, where she shone brightest.",
    "synonym3": "providence",
    "synonym3Definition": "the protective care of a higher power or the course it sets",
    "synonym3ExampleSentence": "Through providence, the lost letter found its way back to her after decades."
  },
  {
    "word": "knell",
    "definition": "the sound of a bell, especially signaling death",
    "exampleSentence": "The knell echoed through the village at dusk.",
    "synonym1": "toll",
    "synonym1Definition": "the ringing of a bell slowly",
    "synonym1ExampleSentence": "The toll marked the end of the ceremony.",
    "synonym2": "peal",
    "synonym2Definition": "a loud ringing of bells",
    "synonym2ExampleSentence": "The peal signaled the start of the festivity.",
    "synonym3": "chime",
    "synonym3Definition": "a harmonious bell sound",
    "synonym3ExampleSentence": "The chime rang out across the valley."
  },
  {
    "word": "kudos",
    "definition": "praise or honor for an achievement",
    "exampleSentence": "She earned kudos for her innovative design solution.",
    "synonym1": "acclaim",
    "synonym1Definition": "enthusiastic praise or approval",
    "synonym1ExampleSentence": "The play received acclaim from every critic.",
    "synonym2": "plaudits",
    "synonym2Definition": "expressions of praise or approval",
    "synonym2ExampleSentence": "The team basked in the plaudits after the win.",
    "synonym3": "commendation",
    "synonym3Definition": "formal praise or recognition",
    "synonym3ExampleSentence": "His commendation came with a shiny medal."
  },
  {
    "word": "lacerate",
    "definition": "to tear or deeply cut, physically or emotionally",
    "exampleSentence": "Her sharp words seemed to lacerate his fragile pride.",
    "synonym1": "rend",
    "synonym1Definition": "to tear apart violently",
    "synonym1ExampleSentence": "The storm’s force could rend the sails in two.",
    "synonym2": "slash",
    "synonym2Definition": "to cut with a sweeping motion",
    "synonym2ExampleSentence": "He used a blade to slash through the vines.",
    "synonym3": "mangle",
    "synonym3Definition": "to severely mutilate or damage",
    "synonym3ExampleSentence": "The machine mangled the fabric beyond repair."
  },
  {
    "word": "lachrymose",
    "definition": "tearful or mournful",
    "exampleSentence": "The lachrymose farewell left everyone misty-eyed.",
    "synonym1": "weepy",
    "synonym1Definition": "inclined to cry or tearful",
    "synonym1ExampleSentence": "The weepy child clung to her mother.",
    "synonym2": "lugubrious",
    "synonym2Definition": "mournful, often exaggeratedly so",
    "synonym2ExampleSentence": "His lugubrious tone dampened the mood.",
    "synonym3": "maudlin",
    "synonym3Definition": "tearfully sentimental",
    "synonym3ExampleSentence": "The maudlin speech moved the crowd."
  },
  {
    "word": "laconic",
    "definition": "using few words to express much, concisely brief",
    "exampleSentence": "His laconic reply—a nod—spoke volumes, a quiet yes in the room’s clamor.",
    "synonym1": "terse",
    "synonym1Definition": "sparing in words, abruptly concise",
    "synonym1ExampleSentence": "Her terse command cut the debate, a single word halting their tide.",
    "synonym2": "succinct",
    "synonym2Definition": "briefly and clearly expressed, compactly direct",
    "synonym2ExampleSentence": "The succinct note summed the plan, a line sharp as a blade’s edge.",
    "synonym3": "pithy",
    "synonym3Definition": "short but full of meaning, forcefully expressive",
    "synonym3ExampleSentence": "His pithy quip hit the mark, a dart of wit in the dull air."
  },
  {
    "word": "languid",
    "definition": "lacking in energy or vitality; slow",
    "exampleSentence": "The heat left her feeling languid and unwilling to move.",
    "synonym1": "listless",
    "synonym1Definition": "lacking energy or enthusiasm",
    "synonym1ExampleSentence": "After the long day, he felt listless and uninspired.",
    "synonym2": "lethargic",
    "synonym2Definition": "sluggish and lacking vigor",
    "synonym2ExampleSentence": "The lethargic pace of the game bored the crowd.",
    "synonym3": "torpid",
    "synonym3Definition": "inactive or sluggish",
    "synonym3ExampleSentence": "The torpid afternoon dragged on endlessly."
  },
  {
    "word": "lassitude",
    "definition": "a state of physical or mental weariness, lacking energy",
    "exampleSentence": "Lassitude settled over her after the trek, a fog that softened her bones and will.",
    "synonym1": "fatigue",
    "synonym1Definition": "extreme tiredness from exertion, draining vitality",
    "synonym1ExampleSentence": "Fatigue pulled at his limbs, each step a stone in the dusk’s heavy tide.",
    "synonym2": "lethargy",
    "synonym2Definition": "a lack of energy or enthusiasm, sluggishly dull",
    "synonym2ExampleSentence": "Lethargy wrapped him after the meal, his chair a cradle in the warm room.",
    "synonym3": "weariness",
    "synonym3Definition": "exhaustion or reluctance from prolonged effort",
    "synonym3ExampleSentence": "Weariness bowed her head, the day’s grind a weight on her frail frame."
  },
  {
    "word": "laudable",
    "definition": "worthy of praise or commendation, admirably deserving",
    "exampleSentence": "Her laudable effort to save the park won hearts, a green flag in the urban sprawl.",
    "synonym1": "commendable",
    "synonym1Definition": "deserving recognition or approval, notably praiseworthy",
    "synonym1ExampleSentence": "His commendable bravery shone in the dark, a light they’d never forget.",
    "synonym2": "praiseworthy",
    "synonym2Definition": "meriting acclaim or applause, honorably fine",
    "synonym2ExampleSentence": "The praiseworthy poem moved them, its lines a gift in the quiet hall.",
    "synonym3": "admirable",
    "synonym3Definition": "inspiring respect or approval, excellently worthy",
    "synonym3ExampleSentence": "Her admirable patience held the line, a calm thread in the fray."
  },
  {
    "word": "lethargic",
    "definition": "sluggish and lacking energy, apathetically slow",
    "exampleSentence": "The lethargic pace of the day dulled her, her coffee cold in the mug’s grip.",
    "synonym1": "listless",
    "synonym1Definition": "lacking enthusiasm or drive, idly spiritless",
    "synonym1ExampleSentence": "His listless shuffle crossed the floor, a ghost adrift in the noon light.",
    "synonym2": "languid",
    "synonym2Definition": "relaxed and slow-moving, faintly weary",
    "synonym2ExampleSentence": "The languid breeze barely stirred the leaves, a sigh in the thick heat.",
    "synonym3": "torpid",
    "synonym3Definition": "inactive or numb, dulled by fatigue",
    "synonym3ExampleSentence": "The torpid room hummed with silence, their minds heavy in the haze."
  },
  {
    "word": "levity",
    "definition": "lightness of manner or speech, often inappropriate humor",
    "exampleSentence": "His levity at the somber event jarred them, a laugh too bright for the gray veil.",
    "synonym1": "frivolity",
    "synonym1Definition": "lack of seriousness or depth, playfully trivial",
    "synonym1ExampleSentence": "Her frivolity danced through the talk, a breeze against their heavy words.",
    "synonym2": "flippancy",
    "synonym2Definition": "casual disrespect or lightness, glibly irreverent",
    "synonym2ExampleSentence": "The flippancy of his shrug irked her, a toss-off in the storm’s weight.",
    "synonym3": "mirth",
    "synonym3Definition": "amusement or laughter, joyously light",
    "synonym3ExampleSentence": "Mirth bubbled in their cheers, a spark lifting the night’s dark curtain."
  },
  {
    "word": "limpid",
    "definition": "clear and transparent, often with a calm or serene quality",
    "exampleSentence": "The limpid waters of the mountain lake reflected the sky like a flawless mirror.",
    "synonym1": "lucid",
    "synonym1Definition": "easily understood or brightly clear, free of confusion",
    "synonym1ExampleSentence": "His lucid explanation of the theory made it accessible even to beginners.",
    "synonym2": "pellucid",
    "synonym2Definition": "transparently clear, allowing light or understanding to pass through",
    "synonym2ExampleSentence": "The pellucid stream revealed every pebble resting on its sandy bed.",
    "synonym3": "crystal",
    "synonym3Definition": "exceptionally clear and sparkling, resembling fine glass",
    "synonym3ExampleSentence": "Her crystal voice carried through the hall, pure and unwavering."
  },
  {
    "word": "lithe",
    "definition": "slim, flexible, and gracefully agile in movement",
    "exampleSentence": "The lithe dancer wove through the air, her body a ribbon in the music’s flow.",
    "synonym1": "supple",
    "synonym1Definition": "bending or moving easily, pliantly graceful",
    "synonym1ExampleSentence": "The supple branch swayed with the wind, a bow that never snapped.",
    "synonym2": "agile",
    "synonym2Definition": "quick and light in motion, nimbly active",
    "synonym2ExampleSentence": "Her agile leap cleared the gap, a flash of speed over the stones.",
    "synonym3": "graceful",
    "synonym3Definition": "elegantly smooth or refined, flowing with ease",
    "synonym3ExampleSentence": "The graceful swan glided over the lake, a curve of white on still water."
  },
  {
    "word": "loquacious",
    "definition": "very talkative, flowing freely with words",
    "exampleSentence": "The loquacious guide filled the hike with tales, her voice a river over the trail’s dust.",
    "synonym1": "garrulous",
    "synonym1Definition": "excessively chatty, often about trivial things",
    "synonym1ExampleSentence": "His garrulous ramble spiced the night, a flood of words under the stars.",
    "synonym2": "verbose",
    "synonym2Definition": "using more words than needed, expansively wordy",
    "synonym2ExampleSentence": "The verbose speech stretched the hour, its length a weight on their ears.",
    "synonym3": "voluble",
    "synonym3Definition": "speaking fluently and at length, readily vocal",
    "synonym3ExampleSentence": "Her voluble joy spilled over, a cascade of cheer in the quiet room."
  },
  {
    "word": "lugubrious",
    "definition": "mournful or gloomy, often exaggeratedly so",
    "exampleSentence": "His lugubrious sigh hung in the air, a dirge for a day not yet lost.",
    "synonym1": "melancholy",
    "synonym1Definition": "sad and pensive, steeped in somber thought",
    "synonym1ExampleSentence": "The melancholy tune wound through her, a thread of dusk in her bright mind.",
    "synonym2": "doleful",
    "synonym2Definition": "expressing sorrow or misery, woefully mournful",
    "synonym2ExampleSentence": "The doleful eyes of the hound met hers, a plea in their wet shine.",
    "synonym3": "plaintive",
    "synonym3Definition": "sounding sad or wistful, gently mournful",
    "synonym3ExampleSentence": "Her plaintive cry rose soft, a whisper of loss in the wind’s rush."
  },
  {
    "word": "magnanimous",
    "definition": "generously forgiving or noble, lofty in spirit",
    "exampleSentence": "His magnanimous pardon of the slight stunned them, a grace rising above their petty fray.",
    "synonym1": "generous",
    "synonym1Definition": "freely giving or sharing, abundant in kindness",
    "synonym1ExampleSentence": "Her generous offer of time mended the gap, a gift in the storm’s wake.",
    "synonym2": "noble",
    "synonym2Definition": "showing high moral qualities or grandeur, dignified",
    "synonym2ExampleSentence": "The noble gesture of his bow honored them, a crown in his quiet stance.",
    "synonym3": "benevolent",
    "synonym3Definition": "well-meaning and kind, seeking others’ good",
    "synonym3ExampleSentence": "The benevolent smile warmed her, a sun breaking through his stern lines."
  },
  {
    "word": "malign",
    "definition": "to speak harmfully or evilly of, slanderously critical",
    "exampleSentence": "She chose to malign his work in whispers, her venom a shadow on his bright canvas.",
    "synonym1": "slander",
    "synonym1Definition": "to make false and damaging statements, injuring repute",
    "synonym1ExampleSentence": "He slandered her name in the square, his lies a stain on the cobblestones.",
    "synonym2": "defame",
    "synonym2Definition": "to attack one’s good name or honor, falsely accusing",
    "synonym2ExampleSentence": "The article defamed the chef, its words a blight on his plated art.",
    "synonym3": "vilify",
    "synonym3Definition": "to portray as wicked or despicable, harshly condemning",
    "synonym3ExampleSentence": "They vilified his choice in the press, a chorus of scorn over his quiet stand."
  },
  {
    "word": "malleable",
    "definition": "capable of being shaped or influenced",
    "exampleSentence": "Her malleable opinions shifted with each new argument.",
    "synonym1": "pliable",
    "synonym1Definition": "easily bent or flexible",
    "synonym1ExampleSentence": "The pliable clay took on intricate shapes in her hands.",
    "synonym2": "adaptable",
    "synonym2Definition": "able to adjust to new conditions",
    "synonym2ExampleSentence": "His adaptable nature helped him thrive in change.",
    "synonym3": "ductile",
    "synonym3Definition": "able to be drawn out or shaped",
    "synonym3ExampleSentence": "The ductile metal was perfect for crafting jewelry."
  },
  {
    "word": "maudlin",
    "definition": "self-pityingly or tearfully sentimental",
    "exampleSentence": "The maudlin song brought tears to every listener’s eyes.",
    "synonym1": "mawkish",
    "synonym1Definition": "sentimental in a feeble way",
    "synonym1ExampleSentence": "The mawkish movie left them rolling their eyes.",
    "synonym2": "sappy",
    "synonym2Definition": "excessively emotional or foolish",
    "synonym2ExampleSentence": "The sappy letter was dripping with cliches.",
    "synonym3": "schmaltzy",
    "synonym3Definition": "overly sentimental or nostalgic",
    "synonym3ExampleSentence": "The schmaltzy tune reminded her of old films."
  },
  {
    "word": "maverick",
    "definition": "an independent-minded person who resists conformity",
    "exampleSentence": "The maverick painter spurned trends, his brush a lone voice on the vast canvas.",
    "synonym1": "nonconformist",
    "synonym1Definition": "one who rejects conventional norms, defiantly unique",
    "synonym1ExampleSentence": "The nonconformist wore red in the sea of gray, a flame against the tide.",
    "synonym2": "rebel",
    "synonym2Definition": "a person who opposes authority or tradition, boldly resistant",
    "synonym2ExampleSentence": "The rebel shunned the rules, his path a scar through their neat lines.",
    "synonym3": "iconoclast",
    "synonym3Definition": "one who attacks cherished beliefs, radically unconventional",
    "synonym3ExampleSentence": "Her iconoclast views shook the hall, a hammer on their sacred walls."
  },
  {
    "word": "meander",
    "definition": "to follow a winding or indirect course, wandering leisurely",
    "exampleSentence": "The river meandered through the valley, its curves a lazy dance with the land.",
    "synonym1": "wander",
    "synonym1Definition": "to roam aimlessly or casually, drifting without aim",
    "synonym1ExampleSentence": "He wandered the woods at dusk, his steps a thread in the fading light.",
    "synonym2": "ramble",
    "synonym2Definition": "to move or speak in an unstructured, sprawling way",
    "synonym2ExampleSentence": "Her ramble took them through tales, a path lost in her winding words.",
    "synonym3": "zigzag",
    "synonym3Definition": "to move in sharp turns or angles, erratically indirect",
    "synonym3ExampleSentence": "The trail zigzagged up the hill, a jagged line in the green slope."
  },
  {
    "word": "mellifluous",
    "definition": "sweetly or smoothly flowing, pleasingly musical",
    "exampleSentence": "Her mellifluous voice soothed the crowd, a honeyed stream over their rough edges.",
    "synonym1": "euphonious",
    "synonym1Definition": "pleasant in sound, harmoniously agreeable",
    "synonym1ExampleSentence": "The euphonious chime rang clear, a note that danced in the still air.",
    "synonym2": "melodic",
    "synonym2Definition": "having a tuneful or songlike quality, richly musical",
    "synonym2ExampleSentence": "The melodic hum of the flute wove peace, a thread in the night’s weave.",
    "synonym3": "dulcet",
    "synonym3Definition": "softly sweet or soothing, gently pleasing to hear",
    "synonym3ExampleSentence": "His dulcet tones calmed her, a balm over the day’s sharp sting."
  },
  {
    "word": "mendacious",
    "definition": "not telling the truth; lying",
    "exampleSentence": "His mendacious claims unraveled under questioning.",
    "synonym1": "deceitful",
    "synonym1Definition": "intentionally misleading",
    "synonym1ExampleSentence": "Her deceitful smile hid her true intent.",
    "synonym2": "false",
    "synonym2Definition": "not true or genuine",
    "synonym2ExampleSentence": "The false promise lured them in.",
    "synonym3": "dishonest",
    "synonym3Definition": "not truthful or trustworthy",
    "synonym3ExampleSentence": "The dishonest vendor overcharged them."
  },
  {
    "word": "mercurial",
    "definition": "subject to sudden or unpredictable changes in mood or behavior",
    "exampleSentence": "His mercurial temperament made it hard to predict whether he’d greet you with a smile or a scowl.",
    "synonym1": "volatile",
    "synonym1Definition": "liable to change rapidly and unexpectedly, often emotionally",
    "synonym1ExampleSentence": "The volatile artist could be charming one moment and furious the next.",
    "synonym2": "capricious",
    "synonym2Definition": "guided by whim rather than reason, impulsively changeable",
    "synonym2ExampleSentence": "Her capricious decisions left the team scrambling to keep up with her whims.",
    "synonym3": "erratic",
    "synonym3Definition": "unpredictable in movement or behavior, lacking consistency",
    "synonym3ExampleSentence": "The erratic wind shifted directions, confounding the sailors’ attempts to steer."
  },
  {
    "word": "metamorphosis",
    "definition": "a profound change in form or nature, transformative renewal",
    "exampleSentence": "The caterpillar’s metamorphosis awed her, a cocoon splitting to wings in the sun.",
    "synonym1": "transformation",
    "synonym1Definition": "a thorough or dramatic alteration, reshaping entirely",
    "synonym1ExampleSentence": "The transformation of the town bloomed, brick rising where fields once lay.",
    "synonym2": "change",
    "synonym2Definition": "the act of becoming different, shifting essence",
    "synonym2ExampleSentence": "The change in her voice marked years, a timbre deepened by time.",
    "synonym3": "evolution",
    "synonym3Definition": "a gradual development into a new state, unfolding growth",
    "synonym3ExampleSentence": "His evolution from shy to bold stunned them, a quiet seed now a tree."
  },
  {
    "word": "mirth",
    "definition": "amusement or laughter, expressed with joyous lightness",
    "exampleSentence": "Her mirth spilled over the table, a giggle that turned wine to bubbles.",
    "synonym1": "glee",
    "synonym1Definition": "exuberant delight or happiness, brightly cheerful",
    "synonym1ExampleSentence": "The glee of the children rang out, a chorus chasing the kite’s climb.",
    "synonym2": "jollity",
    "synonym2Definition": "lively and cheerful activity or mood, festively fun",
    "synonym2ExampleSentence": "The jollity of the fair lifted them, a whirl of color and cheer.",
    "synonym3": "merriment",
    "synonym3Definition": "gaiety and fun, a state of playful enjoyment",
    "synonym3ExampleSentence": "The merriment of the dance spun the night, steps light as the moon."
  },
  {
    "word": "mitigate",
    "definition": "to make less severe or painful, softening the impact",
    "exampleSentence": "The shade mitigated the sun’s glare, a cool hand over their flushed faces.",
    "synonym1": "alleviate",
    "synonym1Definition": "to reduce or relieve, easing discomfort",
    "synonym1ExampleSentence": "The balm alleviated her ache, a whisper of peace on her skin.",
    "synonym2": "lessen",
    "synonym2Definition": "to decrease in intensity or amount, shrinking force",
    "synonym2ExampleSentence": "The rain lessened their haste, a drizzle softening their run.",
    "synonym3": "moderate",
    "synonym3Definition": "to temper or restrain, calming excess",
    "synonym3ExampleSentence": "His voice moderated the clash, a tide pulling back their sharp words."
  },
  {
    "word": "modicum",
    "definition": "a small quantity of something, often just enough",
    "exampleSentence": "He showed a modicum of remorse, a flicker of regret in his steady gaze.",
    "synonym1": "bit",
    "synonym1Definition": "a small piece or amount, minimally present",
    "synonym1ExampleSentence": "A bit of luck turned the day, a coin flipped to their favor.",
    "synonym2": "smidgen",
    "synonym2Definition": "a tiny or slight portion, barely noticeable",
    "synonym2ExampleSentence": "A smidgen of spice woke the dish, a pinch in the bland sea.",
    "synonym3": "trace",
    "synonym3Definition": "a faint or barely detectable amount, a whisper",
    "synonym3ExampleSentence": "A trace of hope lit her words, a spark in the dark of her doubt."
  },
  {
    "word": "mollify",
    "definition": "to appease or calm someone’s anger or anxiety",
    "exampleSentence": "She tried to mollify him with a smile, her soft words a balm on his storm.",
    "synonym1": "pacify",
    "synonym1Definition": "to soothe or restore peace, quieting unrest",
    "synonym1ExampleSentence": "The lullaby pacified the child, its hum a blanket over his cries.",
    "synonym2": "appease",
    "synonym2Definition": "to satisfy or relieve by meeting demands",
    "synonym2ExampleSentence": "He appeased her with a gift, its shine a bridge over her frown.",
    "synonym3": "placate",
    "synonym3Definition": "to make less angry or hostile, gently calming",
    "synonym3ExampleSentence": "Her nod placated the crowd, a gesture cooling their rising heat."
  },
  {
    "word": "morose",
    "definition": "sullen and ill-tempered, gloomily withdrawn",
    "exampleSentence": "He grew morose as dusk fell, his silence a weight in the room’s fading light.",
    "synonym1": "sullen",
    "synonym1Definition": "bad-tempered and sulky, broodingly quiet",
    "synonym1ExampleSentence": "Her sullen pout darkened the meal, a cloud over their shared bread.",
    "synonym2": "gloomy",
    "synonym2Definition": "darkly despondent or pessimistic, heavily somber",
    "synonym2ExampleSentence": "The gloomy forecast matched his mood, a gray veil on his thoughts.",
    "synonym3": "dour",
    "synonym3Definition": "sternly severe or cheerless, grimly serious",
    "synonym3ExampleSentence": "His dour face met the jest, a stone unmoved by their laughter."
  },
  {
    "word": "multifarious",
    "definition": "having many different parts or forms, richly varied",
    "exampleSentence": "The multifarious crowd filled the square, a tapestry of faces under one sky.",
    "synonym1": "diverse",
    "synonym1Definition": "showing a wide variety, distinctly different",
    "synonym1ExampleSentence": "The diverse flavors danced on her tongue, a feast of clashing notes.",
    "synonym2": "varied",
    "synonym2Definition": "incorporating numerous types, broadly assorted",
    "synonym2ExampleSentence": "His varied tales spun the night, each thread a new hue.",
    "synonym3": "manifold",
    "synonym3Definition": "many and diverse, abundantly multiple",
    "synonym3ExampleSentence": "The manifold paths of the maze bewildered them, a web of choice."
  },
  {
    "word": "mundane",
    "definition": "lacking interest or excitement, ordinary and earthly",
    "exampleSentence": "The mundane task of sorting mail dulled her day, a shuffle of paper in gray light.",
    "synonym1": "ordinary",
    "synonym1Definition": "commonplace or usual, unremarkably typical",
    "synonym1ExampleSentence": "The ordinary meal sat plain, a plate without spark or surprise.",
    "synonym2": "routine",
    "synonym2Definition": "regularly habitual or predictable, comfortably dull",
    "synonym2ExampleSentence": "Her routine walk traced the block, a loop worn into her soles.",
    "synonym3": "prosaic",
    "synonym3Definition": "lacking poetic beauty, flatly everyday",
    "synonym3ExampleSentence": "The prosaic report droned on, its lines a march of plain fact."
  },
  {
    "word": "nadir",
    "definition": "the lowest point of something",
    "exampleSentence": "The team hit its nadir after losing ten games straight.",
    "synonym1": "low",
    "synonym1Definition": "the least or worst extent",
    "synonym1ExampleSentence": "His spirits reached a low after the news.",
    "synonym2": "bottom",
    "synonym2Definition": "the lowest level or point",
    "synonym2ExampleSentence": "The market fell to the bottom during the crash.",
    "synonym3": "depths",
    "synonym3Definition": "the most extreme low state",
    "synonym3ExampleSentence": "She sank into the depths of despair."
  },
  {
    "word": "nebulous",
    "definition": "vague or unclear, often like a cloud",
    "exampleSentence": "The plan remained nebulous, lacking concrete steps.",
    "synonym1": "hazy",
    "synonym1Definition": "unclear or indistinct",
    "synonym1ExampleSentence": "Her hazy memory of the event frustrated the group.",
    "synonym2": "vague",
    "synonym2Definition": "lacking definite form or clarity",
    "synonym2ExampleSentence": "His vague promises left everyone uncertain.",
    "synonym3": "amorphous",
    "synonym3Definition": "lacking a clear structure or shape",
    "synonym3ExampleSentence": "The amorphous blob of ideas needed refinement."
  },
  {
    "word": "nefarious",
    "definition": "wicked, villainous, or despicably evil",
    "exampleSentence": "The nefarious plot unraveled at dawn, its dark threads cut by the light of truth.",
    "synonym1": "sinister",
    "synonym1Definition": "suggesting evil or harm, darkly menacing",
    "synonym1ExampleSentence": "His sinister laugh chilled her, a sound curling from shadowed lips.",
    "synonym2": "heinous",
    "synonym2Definition": "shockingly atrocious or wicked, outrageously vile",
    "synonym2ExampleSentence": "The heinous crime shook the town, a stain no rain could wash away.",
    "synonym3": "villainous",
    "synonym3Definition": "characteristic of a cruel or evil antagonist",
    "synonym3ExampleSentence": "The villainous scheme gleamed in his eyes, a trap set with cold glee."
  },
  {
    "word": "nocturnal",
    "definition": "active or occurring at night",
    "exampleSentence": "The nocturnal creatures stirred as the sun set.",
    "synonym1": "nightly",
    "synonym1Definition": "happening or active at night",
    "synonym1ExampleSentence": "The nightly patrols kept the streets safe.",
    "synonym2": "after-dark",
    "synonym2Definition": "occurring after nightfall",
    "synonym2ExampleSentence": "The after-dark event drew a big crowd.",
    "synonym3": "crepuscular",
    "synonym3Definition": "active during twilight",
    "synonym3ExampleSentence": "The crepuscular birds sang at dawn and dusk."
  },
  {
    "word": "nonplussed",
    "definition": "so surprised or confused as to be unsure how to react",
    "exampleSentence": "She stood nonplussed by the unexpected applause, unsure whether to bow or flee the stage.",
    "synonym1": "perplexed",
    "synonym1Definition": "completely baffled or puzzled, unable to understand",
    "synonym1ExampleSentence": "He looked perplexed as the riddle’s answer eluded him despite his best efforts.",
    "synonym2": "bewildered",
    "synonym2Definition": "deeply confused or disoriented, often by something overwhelming",
    "synonym2ExampleSentence": "The bewildered tourists wandered the maze-like streets, clutching their outdated map.",
    "synonym3": "flummoxed",
    "synonym3Definition": "utterly confounded or thrown into confusion by a situation",
    "synonym3ExampleSentence": "The technician was flummoxed by the gadget’s refusal to work despite a perfect setup."
  },
  {
    "word": "nostalgia",
    "definition": "a sentimental longing for the past, often bittersweet in its glow",
    "exampleSentence": "Nostalgia washed over her at the song, its chords a bridge to childhood summers.",
    "synonym1": "yearning",
    "synonym1Definition": "a deep, tender desire or ache for something lost",
    "synonym1ExampleSentence": "His yearning for old friends stirred with the photo, faces faded but warm.",
    "synonym2": "wistfulness",
    "synonym2Definition": "a gentle, melancholy longing, softly pensive",
    "synonym2ExampleSentence": "The wistfulness in her voice painted the room, a sigh for days gone by.",
    "synonym3": "sentimentality",
    "synonym3Definition": "an emotional attachment to memories, often overly tender",
    "synonym3ExampleSentence": "Her sentimentality clung to the trinket, a keepsake heavy with yesterday."
  },
  {
    "word": "notorious",
    "definition": "widely known, especially for something bad or unfavorable",
    "exampleSentence": "The notorious thief slipped through shadows, his name a hiss in the city’s underbelly.",
    "synonym1": "infamous",
    "synonym1Definition": "famous for wickedness or disgrace, darkly celebrated",
    "synonym1ExampleSentence": "The infamous duel scarred the hill, its echo a tale of blood and pride.",
    "synonym2": "disreputable",
    "synonym2Definition": "lacking good repute, shadowed by ill fame",
    "synonym2ExampleSentence": "The disreputable tavern drew whispers, its doors a gate to rough nights.",
    "synonym3": "ill-famed",
    "synonym3Definition": "known widely for negative reasons, tainted by rumor",
    "synonym3ExampleSentence": "Her ill-famed past trailed her, a cloak no smile could fully shed."
  },
  {
    "word": "obdurate",
    "definition": "stubbornly unwilling to change one’s opinion",
    "exampleSentence": "He remained obdurate despite the overwhelming evidence.",
    "synonym1": "inflexible",
    "synonym1Definition": "unwilling to bend or compromise",
    "synonym1ExampleSentence": "Her inflexible stance stalled the negotiations.",
    "synonym2": "obstinate",
    "synonym2Definition": "stubbornly refusing to change",
    "synonym2ExampleSentence": "The obstinate child refused to eat his vegetables.",
    "synonym3": "unyielding",
    "synonym3Definition": "not giving way to pressure",
    "synonym3ExampleSentence": "His unyielding resolve impressed his peers."
  },
  {
    "word": "obfuscate",
    "definition": "to make unclear or difficult to understand",
    "exampleSentence": "The lawyer’s dense jargon seemed to obfuscate the simple terms of the agreement.",
    "synonym1": "bewilder",
    "synonym1Definition": "to cause confusion or perplexity",
    "synonym1ExampleSentence": "The maze of instructions bewildered even the most experienced hikers.",
    "synonym2": "muddle",
    "synonym2Definition": "to mix up or confuse",
    "synonym2ExampleSentence": "The conflicting reports muddled the timeline of events.",
    "synonym3": "obscure",
    "synonym3Definition": "to make less clear or harder to perceive",
    "synonym3ExampleSentence": "Heavy fog obscured the path ahead, forcing the travelers to pause."
  },
  {
    "word": "oblique",
    "definition": "indirect or slanting, not straightforward or explicit",
    "exampleSentence": "Her oblique hint slid past them, a shadow of meaning in her soft tone.",
    "synonym1": "indirect",
    "synonym1Definition": "not openly stated or approached, circuitously subtle",
    "synonym1ExampleSentence": "His indirect question probed her mind, a curve around the blunt edge.",
    "synonym2": "circuitous",
    "synonym2Definition": "taking a longer, winding route, avoiding the direct",
    "synonym2ExampleSentence": "The circuitous tale wove through years, a path lost in its loops.",
    "synonym3": "evasive",
    "synonym3Definition": "tending to avoid commitment or clarity, slippery",
    "synonym3ExampleSentence": "Her evasive reply danced away, a wisp no grasp could hold."
  },
  {
    "word": "obsequious",
    "definition": "excessively submissive or attentive",
    "exampleSentence": "His obsequious flattery annoyed the proud leader.",
    "synonym1": "servile",
    "synonym1Definition": "overly eager to please",
    "synonym1ExampleSentence": "The servile assistant nodded at every word.",
    "synonym2": "fawning",
    "synonym2Definition": "showing exaggerated affection",
    "synonym2ExampleSentence": "Her fawning praise felt insincere.",
    "synonym3": "sycophantic",
    "synonym3Definition": "flattering to gain favor",
    "synonym3ExampleSentence": "The sycophantic aide hovered nearby."
  },
  {
    "word": "obstreperous",
    "definition": "noisy and difficult to control",
    "exampleSentence": "The obstreperous crowd drowned out the speaker’s voice.",
    "synonym1": "boisterous",
    "synonym1Definition": "noisy and energetic",
    "synonym1ExampleSentence": "The boisterous kids ran wild in the yard.",
    "synonym2": "rowdy",
    "synonym2Definition": "disruptively loud or rough",
    "synonym2ExampleSentence": "The rowdy fans cheered late into the night.",
    "synonym3": "unruly",
    "synonym3Definition": "disorderly and hard to manage",
    "synonym3ExampleSentence": "The unruly class ignored the substitute."
  },
  {
    "word": "obtuse",
    "definition": "slow to understand or perceive, annoyingly dull-witted",
    "exampleSentence": "His obtuse grasp of the joke left them staring, a blank wall where laughter should’ve been.",
    "synonym1": "dense",
    "synonym1Definition": "thick-headed or slow to comprehend, heavily dim",
    "synonym1ExampleSentence": "Her dense nod missed the point, a fog over the clear hint.",
    "synonym2": "dull",
    "synonym2Definition": "lacking quickness or sharpness of mind, blunted",
    "synonym2ExampleSentence": "His dull response dragged the chat, a plow through their swift talk.",
    "synonym3": "dim",
    "synonym3Definition": "faintly perceptive or understanding, hazily slow",
    "synonym3ExampleSentence": "The dim flicker in his eyes lost the plan, a light too weak to shine."
  },
  {
    "word": "officious",
    "definition": "intrusively eager to help or advise, often overbearingly so",
    "exampleSentence": "The officious clerk thrust tips at her, his voice a net she couldn’t escape.",
    "synonym1": "meddlesome",
    "synonym1Definition": "interfering or prying into others’ affairs, nosily intrusive",
    "synonym1ExampleSentence": "Her meddlesome questions poked the wound, a thorn in their quiet grief.",
    "synonym2": "intrusive",
    "synonym2Definition": "forcing into private matters, unwantedly present",
    "synonym2ExampleSentence": "His intrusive advice broke her peace, a knock on a bolted door.",
    "synonym3": "overzealous",
    "synonym3Definition": "excessively enthusiastic or eager, pushily keen",
    "synonym3ExampleSentence": "The overzealous fan rushed the stage, a tide past the guards’ line."
  },
  {
    "word": "ominous",
    "definition": "suggesting something bad is about to happen, darkly foreboding",
    "exampleSentence": "The ominous clouds loomed low, a growl of thunder in their heavy folds.",
    "synonym1": "threatening",
    "synonym1Definition": "indicating danger or harm, menacingly poised",
    "synonym1ExampleSentence": "The threatening shadow stretched long, a claw over the path’s end.",
    "synonym2": "sinister",
    "synonym2Definition": "giving an impression of evil or trouble, wickedly dark",
    "synonym2ExampleSentence": "His sinister whisper chilled her, a snake’s hiss in the warm room.",
    "synonym3": "portentous",
    "synonym3Definition": "signaling a grave or significant event, weightily grim",
    "synonym3ExampleSentence": "The portentous silence hung thick, a curtain before the storm’s play."
  },
  {
    "word": "opprobrium",
    "definition": "harsh criticism or public disgrace, a mark of scorn",
    "exampleSentence": "The opprobrium of his failure stung, a lash from tongues once kind.",
    "synonym1": "reproach",
    "synonym1Definition": "blame or censure, often expressed with disapproval",
    "synonym1ExampleSentence": "Her reproach cut deeper than the wind, a cold edge to her quiet words.",
    "synonym2": "disgrace",
    "synonym2Definition": "loss of honor or respect, a fall from grace",
    "synonym2ExampleSentence": "The disgrace of the lie shadowed him, a stain on his bright name.",
    "synonym3": "ignominy",
    "synonym3Definition": "shameful dishonor, publicly humiliating",
    "synonym3ExampleSentence": "The ignominy of defeat bowed his head, a weight in the crowd’s gaze."
  },
  {
    "word": "ostensible",
    "definition": "apparently true but not necessarily so, outwardly stated",
    "exampleSentence": "His ostensible calm hid a storm, a mask over the churn beneath his skin.",
    "synonym1": "apparent",
    "synonym1Definition": "seeming real or obvious, surface-level",
    "synonym1ExampleSentence": "The apparent ease of her smile belied the hours, a veil on her strain.",
    "synonym2": "professed",
    "synonym2Definition": "claimed or declared, often without proof",
    "synonym2ExampleSentence": "His professed love rang hollow, a note off in the song’s key.",
    "synonym3": "seeming",
    "synonym3Definition": "appearing to be, though possibly deceptive",
    "synonym3ExampleSentence": "The seeming innocence of the plan fooled them, a trap in its soft lines."
  },
  {
    "word": "ostentatious",
    "definition": "characterized by vulgar or pretentious display, showily extravagant",
    "exampleSentence": "The ostentatious gown glittered loud, its sequins a shout in the room’s hush.",
    "synonym1": "flashy",
    "synonym1Definition": "strikingly bold or gaudy, drawing attention",
    "synonym1ExampleSentence": "His flashy car roared past, a streak of chrome in the gray dusk.",
    "synonym2": "pretentious",
    "synonym2Definition": "attempting to impress with exaggerated importance",
    "synonym2ExampleSentence": "Her pretentious air puffed the talk, a balloon of self over their heads.",
    "synonym3": "gaudy",
    "synonym3Definition": "excessively bright or ornate, tastelessly loud",
    "synonym3ExampleSentence": "The gaudy lights clashed with the night, a glare against the stars."
  },
  {
    "word": "ostracize",
    "definition": "to exclude or banish from a group, shunning socially",
    "exampleSentence": "They chose to ostracize him after the breach, his chair empty at the fire’s edge.",
    "synonym1": "shun",
    "synonym1Definition": "to deliberately avoid or reject, turning away",
    "synonym1ExampleSentence": "She shunned their calls, her steps a retreat from their once-warm circle.",
    "synonym2": "exclude",
    "synonym2Definition": "to keep out or bar from participation, shutting off",
    "synonym2ExampleSentence": "He excluded her from the plan, a line drawn through her name.",
    "synonym3": "banish",
    "synonym3Definition": "to send away or exile, removing forcibly",
    "synonym3ExampleSentence": "They banished the traitor at dawn, his shadow gone from their dawn."
  },
  {
    "word": "otiose",
    "definition": "serving no practical purpose or result; idle or superfluous",
    "exampleSentence": "The committee’s otiose discussions dragged on, producing nothing of value after hours of debate.",
    "synonym1": "futile",
    "synonym1Definition": "incapable of producing any useful outcome, pointlessly ineffective",
    "synonym1ExampleSentence": "Their futile attempts to fix the ancient machine only wasted more time.",
    "synonym2": "redundant",
    "synonym2Definition": "no longer needed or useful, exceeding what is necessary",
    "synonym2ExampleSentence": "The redundant instructions in the manual confused rather than helped the readers.",
    "synonym3": "superfluous",
    "synonym3Definition": "unnecessary or excessive, beyond what is required",
    "synonym3ExampleSentence": "Her superfluous comments during the presentation distracted from the main points."
  },
  {
    "word": "palatable",
    "definition": "pleasant or acceptable to the taste or mind, agreeable",
    "exampleSentence": "The palatable stew warmed her, its gentle spice a hug in the bowl.",
    "synonym1": "tasty",
    "synonym1Definition": "having a pleasing flavor, savorily good",
    "synonym1ExampleSentence": "The tasty bread cracked crisp, its warmth a song on her tongue.",
    "synonym2": "agreeable",
    "synonym2Definition": "pleasing or suitable, harmoniously mild",
    "synonym2ExampleSentence": "His agreeable nod settled the choice, a balm on their split talk.",
    "synonym3": "savory",
    "synonym3Definition": "appetizingly flavorful, rich to the taste",
    "synonym3ExampleSentence": "The savory pie steamed high, its scent a pull to the table."
  },
  {
    "word": "palliate",
    "definition": "to relieve or lessen without curing, easing symptoms",
    "exampleSentence": "The tea helped palliate her cough, a warm tide over the scratch in her throat.",
    "synonym1": "mitigate",
    "synonym1Definition": "to make less severe or intense, softening impact",
    "synonym1ExampleSentence": "The shade mitigated their burn, a cool hand against the sun’s fire.",
    "synonym2": "alleviate",
    "synonym2Definition": "to lighten or reduce, offering relief",
    "synonym2ExampleSentence": "His words alleviated her fear, a breath lifting the dark weight.",
    "synonym3": "soothe",
    "synonym3Definition": "to calm or comfort gently, tenderly easing",
    "synonym3ExampleSentence": "The balm soothed her sting, a whisper of peace on her raw skin."
  },
  {
    "word": "panacea",
    "definition": "a solution for all problems",
    "exampleSentence": "They viewed technology as a panacea for society’s woes.",
    "synonym1": "cure-all",
    "synonym1Definition": "a remedy for every issue",
    "synonym1ExampleSentence": "The tonic was sold as a cure-all for ailments.",
    "synonym2": "elixir",
    "synonym2Definition": "a magical or medicinal solution",
    "synonym2ExampleSentence": "The elixir promised to fix all their troubles.",
    "synonym3": "remedy",
    "synonym3Definition": "a means of counteracting a problem",
    "synonym3ExampleSentence": "The remedy soothed more than just her cold."
  },
  {
    "word": "paradigm",
    "definition": "a typical example or model, a pattern to follow",
    "exampleSentence": "Her work became a paradigm for the field, a blueprint etched in their minds.",
    "synonym1": "model",
    "synonym1Definition": "an exemplary standard or design, worth emulating",
    "synonym1ExampleSentence": "The model city gleamed bright, a guide for their dusty streets.",
    "synonym2": "pattern",
    "synonym2Definition": "a regular form or arrangement, consistently shaped",
    "synonym2ExampleSentence": "The pattern of her days held firm, a rhythm in the chaos’ swirl.",
    "synonym3": "example",
    "synonym3Definition": "a representative instance, illustratively typical",
    "synonym3ExampleSentence": "His example led them on, a torch in the dark of their doubt."
  },
  {
    "word": "paragon",
    "definition": "a perfect example or model of excellence, flawlessly ideal",
    "exampleSentence": "She was a paragon of grace, her poise a star in the room’s dim orbit.",
    "synonym1": "ideal",
    "synonym1Definition": "a standard of perfection, ultimately desirable",
    "synonym1ExampleSentence": "His ideal of courage stood tall, a peak no fear could shake.",
    "synonym2": "exemplar",
    "synonym2Definition": "an outstanding model or instance, notably superior",
    "synonym2ExampleSentence": "The exemplar of his craft shone, a blade forged in rare fire.",
    "synonym3": "epitome",
    "synonym3Definition": "the perfect embodiment of a quality or type",
    "synonym3ExampleSentence": "Her smile was the epitome of joy, a bloom in their gray day."
  },
  {
    "word": "pariah",
    "definition": "an outcast rejected or despised by society",
    "exampleSentence": "He became a pariah after the scandal, his shadow shunned in the town’s light.",
    "synonym1": "outcast",
    "synonym1Definition": "a person excluded from a group, cast aside",
    "synonym1ExampleSentence": "The outcast lingered at the gate, his voice lost to their turned backs.",
    "synonym2": "exile",
    "synonym2Definition": "one banished or separated from home or group",
    "synonym2ExampleSentence": "The exile roamed the hills, his steps a song of lonely dust.",
    "synonym3": "reject",
    "synonym3Definition": "someone dismissed or discarded, unwanted",
    "synonym3ExampleSentence": "The reject sat alone, his tray a cold island in the crowd."
  },
  {
    "word": "parsimonious",
    "definition": "excessively frugal or stingy, unwilling to spend",
    "exampleSentence": "His parsimonious ways dimmed the house, a single lamp for their long nights.",
    "synonym1": "stingy",
    "synonym1Definition": "reluctant to give or share, miserly tight",
    "synonym1ExampleSentence": "Her stingy tip irked the waiter, a coin too small for his warm grin.",
    "synonym2": "frugal",
    "synonym2Definition": "carefully sparing with resources, avoiding excess",
    "synonym2ExampleSentence": "The frugal meal stretched thin, a scrap saved for the dawn’s bite.",
    "synonym3": "miserly",
    "synonym3Definition": "hoarding wealth with greed, grudgingly sparse",
    "synonym3ExampleSentence": "His miserly hand clutched the purse, a fist no plea could open."
  },
  {
    "word": "partisan",
    "definition": "strongly devoted to a party or cause, often biasedly so",
    "exampleSentence": "Her partisan zeal fueled the rally, a flag waved high in the crowd’s roar.",
    "synonym1": "biased",
    "synonym1Definition": "unfairly prejudiced toward one side, slanted",
    "synonym1ExampleSentence": "His biased report bent the facts, a curve to fit his loud cheer.",
    "synonym2": "factional",
    "synonym2Definition": "relating to or supporting a specific group, clannish",
    "synonym2ExampleSentence": "The factional split cracked the hall, voices sharp on either side.",
    "synonym3": "zealous",
    "synonym3Definition": "fervently enthusiastic, passionately committed",
    "synonym3ExampleSentence": "Her zealous cry lit the cause, a spark in the night’s dark fold."
  },
  {
    "word": "patronize",
    "definition": "to treat with apparent kindness but underlying condescension",
    "exampleSentence": "He patronized her efforts with a nod, his smile a veil over his high perch.",
    "synonym1": "condescend",
    "synonym1Definition": "to act superior while seeming to lower oneself",
    "synonym1ExampleSentence": "She condescended to explain, her tone a ladder she stood above.",
    "synonym2": "belittle",
    "synonym2Definition": "to diminish or make seem less, slightingly",
    "synonym2ExampleSentence": "His laugh belittled her try, a thorn in her fragile bloom.",
    "synonym3": "deign",
    "synonym3Definition": "to do something considered beneath one’s dignity",
    "synonym3ExampleSentence": "He deigned to join them, his step a gift from his lofty tower."
  },
  {
    "word": "paucity",
    "definition": "a scarcity or smallness in amount, insufficiently few",
    "exampleSentence": "The paucity of rain left the fields cracked, a thirst no cloud could quench.",
    "synonym1": "scarcity",
    "synonym1Definition": "a lack or shortage, thinly present",
    "synonym1ExampleSentence": "The scarcity of wood slowed the fire, a spark in a bare hearth.",
    "synonym2": "dearth",
    "synonym2Definition": "an inadequate supply, meagerly lacking",
    "synonym2ExampleSentence": "A dearth of votes sank the plan, a dry well in their hope.",
    "synonym3": "insufficiency",
    "synonym3Definition": "a state of being not enough, falling short",
    "synonym3ExampleSentence": "The insufficiency of funds stalled them, a gap in their grand arc."
  },
  {
    "word": "peccadillo",
    "definition": "a small, relatively harmless fault or offense",
    "exampleSentence": "His peccadillo of sneaking sweets amused her, a child’s sin in a man’s frame.",
    "synonym1": "misdemeanor",
    "synonym1Definition": "a minor wrongdoing, lightly unlawful",
    "synonym1ExampleSentence": "The misdemeanor of a late return drew a shrug, a slip too small to sting.",
    "synonym2": "foible",
    "synonym2Definition": "a slight weakness or quirk, mildly flawed",
    "synonym2ExampleSentence": "Her foible for chatter warmed them, a hum in their quiet fold.",
    "synonym3": "lapse",
    "synonym3Definition": "a temporary failure or slip, briefly errant",
    "synonym3ExampleSentence": "The lapse in his watch passed quick, a blink in the day’s eye."
  },
  {
    "word": "pedantic",
    "definition": "overly concerned with minor details or rules, fussily academic",
    "exampleSentence": "His pedantic lecture bogged in facts, a mire of notes no heart could lift.",
    "synonym1": "didactic",
    "synonym1Definition": "intended to teach but often overly moralistic",
    "synonym1ExampleSentence": "Her didactic tone preached the rule, a sermon in the class’s yawn.",
    "synonym2": "nitpicking",
    "synonym2Definition": "focusing on trivial faults, pettily precise",
    "synonym2ExampleSentence": "His nitpicking edits frayed her page, a quibble on every dot.",
    "synonym3": "scholastic",
    "synonym3Definition": "relating to education in a dry, formal way",
    "synonym3ExampleSentence": "The scholastic debate droned on, a dust of words in their ears."
  },
  {
    "word": "pellucid",
    "definition": "transparently clear, easily understood or seen through",
    "exampleSentence": "The pellucid water showed every fish, a glass over the stream’s lively dance.",
    "synonym1": "limpid",
    "synonym1Definition": "clear and calm, serenely transparent",
    "synonym1ExampleSentence": "Her limpid gaze met his, a pool reflecting the sky’s soft hue.",
    "synonym2": "lucid",
    "synonym2Definition": "brightly clear or comprehensible, shiningly plain",
    "synonym2ExampleSentence": "His lucid words cut the fog, a lamp in their tangled talk.",
    "synonym3": "crystal",
    "synonym3Definition": "sparklingly clear, purely pristine",
    "synonym3ExampleSentence": "The crystal air of dawn woke her, a breath sharp with new light."
  },
  {
    "word": "penchant",
    "definition": "a strong liking or inclination for something, habitual fondness",
    "exampleSentence": "Her penchant for old books filled the shelves, a love bound in leather and dust.",
    "synonym1": "fondness",
    "synonym1Definition": "affection or preference, warmly drawn",
    "synonym1ExampleSentence": "His fondness for tea steeped the room, a scent of home in the air.",
    "synonym2": "proclivity",
    "synonym2Definition": "a natural tendency or bent, leaning toward",
    "synonym2ExampleSentence": "The proclivity for risk ran in her, a spark in her bold steps.",
    "synonym3": "predilection",
    "synonym3Definition": "a special liking or bias, favoring strongly",
    "synonym3ExampleSentence": "Her predilection for spice tinged the meal, a fire in every bite."
  },
  {
    "word": "penurious",
    "definition": "extremely poor or unwilling to spend, stingily needy",
    "exampleSentence": "The penurious widow patched her shawl, a threadbare shield in the cold wind.",
    "synonym1": "destitute",
    "synonym1Definition": "utterly lacking means, in abject poverty",
    "synonym1ExampleSentence": "The destitute man slept on stone, his coat a rag in the night’s bite.",
    "synonym2": "impecunious",
    "synonym2Definition": "having little or no money, financially bare",
    "synonym2ExampleSentence": "Her impecunious state sold her art, a canvas for bread’s sake.",
    "synonym3": "parsimonious",
    "synonym3Definition": "excessively thrifty, grudging every coin",
    "synonym3ExampleSentence": "His parsimonious grip held the purse, a lock no want could pry."
  },
  {
    "word": "peregrination",
    "definition": "a long journey or wandering",
    "exampleSentence": "Her peregrination took her across continents.",
    "synonym1": "journey",
    "synonym1Definition": "a trip or travel from one place to another",
    "synonym1ExampleSentence": "The journey through the desert tested them.",
    "synonym2": "odyssey",
    "synonym2Definition": "a long, eventful journey",
    "synonym2ExampleSentence": "His odyssey spanned years and seas.",
    "synonym3": "trek",
    "synonym3Definition": "a long, arduous trip",
    "synonym3ExampleSentence": "The trek up the mountain exhausted her."
  },
  {
    "word": "perfidy",
    "definition": "deliberate betrayal or treachery, faithless deceit",
    "exampleSentence": "The perfidy of his friend cut deep, a knife turned in the trust they’d built.",
    "synonym1": "treachery",
    "synonym1Definition": "violation of loyalty, wickedly disloyal",
    "synonym1ExampleSentence": "Her treachery sold their plan, a coin for their shared dreams.",
    "synonym2": "betrayal",
    "synonym2Definition": "an act of disloyalty, breaking faith",
    "synonym2ExampleSentence": "The betrayal stung her core, a crack in the wall of their bond.",
    "synonym3": "duplicity",
    "synonym3Definition": "deceptive double-dealing, two-faced guile",
    "synonym3ExampleSentence": "His duplicity wove the lie, a mask over the face she knew."
  },
  {
    "word": "perfunctory",
    "definition": "done with minimal effort or care",
    "exampleSentence": "His perfunctory apology did little to mend the rift.",
    "synonym1": "cursory",
    "synonym1Definition": "hasty and without attention to detail",
    "synonym1ExampleSentence": "A cursory glance at the map led them astray.",
    "synonym2": "superficial",
    "synonym2Definition": "concerned only with the surface or obvious",
    "synonym2ExampleSentence": "Her superficial review missed key flaws.",
    "synonym3": "mechanical",
    "synonym3Definition": "done automatically, without thought",
    "synonym3ExampleSentence": "The mechanical nod showed his disinterest."
  },
  {
    "word": "pernicious",
    "definition": "having a harmful effect, especially in a subtle or gradual way",
    "exampleSentence": "The pernicious rumor spread slow, its poison seeping into their fragile trust.",
    "synonym1": "deleterious",
    "synonym1Definition": "causing damage or harm, insidiously bad",
    "synonym1ExampleSentence": "The deleterious air choked her lungs, a haze in the valley’s grip.",
    "synonym2": "noxious",
    "synonym2Definition": "poisonous or harmful, dangerously foul",
    "synonym2ExampleSentence": "The noxious fumes rose thick, a cloud no breath could pierce.",
    "synonym3": "malignant",
    "synonym3Definition": "virulently harmful or evil, darkly destructive",
    "synonym3ExampleSentence": "The malignant growth ate his strength, a shadow in his bones."
  },
  {
    "word": "perspicacious",
    "definition": "having keen insight or understanding, sharply perceptive",
    "exampleSentence": "Her perspicacious eye caught the lie, a glint through his woven words.",
    "synonym1": "astute",
    "synonym1Definition": "shrewdly clever and discerning, quick to see",
    "synonym1ExampleSentence": "His astute guess hit the mark, a dart in the talk’s dark.",
    "synonym2": "discerning",
    "synonym2Definition": "showing fine judgment or insight, subtly sharp",
    "synonym2ExampleSentence": "The discerning palate picked the wine, a sip of vintage truth.",
    "synonym3": "sagacious",
    "synonym3Definition": "wisely insightful, deeply knowing",
    "synonym3ExampleSentence": "Her sagacious nod steered them, a compass in their lost sea."
  },
  {
    "word": "perspicuous",
    "definition": "clearly expressed and easy to understand, free of ambiguity",
    "exampleSentence": "The teacher’s perspicuous explanation of the formula turned a daunting topic into something manageable.",
    "synonym1": "lucid",
    "synonym1Definition": "brightly clear and readily comprehensible, often illuminating",
    "synonym1ExampleSentence": "Her lucid summary of the novel’s themes helped the class grasp its deeper meaning.",
    "synonym2": "explicit",
    "synonym2Definition": "stated directly and unmistakably, leaving no room for doubt",
    "synonym2ExampleSentence": "The contract’s explicit terms outlined exactly what each party was expected to deliver.",
    "synonym3": "plain",
    "synonym3Definition": "simple and straightforward, presented without ornament or confusion",
    "synonym3ExampleSentence": "His plain language made the instructions accessible to even the youngest learners."
  },
  {
    "word": "pertinacious",
    "definition": "holding firmly to a purpose or opinion, stubbornly tenacious",
    "exampleSentence": "His pertinacious grip on the goal drove them, a root in shifting sand.",
    "synonym1": "tenacious",
    "synonym1Definition": "clinging tightly or persistently, unyieldingly firm",
    "synonym1ExampleSentence": "Her tenacious hold kept the rope, a line against the wind’s pull.",
    "synonym2": "stubborn",
    "synonym2Definition": "refusing to change or relent, fixedly resolute",
    "synonym2ExampleSentence": "The stubborn oak stood tall, a trunk no storm could bend.",
    "synonym3": "persistent",
    "synonym3Definition": "continuing steadily despite obstacles, enduringly set",
    "synonym3ExampleSentence": "His persistent knock wore the door, a beat no silence could stop."
  },
  {
    "word": "petulant",
    "definition": "childishly sulky or bad-tempered, peevishly irritable",
    "exampleSentence": "Her petulant whine rose at the wait, a thorn in the room’s calm.",
    "synonym1": "peevish",
    "synonym1Definition": "easily annoyed or fretful, pettily cross",
    "synonym1ExampleSentence": "His peevish grunt met the rain, a growl at the sky’s wet gift.",
    "synonym2": "sulky",
    "synonym2Definition": "moodily silent or withdrawn, sullenly pouty",
    "synonym2ExampleSentence": "The sulky teen slumped in the chair, a cloud over their cheer.",
    "synonym3": "testy",
    "synonym3Definition": "quick to irritation or impatience, snappily sharp",
    "synonym3ExampleSentence": "Her testy snap cut the noise, a spark in the day’s dull hum."
  },
  {
    "word": "phlegmatic",
    "definition": "calm and unemotional, slow to excite or react",
    "exampleSentence": "His phlegmatic shrug met the news, a still pond in their stormy rush.",
    "synonym1": "stoic",
    "synonym1Definition": "enduring without complaint, resolutely steady",
    "synonym1ExampleSentence": "Her stoic face held through pain, a mask no tear could crack.",
    "synonym2": "impassive",
    "synonym2Definition": "showing no feeling or agitation, coolly flat",
    "synonym2ExampleSentence": "The impassive guard stood firm, a wall in the crowd’s swell.",
    "synonym3": "apathetic",
    "synonym3Definition": "lacking interest or emotion, indifferently numb",
    "synonym3ExampleSentence": "His apathetic yawn dulled the plan, a breeze past their fire."
  },
  {
    "word": "piquant",
    "definition": "pleasantly sharp or stimulating to the taste or mind",
    "exampleSentence": "The piquant sauce woke her senses, a sting of spice on the bland plate.",
    "synonym1": "zesty",
    "synonym1Definition": "lively and flavorful, boldly tangy",
    "synonym1ExampleSentence": "The zesty lemon cut the sweet, a burst in the cake’s soft fold.",
    "synonym2": "spicy",
    "synonym2Definition": "hot or pungent, richly seasoned",
    "synonym2ExampleSentence": "Her spicy retort lit the talk, a pepper in their mild chat.",
    "synonym3": "provocative",
    "synonym3Definition": "arousing interest or reaction, teasingly sharp",
    "synonym3ExampleSentence": "The provocative hint stirred them, a nudge in the room’s hush."
  },
  {
    "word": "placate",
    "definition": "to make less angry or hostile, soothing with concessions",
    "exampleSentence": "She tried to placate him with tea, its steam a peace over his sharp edge.",
    "synonym1": "appease",
    "synonym1Definition": "to calm by meeting demands, satisfying gently",
    "synonym1ExampleSentence": "He appeased her with a nod, a bridge over her rising tide.",
    "synonym2": "mollify",
    "synonym2Definition": "to soften or ease anger, tenderly calming",
    "synonym2ExampleSentence": "Her smile mollified the clash, a light in their dark fray.",
    "synonym3": "pacify",
    "synonym3Definition": "to restore peace or quiet, soothing unrest",
    "synonym3ExampleSentence": "The song pacified the room, a hum over their loud split."
  },
  {
    "word": "plaintive",
    "definition": "sounding sad or mournful, gently expressive of sorrow",
    "exampleSentence": "The plaintive wail of the violin hung low, a cry in the night’s still air.",
    "synonym1": "mournful",
    "synonym1Definition": "filled with grief or sadness, deeply woeful",
    "synonym1ExampleSentence": "Her mournful gaze met the sea, a tide of loss in her eyes.",
    "synonym2": "wistful",
    "synonym2Definition": "longingly sad or pensive, softly yearning",
    "synonym2ExampleSentence": "His wistful sigh traced the past, a breath for what was gone.",
    "synonym3": "melancholy",
    "synonym3Definition": "somberly thoughtful or gloomy, quietly blue",
    "synonym3ExampleSentence": "The melancholy note lingered, a shadow in the song’s arc."
  },
  {
    "word": "platitude",
    "definition": "a trite or overused remark, lacking originality",
    "exampleSentence": "His platitude about time healing all dulled her, a worn coin in her hand.",
    "synonym1": "cliché",
    "synonym1Definition": "a phrase dulled by repetition, predictably stale",
    "synonym1ExampleSentence": "The cliché of love’s power bored them, a line frayed by use.",
    "synonym2": "banality",
    "synonym2Definition": "something commonplace or unoriginal, flatly dull",
    "synonym2ExampleSentence": "The banality of his toast sank flat, a bubble lost in the glass.",
    "synonym3": "truism",
    "synonym3Definition": "an obvious truth repeated too often, thinly true",
    "synonym3ExampleSentence": "Her truism on effort echoed hollow, a drum with no beat."
  },
  {
    "word": "plethora",
    "definition": "an excessive amount or abundance, overflowing quantity",
    "exampleSentence": "The plethora of gifts piled high, a mountain of bows in the small room.",
    "synonym1": "abundance",
    "synonym1Definition": "a great quantity, plentifully rich",
    "synonym1ExampleSentence": "The abundance of fruit weighed the tree, a harvest in every branch.",
    "synonym2": "surfeit",
    "synonym2Definition": "an overabundant supply, excessively full",
    "synonym2ExampleSentence": "A surfeit of sweets sickened her, a sugar tide past her brim.",
    "synonym3": "excess",
    "synonym3Definition": "more than necessary or normal, overly much",
    "synonym3ExampleSentence": "The excess of noise shook her, a roar beyond the night’s need."
  },
  {
    "word": "plucky",
    "definition": "showing spirited courage or determination, bravely spirited",
    "exampleSentence": "The plucky girl faced the wind, her small frame a flag in the storm’s whip.",
    "synonym1": "brave",
    "synonym1Definition": "ready to face danger or fear, boldly daring",
    "synonym1ExampleSentence": "His brave stand held the line, a wall against the dark rush.",
    "synonym2": "spirited",
    "synonym2Definition": "full of energy or courage, lively in resolve",
    "synonym2ExampleSentence": "Her spirited cheer lit the gloom, a spark in the gray veil.",
    "synonym3": "gutsy",
    "synonym3Definition": "showing bold nerve or toughness, grit-filled",
    "synonym3ExampleSentence": "The gutsy leap cleared the gap, a shout in the air’s hold."
  },
  {
    "word": "ponderous",
    "definition": "slow and clumsy due to weight or size, heavily laborious",
    "exampleSentence": "The ponderous cart creaked down the hill, its load a groan in the wood.",
    "synonym1": "cumbersome",
    "synonym1Definition": "awkwardly bulky or unwieldy, hard to manage",
    "synonym1ExampleSentence": "The cumbersome pack slowed her step, a hump on her bent back.",
    "synonym2": "heavy",
    "synonym2Definition": "weighing much or moving slowly, thickly dense",
    "synonym2ExampleSentence": "His heavy tread shook the floor, a beat in the room’s hush.",
    "synonym3": "laborious",
    "synonym3Definition": "requiring great effort, ploddingly tough",
    "synonym3ExampleSentence": "The laborious task dragged on, a slog through the day’s mire."
  },
  {
    "word": "portent",
    "definition": "a sign or warning of a significant future event",
    "exampleSentence": "The red sky was a portent of change, a blush over their quiet dawn.",
    "synonym1": "omen",
    "synonym1Definition": "a prophetic sign of good or evil to come",
    "synonym1ExampleSentence": "The owl’s cry was an omen to her, a note in the night’s weave.",
    "synonym2": "harbinger",
    "synonym2Definition": "something that foreshadows or announces, signaling",
    "synonym2ExampleSentence": "The frost was a harbinger of winter, a chill in the leaves’ fall.",
    "synonym3": "forewarning",
    "synonym3Definition": "an advance caution or alert, preemptive",
    "synonym3ExampleSentence": "The wind’s howl was a forewarning, a gust before the storm’s teeth."
  },
  {
    "word": "pragmatic",
    "definition": "dealing with things sensibly and realistically, practically focused",
    "exampleSentence": "Her pragmatic fix patched the leak, a quick knot in the pipe’s cry.",
    "synonym1": "practical",
    "synonym1Definition": "concerned with doing rather than theory, usefully real",
    "synonym1ExampleSentence": "His practical step saved the day, a plank over the gap’s yawn.",
    "synonym2": "realistic",
    "synonym2Definition": "facing facts as they are, groundedly sane",
    "synonym2ExampleSentence": "Her realistic view cut the dream, a blade through its soft haze.",
    "synonym3": "sensible",
    "synonym3Definition": "chosen wisely or prudently, logically sound",
    "synonym3ExampleSentence": "The sensible choice warmed them, a fire lit with dry wood."
  },
  {
    "word": "precarious",
    "definition": "dangerously unstable or insecure, uncertainly risky",
    "exampleSentence": "The precarious ledge held her weight, a thin line under the wind’s push.",
    "synonym1": "unstable",
    "synonym1Definition": "liable to shift or fall, shakily unsteady",
    "synonym1ExampleSentence": "The unstable stack teetered high, a sway in the room’s breath.",
    "synonym2": "risky",
    "synonym2Definition": "full of hazard or peril, chancy",
    "synonym2ExampleSentence": "His risky bet raised the stakes, a throw in the dark’s grip.",
    "synonym3": "shaky",
    "synonym3Definition": "trembling or uncertain, weakly poised",
    "synonym3ExampleSentence": "The shaky bridge creaked low, a thread over the river’s roar."
  },
  {
    "word": "precipitate",
    "definition": "to cause suddenly or rashly, hastening an event",
    "exampleSentence": "His shout precipitated the clash, a spark in the dry grass of their calm.",
    "synonym1": "hasten",
    "synonym1Definition": "to speed up or hurry, quickening pace",
    "synonym1ExampleSentence": "She hastened the end with a word, a push past the slow talk.",
    "synonym2": "trigger",
    "synonym2Definition": "to set off or initiate, sparking action",
    "synonym2ExampleSentence": "The bell triggered their run, a chime in the still dawn.",
    "synonym3": "provoke",
    "synonym3Definition": "to stir or incite, rousing reaction",
    "synonym3ExampleSentence": "His jab provoked the fight, a flint in their tense air."
  },
  {
    "word": "preclude",
    "definition": "to prevent or make impossible, ruling out in advance",
    "exampleSentence": "Rain precluded their climb, a curtain drawn over the peak’s call.",
    "synonym1": "prevent",
    "synonym1Definition": "to stop from occurring, blocking ahead",
    "synonym1ExampleSentence": "The lock prevented his slip, a bar on the night’s theft.",
    "synonym2": "forestall",
    "synonym2Definition": "to act in advance to stop, preemptively halting",
    "synonym2ExampleSentence": "She forestalled the fall with a catch, a hand in the wind’s rush.",
    "synonym3": "prohibit",
    "synonym3Definition": "to formally forbid or bar, officially blocking",
    "synonym3ExampleSentence": "The sign prohibited their step, a line in the sand’s hold."
  },
  {
    "word": "precocious",
    "definition": "unusually advanced or mature, especially at a young age",
    "exampleSentence": "The precocious child read thick tomes, her mind a bloom in tender years.",
    "synonym1": "advanced",
    "synonym1Definition": "far ahead in development or progress, notably so",
    "synonym1ExampleSentence": "His advanced skill struck them, a chord beyond his short span.",
    "synonym2": "gifted",
    "synonym2Definition": "possessing exceptional talent or ability, naturally able",
    "synonym2ExampleSentence": "The gifted painter brushed light, a glow from her small hands.",
    "synonym3": "mature",
    "synonym3Definition": "developed beyond one’s years, ripely wise",
    "synonym3ExampleSentence": "Her mature calm steadied them, a rock in her young frame."
  },
  {
    "word": "predilection",
    "definition": "a preference or special liking for something, a favored bent",
    "exampleSentence": "His predilection for jazz shaped the night, a beat in the room’s pulse.",
    "synonym1": "penchant",
    "synonym1Definition": "a strong inclination or fondness, habitual taste",
    "synonym1ExampleSentence": "Her penchant for roses filled the yard, a blush in every corner.",
    "synonym2": "proclivity",
    "synonym2Definition": "a natural tendency or leaning, instinctive pull",
    "synonym2ExampleSentence": "The proclivity for risk ran deep, a fire in his bold play.",
    "synonym3": "affinity",
    "synonym3Definition": "a spontaneous attraction or kinship, closely drawn",
    "synonym3ExampleSentence": "Her affinity for words wove tales, a thread in her soul’s weave."
  },
  {
    "word": "preeminent",
    "definition": "surpassing others in rank or quality, outstandingly superior",
    "exampleSentence": "Her preeminent skill won the prize, a crown on the field’s green stretch.",
    "synonym1": "eminent",
    "synonym1Definition": "distinguished and notable, high in esteem",
    "synonym1ExampleSentence": "The eminent poet spoke soft, her lines a light in their dark.",
    "synonym2": "outstanding",
    "synonym2Definition": "exceptionally prominent or excellent, strikingly good",
    "synonym2ExampleSentence": "His outstanding leap broke the mark, a bound past their reach.",
    "synonym3": "paramount",
    "synonym3Definition": "chief in importance or impact, supremely high",
    "synonym3ExampleSentence": "The paramount need drove them, a call above the wind’s howl."
  },
  {
    "word": "presage",
    "definition": "to predict or foretell, a sign of something to come",
    "exampleSentence": "The crows presaged rain, their cries a dark note in the sky’s hush.",
    "synonym1": "foretell",
    "synonym1Definition": "to predict or prophesy, seeing ahead",
    "synonym1ExampleSentence": "The stars foretold a shift, a map in their cold gleam.",
    "synonym2": "portend",
    "synonym2Definition": "to indicate or warn of in advance, ominously hinting",
    "synonym2ExampleSentence": "The wind portended trouble, a gust in the calm’s break.",
    "synonym3": "augur",
    "synonym3Definition": "to serve as an omen or forecast, divining",
    "synonym3ExampleSentence": "The flame augured loss, a flicker in the night’s eye."
  },
  {
    "word": "prescience",
    "definition": "the ability to foresee or know events before they occur",
    "exampleSentence": "Her prescience saved the crop, a hunch sown before the storm’s lash.",
    "synonym1": "foresight",
    "synonym1Definition": "the act of seeing or planning ahead, wisely predictive",
    "synonym1ExampleSentence": "His foresight stocked the shed, a shield for the winter’s bite.",
    "synonym2": "clairvoyance",
    "synonym2Definition": "supernatural insight into the future, mystically clear",
    "synonym2ExampleSentence": "Her clairvoyance glimpsed the fall, a vision in the glass’s swirl.",
    "synonym3": "prophecy",
    "synonym3Definition": "a prediction of what will happen, divinely seen",
    "synonym3ExampleSentence": "The prophecy hung in her words, a thread from the unseen loom."
  },
  {
    "word": "prevaricate",
    "definition": "to evade the truth or speak evasively, dodging honesty",
    "exampleSentence": "He prevaricated under her gaze, his words a weave around the sharp point.",
    "synonym1": "equivocate",
    "synonym1Definition": "to use ambiguous language to avoid clarity",
    "synonym1ExampleSentence": "She equivocated on the choice, a mist over her firm stand.",
    "synonym2": "hedge",
    "synonym2Definition": "to avoid commitment with vague replies",
    "synonym2ExampleSentence": "His hedge danced the question, a step past the yes or no.",
    "synonym3": "lie",
    "synonym3Definition": "to deliberately speak falsehood, deceiving",
    "synonym3ExampleSentence": "The lie slipped smooth from his lips, a gloss on the day’s truth."
  },
  {
    "word": "pristine",
    "definition": "in its original, pure state, untouched or unspoiled",
    "exampleSentence": "The pristine snow draped the hill, a sheet no foot had crossed.",
    "synonym1": "immaculate",
    "synonym1Definition": "perfectly clean or pure, spotlessly clear",
    "synonym1ExampleSentence": "Her immaculate room gleamed, a shine no dust could dim.",
    "synonym2": "unspoiled",
    "synonym2Definition": "not ruined or tainted, naturally intact",
    "synonym2ExampleSentence": "The unspoiled lake mirrored the sky, a glass in the wild’s hold.",
    "synonym3": "flawless",
    "synonym3Definition": "without defect or blemish, ideally whole",
    "synonym3ExampleSentence": "The flawless gem caught the light, a star in her palm."
  },
  {
    "word": "proclivity",
    "definition": "a natural tendency or inclination",
    "exampleSentence": "Her proclivity for adventure led her to explore distant lands.",
    "synonym1": "penchant",
    "synonym1Definition": "a strong liking or preference",
    "synonym1ExampleSentence": "He has a penchant for collecting rare coins from around the world.",
    "synonym2": "propensity",
    "synonym2Definition": "a natural inclination or habit",
    "synonym2ExampleSentence": "The cat’s propensity for napping made it a lazy companion.",
    "synonym3": "predilection",
    "synonym3Definition": "a preference or special liking for something",
    "synonym3ExampleSentence": "Her predilection for spicy food shaped her restaurant choices."
  },
  {
    "word": "prodigal",
    "definition": "wastefully extravagant or recklessly lavish",
    "exampleSentence": "The prodigal feast drained their stores, a table piled high in the night’s glow.",
    "synonym1": "extravagant",
    "synonym1Definition": "lavish beyond need or reason, grandly excessive",
    "synonym1ExampleSentence": "Her extravagant gown swept the floor, a wave of silk in the hall.",
    "synonym2": "lavish",
    "synonym2Definition": "richly generous or abundant, freely overflowing",
    "synonym2ExampleSentence": "The lavish gift stunned them, a shine too bright for words.",
    "synonym3": "reckless",
    "synonym3Definition": "heedless of consequence, wildly free",
    "synonym3ExampleSentence": "His reckless spend burned the coin, a fire through their thin purse."
  },
  {
    "word": "prodigious",
    "definition": "remarkably great in extent or degree, impressively huge",
    "exampleSentence": "The prodigious oak towered alone, its branches a roof over the field’s stretch.",
    "synonym1": "immense",
    "synonym1Definition": "vastly large or boundless, hugely expansive",
    "synonym1ExampleSentence": "The immense sky swallowed her gaze, a blue too wide to hold.",
    "synonym2": "enormous",
    "synonym2Definition": "extremely big or extensive, strikingly vast",
    "synonym2ExampleSentence": "His enormous effort built the wall, a stone sea in the dust.",
    "synonym3": "colossal",
    "synonym3Definition": "gigantically massive or significant, awesomely huge",
    "synonym3ExampleSentence": "The colossal wave broke the shore, a titan in the water’s rush."
  },
  {
    "word": "profane",
    "definition": "showing disrespect for sacred things, irreverently secular",
    "exampleSentence": "His profane jest at the altar shocked them, a laugh in the holy hush.",
    "synonym1": "irreverent",
    "synonym1Definition": "lacking proper respect or seriousness, boldly casual",
    "synonym1ExampleSentence": "Her irreverent quip broke the rite, a spark in the dim glow.",
    "synonym2": "blasphemous",
    "synonym2Definition": "sacrilegiously disrespectful, wickedly impious",
    "synonym2ExampleSentence": "The blasphemous shout shook the pews, a crack in their faith’s wall.",
    "synonym3": "secular",
    "synonym3Definition": "worldly rather than spiritual, unconnected to sacred",
    "synonym3ExampleSentence": "His secular tune clashed the hymn, a note from the earth’s hum."
  },
  {
    "word": "profligate",
    "definition": "recklessly extravagant or wasteful, shamelessly wild",
    "exampleSentence": "The profligate heir burned his gold, a flame through the family’s hoard.",
    "synonym1": "wasteful",
    "synonym1Definition": "using resources carelessly, squandering freely",
    "synonym1ExampleSentence": "Her wasteful spill of grain irked them, a heap in the barn’s dust.",
    "synonym2": "extravagant",
    "synonym2Definition": "lavish beyond reason, grandly overdone",
    "synonym2ExampleSentence": "The extravagant feast drowned the night, a tide of coin and cheer.",
    "synonym3": "reckless",
    "synonym3Definition": "heedless of danger or cost, wildly free",
    "synonym3ExampleSentence": "His reckless dash spent their hope, a run through the dark’s edge."
  },
  {
    "word": "progenitor",
    "definition": "an ancestor or originator, a source of descent",
    "exampleSentence": "The progenitor of their line carved the stone, a root in their tall tree.",
    "synonym1": "ancestor",
    "synonym1Definition": "a person from whom one is descended, early kin",
    "synonym1ExampleSentence": "Her ancestor sailed the sea, a wave in her blood’s long tale.",
    "synonym2": "forebear",
    "synonym2Definition": "a previous generation’s member, lineage’s past",
    "synonym2ExampleSentence": "The forebear’s axe hung high, a mark of their old strength.",
    "synonym3": "originator",
    "synonym3Definition": "the one who begins or creates, first maker",
    "synonym3ExampleSentence": "The originator of the song hummed low, a seed in its wide bloom."
  },
  {
    "word": "prolix",
    "definition": "tediously long or wordy, excessively drawn out",
    "exampleSentence": "His prolix speech lost them, a river of words with no shore.",
    "synonym1": "verbose",
    "synonym1Definition": "using more words than needed, lengthily talkative",
    "synonym1ExampleSentence": "The verbose note stretched pages, a flood past the point’s bank.",
    "synonym2": "wordy",
    "synonym2Definition": "overly full of words, sprawlingly excessive",
    "synonym2ExampleSentence": "Her wordy tale wandered far, a path lost in its own weave.",
    "synonym3": "long-winded",
    "synonym3Definition": "drawn out beyond patience, tiresomely long",
    "synonym3ExampleSentence": "The long-winded rant dulled them, a wind with no end’s breath."
  },
  {
    "word": "propensity",
    "definition": "a natural inclination or tendency, often habitual",
    "exampleSentence": "Her propensity for laughter lit the dark, a spark in every shadow.",
    "synonym1": "tendency",
    "synonym1Definition": "a leaning or bent toward something, naturally drawn",
    "synonym1ExampleSentence": "His tendency to roam shaped his feet, a map in every step.",
    "synonym2": "penchant",
    "synonym2Definition": "a strong liking or preference, fondly inclined",
    "synonym2ExampleSentence": "The penchant for spice fired his plate, a heat in every bite.",
    "synonym3": "proclivity",
    "synonym3Definition": "an innate disposition, instinct’s pull",
    "synonym3ExampleSentence": "Her proclivity for song wove the air, a thread in the wind’s hum."
  },
  {
    "word": "propinquity",
    "definition": "proximity or nearness, closeness in space or relation",
    "exampleSentence": "The propinquity of their homes bred talk, a fence too thin for silence.",
    "synonym1": "proximity",
    "synonym1Definition": "nearness in distance or time, closely placed",
    "synonym1ExampleSentence": "The proximity of the storm shook them, a rumble in their bones.",
    "synonym2": "closeness",
    "synonym2Definition": "being near or intimate, tightly bound",
    "synonym2ExampleSentence": "The closeness of their kin held firm, a knot in life’s loose weave.",
    "synonym3": "nearness",
    "synonym3Definition": "the state of being close, spatially or emotionally",
    "synonym3ExampleSentence": "The nearness of her voice warmed him, a whisper in the dusk."
  },
  {
    "word": "propitiate",
    "definition": "to win favor or appease, often to avoid anger",
    "exampleSentence": "She offered sweets to propitiate her host, a sugar bridge over the rift.",
    "synonym1": "appease",
    "synonym1Definition": "to calm or satisfy, soothing with concessions",
    "synonym1ExampleSentence": "He appeased her with a bow, a curve to her rising storm.",
    "synonym2": "pacify",
    "synonym2Definition": "to restore peace or calm, gently quieting",
    "synonym2ExampleSentence": "The gift pacified his growl, a soft hand on his sharp edge.",
    "synonym3": "conciliate",
    "synonym3Definition": "to reconcile or make friendly, winning over",
    "synonym3ExampleSentence": "Her smile conciliated the foe, a light in their dark split."
  },
  {
    "word": "prosaic",
    "definition": "lacking poetic beauty or imagination, plainly ordinary",
    "exampleSentence": "The prosaic note listed facts, a dry line in the day’s wet dream.",
    "synonym1": "mundane",
    "synonym1Definition": "commonplace or unexciting, earthily dull",
    "synonym1ExampleSentence": "The mundane task dragged her, a weight in the light’s gleam.",
    "synonym2": "ordinary",
    "synonym2Definition": "usual or typical, unremarkably plain",
    "synonym2ExampleSentence": "His ordinary day passed slow, a clock in the room’s hum.",
    "synonym3": "dull",
    "synonym3Definition": "lacking interest or shine, flatly tame",
    "synonym3ExampleSentence": "The dull talk sank them, a drone in the air’s hush."
  },
  {
    "word": "protean",
    "definition": "readily changing form or nature, versatilely mutable",
    "exampleSentence": "Her protean style shifted with the crowd, a chameleon in the room’s hue.",
    "synonym1": "versatile",
    "synonym1Definition": "capable of adapting to many roles, flexibly able",
    "synonym1ExampleSentence": "His versatile hand fixed all, a tool in every trade’s call.",
    "synonym2": "adaptable",
    "synonym2Definition": "easily adjusting to new conditions, pliantly fit",
    "synonym2ExampleSentence": "The adaptable plan bent with wind, a reed in the storm’s rush.",
    "synonym3": "mutable",
    "synonym3Definition": "prone to change or variation, fluidly shifting",
    "synonym3ExampleSentence": "Her mutable mood danced free, a wave in the day’s tide."
  },
  {
    "word": "provident",
    "definition": "making preparations for the future, wisely thrifty",
    "exampleSentence": "His provident stash fed them through winter, a hoard in the cold’s grip.",
    "synonym1": "prudent",
    "synonym1Definition": "acting with care for the future, sagely cautious",
    "synonym1ExampleSentence": "Her prudent step saved the coin, a guard for the lean dawn.",
    "synonym2": "thrifty",
    "synonym2Definition": "using resources sparingly, frugally wise",
    "synonym2ExampleSentence": "The thrifty cut stretched the cloth, a thread in the tight weave.",
    "synonym3": "foresighted",
    "synonym3Definition": "planning ahead with insight, keenly prepared",
    "synonym3ExampleSentence": "His foresighted move stocked the barn, a shield in the storm’s eye."
  },
  {
    "word": "proviso",
    "definition": "a condition or stipulation attached to an agreement",
    "exampleSentence": "The deal came with a proviso of silence, a lock on their loose tongues.",
    "synonym1": "condition",
    "synonym1Definition": "a requirement or term, bindingly set",
    "synonym1ExampleSentence": "The condition of her stay tied her, a chain in the house’s hush.",
    "synonym2": "stipulation",
    "synonym2Definition": "a specific demand or clause, firmly stated",
    "synonym2ExampleSentence": "His stipulation held the pact, a line in their quick talk.",
    "synonym3": "caveat",
    "synonym3Definition": "a warning or qualification, cautiously noted",
    "synonym3ExampleSentence": "The caveat slowed their yes, a pause in the deal’s rush."
  },
  {
    "word": "puerile",
    "definition": "childishly silly or immature, trivially foolish",
    "exampleSentence": "His puerile prank drew groans, a giggle too young for their gray heads.",
    "synonym1": "juvenile",
    "synonym1Definition": "youthfully immature or silly, boyishly light",
    "synonym1ExampleSentence": "The juvenile jest missed its mark, a skip in the room’s weight.",
    "synonym2": "immature",
    "synonym2Definition": "not fully developed or grown, youthfully raw",
    "synonym2ExampleSentence": "Her immature sulk dimmed the cheer, a pout in the day’s glow.",
    "synonym3": "childish",
    "synonym3Definition": "befitting a child, foolishly simple",
    "synonym3ExampleSentence": "The childish whine irked them, a cry past its tender years."
  },
  {
    "word": "pugnacious",
    "definition": "eager or quick to argue or fight, aggressively combative",
    "exampleSentence": "His pugnacious glare sparked the fray, a flint in the room’s dry air.",
    "synonym1": "belligerent",
    "synonym1Definition": "hostile and ready to clash, fiercely warlike",
    "synonym1ExampleSentence": "The belligerent shout broke peace, a roar in the still dusk.",
    "synonym2": "quarrelsome",
    "synonym2Definition": "prone to dispute or bicker, testily contentious",
    "synonym2ExampleSentence": "Her quarrelsome snap lit the talk, a barb in their soft hum.",
    "synonym3": "combative",
    "synonym3Definition": "ready to engage or oppose, fightingly bold",
    "synonym3ExampleSentence": "His combative stance raised fists, a wall in the crowd’s sway."
  },
  {
    "word": "pulchritude",
    "definition": "physical beauty or comeliness, strikingly lovely",
    "exampleSentence": "The pulchritude of the dawn caught her breath, a blush over the hill’s curve.",
    "synonym1": "beauty",
    "synonym1Definition": "a quality that delights the senses, pleasingly fine",
    "synonym1ExampleSentence": "The beauty of her song held them, a note in the air’s hush.",
    "synonym2": "loveliness",
    "synonym2Definition": "charming attractiveness, sweetly fair",
    "synonym2ExampleSentence": "The loveliness of the bloom drew eyes, a petal in the green sea.",
    "synonym3": "gorgeousness",
    "synonym3Definition": "splendid or striking beauty, richly stunning",
    "synonym3ExampleSentence": "Her gorgeousness lit the room, a shine past the dim’s reach."
  },
  {
    "word": "quandary",
    "definition": "a state of uncertainty or perplexity",
    "exampleSentence": "She faced a quandary over which path to take.",
    "synonym1": "dilemma",
    "synonym1Definition": "a situation requiring a tough choice",
    "synonym1ExampleSentence": "The dilemma kept her awake all night.",
    "synonym2": "predicament",
    "synonym2Definition": "a difficult or unpleasant situation",
    "synonym2ExampleSentence": "His predicament left him with few options.",
    "synonym3": "plight",
    "synonym3Definition": "a dangerous or difficult circumstance",
    "synonym3ExampleSentence": "The plight of the stranded hikers grew dire."
  },
  {
    "word": "querulous",
    "definition": "complaining in a petulant manner",
    "exampleSentence": "His querulous tone grated on everyone in the room.",
    "synonym1": "whiny",
    "synonym1Definition": "complaining in a high-pitched way",
    "synonym1ExampleSentence": "The whiny child demanded more candy.",
    "synonym2": "peevish",
    "synonym2Definition": "easily irritated or annoyed",
    "synonym2ExampleSentence": "Her peevish mood soured the morning.",
    "synonym3": "fretful",
    "synonym3Definition": "showing distress or irritation",
    "synonym3ExampleSentence": "The fretful passenger paced the platform."
  },
  {
    "word": "quixotic",
    "definition": "unrealistically optimistic or impractical",
    "exampleSentence": "His quixotic dream of world peace charmed but baffled the crowd.",
    "synonym1": "idealistic",
    "synonym1Definition": "pursuing perfection, often unrealistically",
    "synonym1ExampleSentence": "Her idealistic vision ignored practical limits.",
    "synonym2": "utopian",
    "synonym2Definition": "modeled on an impossibly perfect ideal",
    "synonym2ExampleSentence": "The utopian plan overlooked human flaws.",
    "synonym3": "visionary",
    "synonym3Definition": "thinking about the future with imagination",
    "synonym3ExampleSentence": "His visionary ideas inspired bold changes."
  },
  {
    "word": "rancor",
    "definition": "bitter resentment or ill will",
    "exampleSentence": "Years of rivalry left a rancor that wouldn’t fade.",
    "synonym1": "animosity",
    "synonym1Definition": "strong hostility or hatred",
    "synonym1ExampleSentence": "The animosity between them was palpable.",
    "synonym2": "enmity",
    "synonym2Definition": "a state of deep-seated ill will",
    "synonym2ExampleSentence": "Their enmity grew with each confrontation.",
    "synonym3": "malice",
    "synonym3Definition": "desire to harm others",
    "synonym3ExampleSentence": "Her malice fueled the harsh words."
  },
  {
    "word": "recalcitrant",
    "definition": "resisting authority or control",
    "exampleSentence": "The recalcitrant student ignored every rule set before him.",
    "synonym1": "defiant",
    "synonym1Definition": "openly resistant or challenging",
    "synonym1ExampleSentence": "Her defiant glare met the teacher’s stern words.",
    "synonym2": "rebellious",
    "synonym2Definition": "showing a desire to resist authority",
    "synonym2ExampleSentence": "The rebellious crowd chanted against the decree.",
    "synonym3": "intractable",
    "synonym3Definition": "hard to control or manage",
    "synonym3ExampleSentence": "The intractable problem stumped even the experts."
  },
  {
    "word": "recondite",
    "definition": "little known or understood, often dealing with obscure or abstruse subjects",
    "exampleSentence": "The scholar’s recondite lecture on ancient scripts left the audience intrigued but slightly lost.",
    "synonym1": "abstruse",
    "synonym1Definition": "difficult to comprehend, requiring specialized knowledge",
    "synonym1ExampleSentence": "The abstruse mathematical proof baffled even the seasoned professors in attendance.",
    "synonym2": "arcane",
    "synonym2Definition": "mysterious and secret, understood by only a select few",
    "synonym2ExampleSentence": "The arcane rituals of the order were whispered about but rarely witnessed.",
    "synonym3": "esoteric",
    "synonym3Definition": "intended for or accessible only to a small, initiated group",
    "synonym3ExampleSentence": "Her esoteric knowledge of rare plants impressed the botanists at the conference."
  },
  {
    "word": "reprobate",
    "definition": "an unprincipled or depraved person",
    "exampleSentence": "The reprobate smirked as he dodged the rules.",
    "synonym1": "rogue",
    "synonym1Definition": "a dishonest or mischievous person",
    "synonym1ExampleSentence": "The rogue slipped away with the loot.",
    "synonym2": "scoundrel",
    "synonym2Definition": "a wicked or disreputable person",
    "synonym2ExampleSentence": "The scoundrel cheated them all.",
    "synonym3": "miscreant",
    "synonym3Definition": "a person who behaves badly",
    "synonym3ExampleSentence": "The miscreant disrupted the quiet town."
  },
  {
    "word": "sagacity",
    "definition": "keen perception and sound judgment",
    "exampleSentence": "Her sagacity guided the group through the crisis.",
    "synonym1": "wisdom",
    "synonym1Definition": "the ability to make sound decisions",
    "synonym1ExampleSentence": "His wisdom shone in tough times.",
    "synonym2": "prudence",
    "synonym2Definition": "careful and sensible judgment",
    "synonym2ExampleSentence": "Her prudence saved them from ruin.",
    "synonym3": "insight",
    "synonym3Definition": "deep understanding of a situation",
    "synonym3ExampleSentence": "His insight revealed the hidden truth."
  },
  {
    "word": "salubrious",
    "definition": "promoting health or well-being, especially in a pleasant or beneficial way",
    "exampleSentence": "The salubrious mountain air invigorated the hikers, clearing their minds and lungs alike.",
    "synonym1": "healthful",
    "synonym1Definition": "conducive to good health, enhancing physical or mental vitality",
    "synonym1ExampleSentence": "The healthful diet of fresh fruits and vegetables boosted her energy for weeks.",
    "synonym2": "wholesome",
    "synonym2Definition": "suggestive of good health and moral well-being, often pure or simple",
    "synonym2ExampleSentence": "The wholesome meal of homemade soup warmed both body and soul on the chilly evening.",
    "synonym3": "beneficial",
    "synonym3Definition": "producing favorable effects or advantages, contributing to improvement",
    "synonym3ExampleSentence": "The beneficial effects of daily meditation became evident in her calmer demeanor."
  },
  {
    "word": "sanguine",
    "definition": "optimistic or positive, especially in difficulty",
    "exampleSentence": "Despite setbacks, she remained sanguine about the outcome.",
    "synonym1": "buoyant",
    "synonym1Definition": "cheerful and optimistic",
    "synonym1ExampleSentence": "His buoyant mood lifted the team’s spirits.",
    "synonym2": "hopeful",
    "synonym2Definition": "feeling or inspiring optimism",
    "synonym2ExampleSentence": "The hopeful tone of the letter encouraged them.",
    "synonym3": "cheerful",
    "synonym3Definition": "noticeably happy and positive",
    "synonym3ExampleSentence": "Her cheerful outlook brightened the gloomy day."
  },
  {
    "word": "serendipity",
    "definition": "the occurrence of fortunate discoveries by accident",
    "exampleSentence": "Finding that book in the thrift store was pure serendipity.",
    "synonym1": "chance",
    "synonym1Definition": "a possibility of something happening; an opportunity",
    "synonym1ExampleSentence": "They crossed paths by chance on a rainy afternoon.",
    "synonym2": "fortuity",
    "synonym2Definition": "a chance occurrence, especially a fortunate one",
    "synonym2ExampleSentence": "By fortuity, she stumbled upon the perfect gift.",
    "synonym3": "luck",
    "synonym3Definition": "success or failure brought by chance",
    "synonym3ExampleSentence": "It was luck that led him to the winning ticket."
  },
  {
    "word": "soporific",
    "definition": "tending to induce drowsiness or sleep",
    "exampleSentence": "The soporific lecture had half the class nodding off.",
    "synonym1": "sedative",
    "synonym1Definition": "promoting calm or sleep",
    "synonym1ExampleSentence": "The sedative tea eased her into rest.",
    "synonym2": "somnolent",
    "synonym2Definition": "inclined to or causing sleepiness",
    "synonym2ExampleSentence": "The somnolent hum of the fan lulled him.",
    "synonym3": "hypnotic",
    "synonym3Definition": "inducing a trance-like state or sleep",
    "synonym3ExampleSentence": "The hypnotic rhythm rocked her to sleep."
  },
  {
    "word": "taciturn",
    "definition": "reserved or uncommunicative in speech",
    "exampleSentence": "His taciturn demeanor made him a mystery to his peers.",
    "synonym1": "reticent",
    "synonym1Definition": "not revealing one’s thoughts readily",
    "synonym1ExampleSentence": "She was reticent about her plans for the future.",
    "synonym2": "silent",
    "synonym2Definition": "not speaking or making noise",
    "synonym2ExampleSentence": "The silent figure stood apart from the chatter.",
    "synonym3": "reserved",
    "synonym3Definition": "slow to reveal emotions or opinions",
    "synonym3ExampleSentence": "His reserved nature kept conversations brief."
  },
  {
    "word": "tenebrous",
    "definition": "dark, shadowy, or obscure",
    "exampleSentence": "The tenebrous forest hid many secrets.",
    "synonym1": "murky",
    "synonym1Definition": "dark and gloomy",
    "synonym1ExampleSentence": "The murky waters concealed dangers.",
    "synonym2": "dim",
    "synonym2Definition": "lacking brightness or clarity",
    "synonym2ExampleSentence": "The dim light made reading hard.",
    "synonym3": "shadowy",
    "synonym3Definition": "full of shade or indistinct",
    "synonym3ExampleSentence": "The shadowy figure vanished quickly."
  },
  {
    "word": "tenuous",
    "definition": "very weak or slight",
    "exampleSentence": "The connection between the two events was tenuous, based only on timing.",
    "synonym1": "fragile",
    "synonym1Definition": "easily broken or delicate",
    "synonym1ExampleSentence": "The fragile truce between the factions lasted mere days.",
    "synonym2": "flimsy",
    "synonym2Definition": "weak or insubstantial",
    "synonym2ExampleSentence": "His flimsy excuse for missing the deadline fooled no one.",
    "synonym3": "slender",
    "synonym3Definition": "thin or barely sufficient",
    "synonym3ExampleSentence": "She clung to a slender hope of finding her lost journal."
  },
  {
    "word": "torpid",
    "definition": "mentally or physically inactive; sluggish",
    "exampleSentence": "After a heavy meal, he felt torpid and sank into the couch.",
    "synonym1": "lethargic",
    "synonym1Definition": "lacking energy or enthusiasm",
    "synonym1ExampleSentence": "The humid afternoon left the team feeling lethargic and slow.",
    "synonym2": "listless",
    "synonym2Definition": "lacking vitality or interest",
    "synonym2ExampleSentence": "She wandered the house listless, unsure of what to do next.",
    "synonym3": "inert",
    "synonym3Definition": "lacking the ability or energy to move",
    "synonym3ExampleSentence": "The inert lump of clay sat untouched on the table."
  },
  {
    "word": "truculent",
    "definition": "fiercely aggressive or defiant",
    "exampleSentence": "His truculent outburst startled the quiet group.",
    "synonym1": "belligerent",
    "synonym1Definition": "hostile and ready to fight",
    "synonym1ExampleSentence": "The belligerent tone set everyone on edge.",
    "synonym2": "surly",
    "synonym2Definition": "bad-tempered and unfriendly",
    "synonym2ExampleSentence": "The surly clerk snapped at every question.",
    "synonym3": "bellicose",
    "synonym3Definition": "demonstrating eagerness to fight",
    "synonym3ExampleSentence": "His bellicose stance invited conflict."
  },
  {
    "word": "turgid",
    "definition": "swollen or bloated, or excessively ornate and complex in style",
    "exampleSentence": "The turgid prose of the novel bogged down its promising plot with endless flowery descriptions.",
    "synonym1": "pompous",
    "synonym1Definition": "grandiosely self-important, often with exaggerated language",
    "synonym1ExampleSentence": "His pompous speech at the gala dripped with self-praise no one else shared.",
    "synonym2": "bombastic",
    "synonym2Definition": "high-sounding but empty, inflated with little substance",
    "synonym2ExampleSentence": "The bombastic politician’s promises rang hollow after years of inaction.",
    "synonym3": "overblown",
    "synonym3Definition": "excessively elaborate or exaggerated beyond reason",
    "synonym3ExampleSentence": "The overblown rhetoric of the advertisement made the product seem suspicious."
  },
  {
    "word": "ubiquitous",
    "definition": "present, appearing, or found everywhere",
    "exampleSentence": "Coffee shops have become ubiquitous in the city’s downtown area.",
    "synonym1": "omnipresent",
    "synonym1Definition": "present everywhere at the same time",
    "synonym1ExampleSentence": "Cameras seemed omnipresent in the bustling streets.",
    "synonym2": "pervasive",
    "synonym2Definition": "spreading widely throughout an area or group",
    "synonym2ExampleSentence": "The pervasive scent of flowers filled the garden air.",
    "synonym3": "universal",
    "synonym3Definition": "existing or affecting everywhere or everyone",
    "synonym3ExampleSentence": "The universal appeal of the song crossed all borders."
  },
  {
    "word": "ubiquity",
    "definition": "the state of being everywhere at once",
    "exampleSentence": "The ubiquity of smartphones has changed how we connect.",
    "synonym1": "prevalence",
    "synonym1Definition": "the condition of being widespread",
    "synonym1ExampleSentence": "The prevalence of the trend surprised analysts.",
    "synonym2": "omnipresence",
    "synonym2Definition": "the state of being present everywhere",
    "synonym2ExampleSentence": "The omnipresence of ads made them hard to ignore.",
    "synonym3": "pervasiveness",
    "synonym3Definition": "the quality of spreading widely",
    "synonym3ExampleSentence": "The pervasiveness of the idea shaped policy."
  },
  {
    "word": "umbrage",
    "definition": "offense or annoyance",
    "exampleSentence": "She took umbrage at his casual remark.",
    "synonym1": "resentment",
    "synonym1Definition": "bitter indignation at being wronged",
    "synonym1ExampleSentence": "His resentment grew with each slight.",
    "synonym2": "irritation",
    "synonym2Definition": "mild anger or annoyance",
    "synonym2ExampleSentence": "Her irritation showed in her tone.",
    "synonym3": "pique",
    "synonym3Definition": "a feeling of wounded pride",
    "synonym3ExampleSentence": "His pique was evident after the snub."
  },
  {
    "word": "unctuous",
    "definition": "excessively flattering or ingratiating, often with an oily or insincere tone",
    "exampleSentence": "The salesman’s unctuous praise of her taste made her wary of his true intentions.",
    "synonym1": "obsequious",
    "synonym1Definition": "overly servile or attentive, seeking favor through excessive politeness",
    "synonym1ExampleSentence": "The obsequious waiter hovered too close, eager for a generous tip.",
    "synonym2": "fawning",
    "synonym2Definition": "displaying exaggerated affection or flattery to please someone",
    "synonym2ExampleSentence": "Her fawning compliments to the boss irritated her more genuine colleagues.",
    "synonym3": "sycophantic",
    "synonym3Definition": "acting subserviently to gain approval, often with ulterior motives",
    "synonym3ExampleSentence": "The sycophantic aide’s constant agreement with the leader earned him few real friends."
  },
  {
    "word": "untenable",
    "definition": "not able to be maintained or defended",
    "exampleSentence": "Her untenable position crumbled under scrutiny.",
    "synonym1": "indefensible",
    "synonym1Definition": "not justifiable or supportable",
    "synonym1ExampleSentence": "The indefensible claim fell apart quickly.",
    "synonym2": "unsustainable",
    "synonym2Definition": "unable to be upheld over time",
    "synonym2ExampleSentence": "The unsustainable pace exhausted the team.",
    "synonym3": "unviable",
    "synonym3Definition": "not capable of working successfully",
    "synonym3ExampleSentence": "The unviable plan was soon abandoned."
  },
  {
    "word": "vacillate",
    "definition": "to waver between different opinions or actions",
    "exampleSentence": "He tended to vacillate when faced with tough choices.",
    "synonym1": "hesitate",
    "synonym1Definition": "to pause before deciding or acting",
    "synonym1ExampleSentence": "She hesitated before stepping into the unknown.",
    "synonym2": "waver",
    "synonym2Definition": "to be unsteady or uncertain",
    "synonym2ExampleSentence": "His resolve began to waver under pressure.",
    "synonym3": "oscillate",
    "synonym3Definition": "to move or swing back and forth",
    "synonym3ExampleSentence": "Her mood seemed to oscillate with the weather."
  },
  {
    "word": "venal",
    "definition": "showing or motivated by susceptibility to bribery or corruption",
    "exampleSentence": "The venal official accepted lavish gifts in exchange for overlooking shady business deals.",
    "synonym1": "corrupt",
    "synonym1Definition": "dishonest or unethical, willing to act illegally for personal gain",
    "synonym1ExampleSentence": "The corrupt judge’s rulings always favored the highest bidder in his courtroom.",
    "synonym2": "mercenary",
    "synonym2Definition": "primarily concerned with making money, often at the expense of ethics",
    "synonym2ExampleSentence": "The mercenary consultant cared only for profit, not the client’s long-term success.",
    "synonym3": "bribery-prone",
    "synonym3Definition": "easily swayed or influenced by illicit payments or rewards",
    "synonym3ExampleSentence": "The bribery-prone council member’s decisions often aligned with the wealthiest donors."
  },
  {
    "word": "venerate",
    "definition": "to regard with great respect or reverence",
    "exampleSentence": "The community gathered to venerate the traditions of their ancestors.",
    "synonym1": "revere",
    "synonym1Definition": "to feel deep respect or admiration for",
    "synonym1ExampleSentence": "They revere the old oak tree as a symbol of strength.",
    "synonym2": "honor",
    "synonym2Definition": "to show high respect or esteem",
    "synonym2ExampleSentence": "The ceremony was held to honor the retiring professor.",
    "synonym3": "exalt",
    "synonym3Definition": "to praise highly or elevate in rank",
    "synonym3ExampleSentence": "The poet’s words exalt the beauty of the natural world."
  },
  {
    "word": "veracity",
    "definition": "truthfulness or accuracy",
    "exampleSentence": "The veracity of his tale was questioned by all.",
    "synonym1": "truth",
    "synonym1Definition": "conformity with fact or reality",
    "synonym1ExampleSentence": "The truth of her words shone through.",
    "synonym2": "authenticity",
    "synonym2Definition": "the quality of being genuine",
    "synonym2ExampleSentence": "The authenticity of the artifact amazed them.",
    "synonym3": "credibility",
    "synonym3Definition": "the quality of being believable",
    "synonym3ExampleSentence": "His credibility bolstered the argument."
  },
  {
    "word": "vexation",
    "definition": "the state of being annoyed or frustrated",
    "exampleSentence": "The delay caused her no small vexation.",
    "synonym1": "annoyance",
    "synonym1Definition": "mild anger or irritation",
    "synonym1ExampleSentence": "The noise was a constant annoyance.",
    "synonym2": "exasperation",
    "synonym2Definition": "intense irritation or frustration",
    "synonym2ExampleSentence": "His exasperation boiled over at last.",
    "synonym3": "chagrin",
    "synonym3Definition": "distress caused by disappointment",
    "synonym3ExampleSentence": "To her chagrin, the plan failed."
  },
  {
    "word": "wanton",
    "definition": "deliberate and unprovoked; reckless",
    "exampleSentence": "The wanton destruction of the park angered the community.",
    "synonym1": "reckless",
    "synonym1Definition": "heedless of danger or consequences",
    "synonym1ExampleSentence": "His reckless driving alarmed his passengers.",
    "synonym2": "willful",
    "synonym2Definition": "done deliberately or intentionally",
    "synonym2ExampleSentence": "The willful act of defiance stunned the group.",
    "synonym3": "gratuitous",
    "synonym3Definition": "uncalled for or without reason",
    "synonym3ExampleSentence": "The gratuitous insult soured the evening."
  },
  {
    "word": "winsome",
    "definition": "attractive or appealing in a fresh way",
    "exampleSentence": "Her winsome smile won over the stern judge.",
    "synonym1": "charming",
    "synonym1Definition": "pleasantly attractive or delightful",
    "synonym1ExampleSentence": "The charming village drew many visitors.",
    "synonym2": "engaging",
    "synonym2Definition": "capturing interest or attention",
    "synonym2ExampleSentence": "His engaging story held them spellbound.",
    "synonym3": "captivating",
    "synonym3Definition": "powerfully holding attention",
    "synonym3ExampleSentence": "The captivating melody lingered in their minds."
  },
  {
    "word": "wistful",
    "definition": "having a feeling of vague or regretful longing",
    "exampleSentence": "She cast a wistful glance at the old photo.",
    "synonym1": "yearning",
    "synonym1Definition": "having an intense longing",
    "synonym1ExampleSentence": "His yearning gaze followed the horizon.",
    "synonym2": "nostalgic",
    "synonym2Definition": "longing for the past",
    "synonym2ExampleSentence": "The nostalgic tune stirred memories.",
    "synonym3": "pensive",
    "synonym3Definition": "deeply thoughtful, often sadly",
    "synonym3ExampleSentence": "Her pensive mood lingered all day."
  },
  {
    "word": "xenophile",
    "definition": "a person attracted to foreign peoples, cultures, or customs",
    "exampleSentence": "As a xenophile, she eagerly sampled spicy dishes and learned greetings in every language she encountered.",
    "synonym1": "cosmopolitan",
    "synonym1Definition": "familiar with and at ease in many different cultures or countries",
    "synonym1ExampleSentence": "His cosmopolitan outlook made him a natural fit for the international team.",
    "synonym2": "globetrotter",
    "synonym2Definition": "someone who travels widely, often embracing diverse ways of life",
    "synonym2ExampleSentence": "The globetrotter regaled us with tales of markets in Morocco and temples in Japan.",
    "synonym3": "culture-seeker",
    "synonym3Definition": "an individual drawn to explore and appreciate the traditions of other societies",
    "synonym3ExampleSentence": "The culture-seeker spent hours photographing the vibrant festival in the remote village."
  },
  {
    "word": "xenophobic",
    "definition": "having fear or hatred of foreigners",
    "exampleSentence": "The xenophobic rhetoric stirred unease among visitors.",
    "synonym1": "prejudiced",
    "synonym1Definition": "having an unreasonable dislike or bias",
    "synonym1ExampleSentence": "His prejudiced views clouded his judgment.",
    "synonym2": "intolerant",
    "synonym2Definition": "unwilling to accept differences",
    "synonym2ExampleSentence": "The intolerant crowd shouted down the speaker.",
    "synonym3": "bigoted",
    "synonym3Definition": "stubbornly attached to prejudiced beliefs",
    "synonym3ExampleSentence": "Her bigoted remarks alienated her peers."
  },
  {
    "word": "yearn",
    "definition": "to have an intense longing or desire",
    "exampleSentence": "She seemed to yearn for the days of her youth.",
    "synonym1": "crave",
    "synonym1Definition": "to feel a powerful desire for",
    "synonym1ExampleSentence": "He began to crave the quiet of the countryside.",
    "synonym2": "pine",
    "synonym2Definition": "to long painfully for something lost",
    "synonym2ExampleSentence": "She pined for the friend who moved away.",
    "synonym3": "hanker",
    "synonym3Definition": "to have a strong or persistent desire",
    "synonym3ExampleSentence": "He hankered for a taste of homemade pie."
  },
  {
    "word": "yoke",
    "definition": "a burden or means of control",
    "exampleSentence": "The yoke of tradition weighed on their choices.",
    "synonym1": "burden",
    "synonym1Definition": "a heavy load or responsibility",
    "synonym1ExampleSentence": "The burden of debt slowed his plans.",
    "synonym2": "shackle",
    "synonym2Definition": "a restraint that limits freedom",
    "synonym2ExampleSentence": "The shackle of rules bound her creativity.",
    "synonym3": "oppression",
    "synonym3Definition": "prolonged harsh control",
    "synonym3ExampleSentence": "The oppression stifled their voices."
  },
  {
    "word": "zealous",
    "definition": "having great enthusiasm or passion",
    "exampleSentence": "Her zealous pursuit of justice inspired the team.",
    "synonym1": "fervent",
    "synonym1Definition": "showing passionate intensity",
    "synonym1ExampleSentence": "His fervent speech rallied the crowd.",
    "synonym2": "ardent",
    "synonym2Definition": "characterized by strong enthusiasm",
    "synonym2ExampleSentence": "The ardent fan cheered louder than anyone.",
    "synonym3": "passionate",
    "synonym3Definition": "showing intense emotion or commitment",
    "synonym3ExampleSentence": "Her passionate defense won over skeptics."
  },
  {
    "word": "zenith",
    "definition": "the highest point or peak",
    "exampleSentence": "Her career reached its zenith with that award.",
    "synonym1": "apex",
    "synonym1Definition": "the top or highest point",
    "synonym1ExampleSentence": "The apex of the mountain loomed ahead.",
    "synonym2": "pinnacle",
    "synonym2Definition": "the most successful point",
    "synonym2ExampleSentence": "He stood at the pinnacle of his profession.",
    "synonym3": "summit",
    "synonym3Definition": "the highest attainable level",
    "synonym3ExampleSentence": "The summit of her efforts was celebrated."
  },
  {
    "word": "zephyr",
    "definition": "a gentle, mild breeze",
    "exampleSentence": "A zephyr rustled the leaves on the quiet afternoon.",
    "synonym1": "breeze",
    "synonym1Definition": "a light, refreshing wind",
    "synonym1ExampleSentence": "The breeze cooled the warm day.",
    "synonym2": "gust",
    "synonym2Definition": "a brief, strong rush of wind",
    "synonym2ExampleSentence": "A gust lifted the kite higher.",
    "synonym3": "draft",
    "synonym3Definition": "a current of air",
    "synonym3ExampleSentence": "The draft slipped through the window."
  }
]
