[
  {
    "word": "ephemeral",
    "definition": "lasting for a very short time",
    "exampleSentence": "The ephemeral nature of fashion trends makes it difficult for retailers to plan their inventory.",
    "synonym1": "transient",
    "synonym1Definition": "lasting only for a short time; impermanent",
    "synonym1ExampleSentence": "The beauty of cherry blossoms is transient, lasting only a few days each spring.",
    "synonym2": "fleeting",
    "synonym2Definition": "passing quickly; lasting only a brief time",
    "synonym2ExampleSentence": "She caught a fleeting glimpse of the rare bird before it disappeared into the forest.",
    "synonym3": "momentary",
    "synonym3Definition": "lasting for a very short time; brief",
    "synonym3ExampleSentence": "There was a momentary silence before the audience erupted in applause."
  },
  {
    "word": "ubiquitous",
    "definition": "present, appearing, or found everywhere",
    "exampleSentence": "Smartphones have become ubiquitous in modern society, with people of all ages using them daily.",
    "synonym1": "omnipresent",
    "synonym1Definition": "present everywhere at the same time",
    "synonym1ExampleSentence": "In modern society, technology has become omnipresent in our daily lives.",
    "synonym2": "pervasive",
    "synonym2Definition": "spreading widely throughout an area or a group of people",
    "synonym2ExampleSentence": "The pervasive influence of social media has transformed how we communicate.",
    "synonym3": "universal",
    "synonym3Definition": "existing or affecting everywhere or everyone",
    "synonym3ExampleSentence": "The desire for happiness seems to be a universal human trait."
  },
  {
    "word": "serendipity",
    "definition": "the occurrence of fortunate discoveries by accident",
    "exampleSentence": "The discovery of penicillin was a case of serendipity when Alexander Fleming noticed mold killing bacteria in his petri dishes.",
    "synonym1": "chance",
    "synonym1Definition": "a possibility of something happening; an opportunity",
    "synonym1ExampleSentence": "They met by chance at a coffee shop and became lifelong friends.",
    "synonym2": "fortuity",
    "synonym2Definition": "a chance occurrence, especially a fortunate one",
    "synonym2ExampleSentence": "By a happy fortuity, she found the perfect job just when she needed it most.",
    "synonym3": "luck",
    "synonym3Definition": "success or failure apparently brought by chance rather than through one's own actions",
    "synonym3ExampleSentence": "It was pure luck that we arrived just as they were giving away free tickets."
  },
  {
    "word": "aberration",
    "definition": "a departure from what is normal, usual, or expected",
    "exampleSentence": "The recent drop in temperature is an aberration for this time of year, as it's typically much warmer in July.",
    "synonym1": "anomaly",
    "synonym1Definition": "something that deviates from what is standard, normal, or expected",
    "synonym1ExampleSentence": "The unusually cold summer was an anomaly in the region's typically warm climate.",
    "synonym2": "deviation",
    "synonym2Definition": "the action of departing from an established course or standard",
    "synonym2ExampleSentence": "Any deviation from the recipe could affect the final taste of the dish.",
    "synonym3": "irregularity",
    "synonym3Definition": "a thing that is irregular in form, amount, or occurrence",
    "synonym3ExampleSentence": "The doctor noticed an irregularity in the patient's heartbeat."
  },
  {
    "word": "abhor",
    "definition": "to regard with disgust and hatred",
    "exampleSentence": "Many people abhor cruelty to animals and support laws that protect them from mistreatment.",
    "synonym1": "detest",
    "synonym1Definition": "to dislike intensely",
    "synonym1ExampleSentence": "She detests violence in any form and always advocates for peaceful solutions.",
    "synonym2": "loathe",
    "synonym2Definition": "to feel intense dislike or disgust for",
    "synonym2ExampleSentence": "He loathes getting up early on weekends after a long work week.",
    "synonym3": "despise",
    "synonym3Definition": "to feel contempt or a deep repugnance for",
    "synonym3ExampleSentence": "Many people despise dishonesty and value truthfulness in their relationships."
  },
  {
    "word": "acquiesce",
    "definition": "to accept something reluctantly but without protest",
    "exampleSentence": "Though she disagreed with the decision, she acquiesced to her manager's plan to avoid conflict in the workplace.",
    "synonym1": "comply",
    "synonym1Definition": "to act in accordance with a wish or command",
    "synonym1ExampleSentence": "The student complied with the teacher's request to rewrite the essay.",
    "synonym2": "consent",
    "synonym2Definition": "to give permission for something to happen",
    "synonym2ExampleSentence": "After much discussion, her parents finally consented to let her attend the concert.",
    "synonym3": "yield",
    "synonym3Definition": "to give way to arguments, demands, or pressure",
    "synonym3ExampleSentence": "The committee yielded to public pressure and reversed their decision."
  }
] 